{"review":"This is a very positive review: My unit looked pretty much as pictured except I have what resembles duct tape around the center of mine to cover the surprisingly sloppy glue job of putting the two halves together.  The sloppiness of the adhesive is very apparent on the inside but so far no leaks and the brown glue hasn't come off on my clothes that I have noticed. UPDATE: after seeing a recent reviewer remark about the seam problem and leakage I took more notice of mine and sure enough, the tape was coming away and it was because of seepage - I emailed customer service on Saturday, they responded on Monday morning right away they were sending a replacement and I had it Wednesday. You really can't ask for better service.  So, they had a bad batch and that can certainly happen with all the offshore mfrg these days.  Mine did come with some instructions and there is a little diagram at the bottom of the sheet and it is not really hard to put together if you even look at the picture here. It did not come with an extra handle as some have said but then again if you break the handle you are doing it wrong. This is not hard to crank if you hit the \"sweet spot\" of load's water\/clothes ratio. I didn't think the stand was as flimsy as people are saying.  A lightweight tubular metal might be a nicer touch but this is serviceable. One of the warnings they give I cannot understand: \"Do not release the pressure lid of machine if machine is still hot as vacuum can form when machine cools down\" - huh?  If you opened the lid you can't have a vacuum. Don't understand - I think they mean to drain with the tube rather than open lid if machine is hot. I think.The washing instructions are maybe easier if you have a scale to weigh your load, if they gave some average examples it would be better.  They don't mention whether chlorine bleach is safe (I was thinking of the glue) or how much of it to use and the amount of detergent though they list, I am sure can vary by concentration so it is a learning curve.  I did use chlorine bleach on two loads of whites and the glue has not disintegrated but I will try to limit my use of it in case - I am using about a tablespoon for a full load of 6 quarts.  I am going to email mfr and ask - will update here.  One word of warning - if you use bleach do not have face near opening when you you unscrew lid!  Whew, close call there lung full of hot bleach fumes - not nice.  UPDATE - I did email customer service during normal business hours and they responded within the hour that it is safe to use chlorine bleach.  I can tell you I have used 1 tablespoon to a full load (6 qts). The directions on the bleach bottle for 1 gallon of water is a quarter cup.  YMMV - I may up what I am using a bit but be careful when you open, it can be really fumey!I did better on my second load. By my third load I was a pro. On my fourth and fifth loads I got complacent and didn't tighten the lid down properly and OOPS flood.  My fault entirely but my sixth load was the two bath mats I used to soak up the deluges :) from 4th and 5th loads. It handled the two bathmat\/towels fine.My logistics: no room in the kitchen so I am using the bathroom.  It doesn't fit in my tub very well - I believe this is a nonstandard (like everything here) small tub.  So for my second load I dragged and manhandled a sturdy occasional table through the nonstandard small doorway to hold this (and the spinner after)next to tub but there was only about an inch of clearance around table and I could barely reach the tub faucets.  So I picked up a sturdy fairly large step stool that is just a little lower than tub edge, but drain tube is high enough to clear. I fill it up with measured hot water with a pitcher.  For rinses, I do two - sort of- with cold water and I use my shower massage, first swishing them up a bit with the shower going in there with drain tube attached and let it run out a bit. Then pull tube and I close it up with a good amount of water and give it a couple of spins. And you definitely want a spinner\/extractor if you are going to do real laundry, of course.Now why you would want to put yourself through this if you are not a camper\/nature enthusiast\/environmentalist? I have had my eyes on this and similar items for awhile now as I went from a condo with my own washer and dryer to an efficiency (nothing efficient about this place) apt that not only does not allow a real portable but there is no where to put it.  My kitchen area is the size of two telephone booths and my bathroom a single telephone booth.  The laundry facilities were initially clean here but have gone downhill to a level of filth I simply can't reach with disinfectant wipes (you don't want to know what I discovered in the non user-removable lint strainer of the washers) and have seen people putting damp dirty towels and sheets and clothes into the dryer to save money bragging they are so \"clever\". No, they are filthy disgusting pigs. This isn't the venue I guess to talk about the laundrymat miseries. Pardon tangent.Summary: I would recommend, I take off one star for the really sloppy glue job inside, you don't see it but your clothes are certainly rubbing against the brown adhesive and you have to wonder when something is going to come off on your good white blouse."}
{"review":"This is a very positive review: This helps me a lot. I used to have to wash a small amount at a time in the kitchen sink. Now I can wash more at a time and my clothes got clean. One happy woman."}
{"review":"This is a negative review: After not using my little washer for a few months I needed to use it while camping.  I am so irritated that it will not seal at the lid now. It keeps leaking all over the place making a huge mess. Upon looking closer I realized the top seal is completely apart and unglued.  No way to reseal it. I had only used this a few times when I received it and can't believe it fell apart like this already."}
{"review":"This is a very positive review: Beautiful little tool for manually washing clothes.  Perfect for a disaster scenario or just to hand wash a few items in an emergency.  Love this thing."}
{"review":"This is a positive review: Got it with a spin dryer.  Keeps me from using a crowded laundry room where they are mostly offended by people who wear face masks and like social distancing.  I presoak, don't over-pack with clothes and keep up with the wash.  In other words, know how to do laundry from my mom and her generation. Checked YouTube and saw how others used it too.  Then you figure it out for you."}
{"review":"This is a very positive review: My washing machine broke at the start of the recent quarantine, and I'm still waiting for an appointment to have it fixed.  With most laundromats closed, in desperation I bought a Wonderwash, hoping it would tide me over until I can get my washing machine fixed.This little machine is great! It is well-made and all the parts feel sturdy and high-quality.  It arrives unassembled but is a breeze to put together, it takes five minutes and no tools. I highly recommend watching one of the instructional Youtube videos before doing your first load of wash, it explains the process thoroughly, but the basics are: determine load size, add a small amount of detergent and fill with hot or warm water to the fill line. Add clothes, tighten down the lid, then just turn the crank for two minutes or so (I time it by listening to a song on the radio.)The key is to turn the crank slowly, not quickly, and let the wet laundry fall from the top of the chamber to the bottom with a good thud each time.  This drives the water and soap through the clothes and cleans them thoroughly. Once you're done, drain the chamber using the supplied pipe, then refill with cool water to the fill line and crank for two minutes again to rinse.My clothes came out really clean! Even garments with cooking stains washed right up.  The only drawbacks are that water tends to splatter around a bit when you drain the chamber, and I found that to drain it completely when I was done I needed to turn the whole chamber upside down and let it set for a bit.  I use the Wonderwash in my bathtub, so a little bit of water splashing around is not an issue.Other than that, this is a perfect little machine for doing small loads of laundry. It was a desperation buy, but I am really pleased with it!  After my main washer is fixed, I intend to keep it to use in my RV camper.  It would also be great for dorm or apartment dwellers."}
{"review":"This is a positive review: It is ok. The lid is a bit tricky. It is easy to put together and not bulky.  If it breaks I will not buy it again."}
{"review":"This is a very positive review: This is NOT an alternative for laundry machines.  I was hoping to use in my apartment but its a disappointment for that use.  I'd have given three stars but the description says \"ideal for apartment dwellers\" and its not.It fits about half of what I can get in a laundry machine, so it saves about $1 for me each load.  The design isn't great, it could be engineered much more compactly and sturdy.  The drain is slow, so add another 2 minutes for draining to total wash time.  I found it was easier to place in the bathtub and just turn upside down and let it drain from the top.  But then you're in the bathtub, leaning over doing all this, getting wet, for a good 6 minutes, for about two days of laundry (single person)...your back will not say thank you.  More trouble than its worth.  Finally, I usually hang dry my clothes anyway to save money on dryers, but having no spin cycle actually makes a difference.  Trying drying corduroys in a reasonable amount of time without wringing each clothing item...add another 3 minutes.If you wanted to bring on a camping trip it might be ok, but again, it could be designed much better.  For an RV it would probably be fine but I'd worry about breaking it on a camping trip (all plastic parts).In summary, for a \"normal\" person trying to use in their apartment, this wont work.  For someone who is super eco friendly and doesn't mind spending a ton of time doing their laundry, you'll probably enjoy this."}
{"review":"This is a very positive review: This is a great product. I live in a small apartment with no laundry hookups nor a community laundry area. I had to drag all my laundry to a relative's house and spend the entire day doing laundry. Now I can do all but the really big stuff (like jeans, heavy sweaters, sheets, blankets, jackets, large bath towels&mats) at home. It fits nicely under my kitchen sink along with the countertop spin dryer. It takes about 10 minutes total to wash, drain, rinse and drain again per load. Stains you will need to pre-treat and use a little elbow grease on prior to putting it in the washer. I can't believe I didn't purchase one sooner. I use soap nuts liquid and a little borax in the wash water and I add about 3 TBLS of white vineagar to the rinse water. The borax and vineagar help with the extremely hard water that I have in this area. My clothes come out clean and dry nice and soft."}
{"review":"This is a very positive review: I originally got this for in case the electricity goes out, which occurs from time to time due to living in an old home with outdated electrical wiring and living in Hurricane zone (South Florida). However, I tried it out on a pair of sneakers (my washing machine can't handle shoe washing) and I have to say I will be using this to wash shoes, boots and plushies that can't be washed in the washing machine. It really handles the heavy duty stuff well. Just spin the barrel slowly and it wouldn't crack. It also drains well, but make sure to wash it out the dirt in the barrel before washing anything else afterwards and give a second cycle, since shoes will have dirt residue. This is normal, since it is also an issue in electrical washing machines. Biggest difference is that this barrel won't break down or turn off. I LOVE IT! I highly recommend it and for $50 bucks it is well worth it! The only thing I have a complain over are the o-rings to hold the machine in place of its legs. The o-rings move too much. I feel like key chain rings would hold in place better but I haven't tried it out. I also feel that the barrel should have a hole at the bottom to have a removable plug to remove the water manually and to allow drainage while respinning to \"spin dry\" the items inside to make drying the items easier. Rather than twisting the extra water out by hand. Even with these two complaints, I am really happy with the purchase. It is still an easier nonelectric method than using the hands 100% for washing. This is a must for those who wash by hand or need something that will wash heavy items that the ordinary electrical washing machine can't handle."}
{"review":"This is a positive review: Wash it before you use it (smelled literally like fish). Do not over pack it. On the whole pretty good. Only used it once so far. Pretty cheap plastic but the suction cups are very strong.Okay, used it again today. Still smells like plastic\/fish (even though I washed it out before using it again). No good way to get it all dry inside after using it unless you use a towel (which would then also smell funny). It's very difficult to rinse clothes in there (always seem to have residue), so just rinse them under the tap. I'm not sure how happy I am with this purchase. I love the idea of it, but so far it's not actually that great.Update on 2\/9\/17: One of the suction cups broke off completely. Still gets the job done."}
{"review":"This is a positive review: Was excited to get this product.  After doing my first two loads, I'm honestly underwhelmed.  Got it together, no problem.  Put it on a table outside, so I could grab the gray water in a bucket and water the plants.  I put in water, soap (which I measured according to their instructions), a little baking soda because of our hard water, and a 2 lb load of light pajamas and undies.  Spun it at the right speed -- and heard flop, flop, flop, instead of splash, splash, splash.  The lump of wet clothes doesn't mix at all, it just flops from one side to the other in a clump.Ok.  Maybe that's ok.  Released the lid, swished with my hand for a minute, then put in the drain pipe.  Water spilled onto the table.  Glad it had a plastic cloth on it.  Drained into the bucket.  Refilled, added some vinegar, did the whole thing again to rinse.  Rinsed a second time.  Still bubbly water.  Stood there with the hose running into the pot while it drained at the same time, swishing with my hand.  Finally ran clear.  Took the pieces one at a time and ran them through my salad spinner to get rid of a lot of the water, then hung to dry.The clothes look clean, except for one major problem.  We have lots of animals, which means lots of fur.  Fur gets removed in the regular washer and dryer.  It does not get removed with this.I may try making \"washer rings\" out of some of plastic needlepoint canvas, and see if tossing some of those in to break up the lump of laundry will help.  Or try using dryer balls.  Otherwise, I think this will go back and I'll get one of the plunger types and a 5 gallon bucket. Or forget the whole thing and go back to the regular washer."}
{"review":"This is a very positive review: I ordered this directly from the Laundry Alternative and I'm very happy with the purchase.  My biggest reason for purchasing it is the high electric rates we pay here in NH.  I've tried washing a variety of items in the WonderWash and have come to a &#34;compromise&#34; method.  Since they are heavy when wet and are bulky anyways, I still wash jeans and towels in the regular washing machine but everything else gets washed in the WonderWash.  I'll do a few loads (enough to equal what can go in the big washer), and then instead of wringing everything by hand, I'll squeeze out some water and put the items into a trash bag lined clothes basket and then pop all the items into the regular washer just for a drain and spin cycle.  Since my big washer is a front loader, this gets out most of the extra water while only using the machine for about 10 minutes.  For me, this method works great.Update:  Since reviewing this machine, I have purchased the Mini Countertop Spin Dryer from the Laundry Alternative.  I also have written a review on that dryer giving it a high rating also.  I do now wash jeans in the WonderWash, but towels still get put in the large washing machine.  This combination is saving me $40 per month over using my big washing machine and occasional use of my large full-sized dryer.  I also plan to take this on vacation this summer since I think I'd be lost without it now.  :-)This product was a personal purchase for myself at the normal retail price. I am reviewing it solely because I want to share my experience with other potential customers. I have received no compensation for my review nor do I have any relationship with the seller or manufacturer of this product."}
{"review":"This is a very positive review: This thing does the job and keeps my laundry pile down. I have a toddler and there is never enough clean clothes before laundry day. With this, I'm easily able to ensure clean clothing for my toddler as well as the rest of the house while getting a good arm workout at the same time! I haven't tried anything big like jeans or other pants but I imagine washing that kind of material wont be as successful. Best part of all of this, you can take it anywhere. Camping this summer is going to go a lot easier."}
{"review":"This is a positive review: I bought this for my 82 mom who no longer wants to use the washing machine and decided to hand wash everythng and it was too complicated"}
{"review":"This is a very positive review: I bought this washer 2 years ago, to help alleviate our growing laundry once we had a baby.  We live in a 3rd floor apartment with one coin-operated machine in the basement, and we now have 2 kids.  We use this in combination with the Spin Dryer Portable Clothes Dryer, and it is so useful for all handwash items & any lightly soiled regular wash.It takes about 3 loads in the Wonderwash to equal one standard load, and when using with the Spin cycle it takes me about an hour from set up to clean up.  It doesn't clean things very well that have sat in the laundry basket for a long time, nor is it great for stains, unless you pretreat them and wash soon after.  The clothes definitely come out clean and as long as you don't overdo it on the soap, it really is a quick wash (as little as 1.5min for light loads!) and the rinse is only 30sec. . .it's great.  About the soap, I overdid it once & I wasted so much water having to rinse it all out that it's almost embarrassing to tell. .  .After 2 years it's still in perfect working order.  No parts show anything more than minimal wear.  The only thing is the little white ovals that were meant to cover the holes in the frame where it connects together fell out early on, but they were only for cosmetic reasons anyways, & well, I don't see that aesthetics matter much for this little guy.PROSwashes & rinses FAST!  1.5m-5m wash, 30sec - 1m rinseperfect for delicates, great for lightly soiled clothesUse less soap & water than a full size washerStands up to wear & tearCONSa little tipsy if you add clothes before the water, but you are supposed to add water & soap first so I guess that's just MY problem. (I wish all the time i could just toss the clothes in as they get dirty, then once full just add the water & soap)The suction cups on the bottom are a little annoying if you need to move it often, since you still have to hold it steady with your other hand while you spin.  I'd prefer just a grippy texture on the base, but I guess that's just personal preference.Summary - well made, nice little product for a more economical, environmentally friendly washer.  It handles almost anything, and works as well as the amount of effort you are willing to put forth.  I am still very happy with my purchase 2 years later."}
{"review":"This is a very positive review: This is a great manual washing machine. Easy to set up and use. Gets clothes very clean. However... there is no spin cycle. You have to let it drain and clothes are very wet when you remove them. If using outdoors... no problem, but if using in an apartment... use near a sink and wring your clothes as best you can."}
{"review":"This is a very positive review: This really does a great job of getting your clothes clean. At first it seemed like really a lot of work but once I figured out the right amount of detergent and fabric softener to put it in it is much easier now. It takes quite a bit less than you would think. It was taking me several rinses my first couple washes. Now I get it done with 1 rinse and clothes come out great. Besides saving water and electricity this will save you on soap and softener too."}
{"review":"This is a very positive review: I bought this for the sole purpose of soaking my white socks.  I like to wait until I get a load together to wash in the regular washing machine...so maybe 7-10 days.  I like my white socks WHITE.  Just tossing them into the laundry basket and washing never keeps them white enough for me :)  I put some hot water in this in order to dissolve some OxyClean Versatile, then just keep tossing the socks in as they get dirty...give it a spin or two with each added pair of socks, then toss them into the wash with the towels and such once I have a full load.  My socks are white, white, white!  It is a bit bulky and cumbersome and sometimes the cotter pins don't stay in place, but that could just be because I don't have them in correctly.  I don't know that I would like to use it regularly to actually do laundry that requires emptying and refilling to make rinse water, etc., but it suits my purpose well.  I am glad I purchased this."}
{"review":"This is a very positive review: I am a student who lives in an apartment without washer\/dryer and don't have a car to go to the laundromat. I just did a few loads with the Wonderwash and am satisfied with it. The assembly is easy, the size of the item is both sufficiently small to be used on a kitchen top yet big enough to wash a few days worth of laundry.Make sure you put the Wonderwash on a wet surface so that the suction pad can maintain the item while spinning. Also, do not start cracking it too fast too soon, build up the speed gradually.Personally, I put the detergent first, then fill the Wonderwash half with hot water, add the clothes and give a few spins to pre treat. After 5-10 mins, I start spinning continually for 10 mins. It is not hard to do, when the movement is started you barely feel the weight. Once again, make sure your suction pads will hold it in place. The cap does not leak and the tube provided to drain the water is very efficient.So far, the only real con is that when you are done, the clothes are so wet, you have to hang them above a tub for a few hours before they are fully drained.I'll keep this review updated."}
{"review":"This is a very positive review: I love this product! It really gets my clothes clean and I love not having to rely on electricity to wash my clothes. The suction cups aren't useful to me because I use it on a wooden picnic table outside, but it's one heck of a product!In two loads I was able to clean a pair of jeans, 3 men's xl t-shirts, a pair of workout pants, a camisole, four pillow cases, three pairs of underwear, 2 pairs of socks and a tea towel."}
{"review":"This is a very positive review: We aren't using this to be \"green\", we're using it to save money.  We have a washer and dryer, but I rarely use them.  We have a separate shower from our tub so we just keep this in the tub.  It's actually kind of fun to use it... but the draining process can be a bit slow.  When I'm in a hurry I just take off the lid and turn it over with my hand holding the clothes in.  Sometimes I use the spin cycle in our washing machine to get most of the water out of the clean garments.works really well.  Sometimes I need to wash my husbands work clothes twice.  And I'm sure that will also be the case when I start washing clothe diapers.  But for the savings and the quickness of it, it's not something I'll complain about :)"}
{"review":"This is a very positive review: This is fantastic!  It is pressurized so it pushes the water and soap through the clothes to get them really clean so it is not just tumbling clothes with water.  Uses no electricity and only 2 or 3 tablespoons of detergent. Iit can wash two pairs of jeans and a couple of shirts or a bunch of small things such as underwear and bras.  Wonderful for people who don't or can't make it to the basement and want some clean clothes, to keep on a boat an RV or to go camping with.  I wash the clothes for 2 minutes, drain the water and rinse for 1 minute.  They are fresh and very clean.  I was surprised that the spaghetti stains came out of my sweater. I am going to get one for my Mother In Law who lives alone."}
{"review":"This is a positive review: Works well. Minus two stars because no assembly instructions included. None on website. How have you been making this product for like a decade and no assembly instructions? Come on."}
{"review":"This is a positive review: I bought this so I could do hand laundry without getting may hands wet.  So...My hands got less wet.  I still had to deal with soaking wet laundry to take out of the ball and hang on the line.  I ended up using it only a few times, because I didn't really see the point of it."}
{"review":"This is a very positive review: Got this for doing laundry on our sailboat over the winter in Florida.  Worked beautifully, though only did about 5 loads so far.  Such an improvement over using public laundromats while going from place to place.  Highly recommend this product!"}
{"review":"This is a very positive review: I purchased one of these a few years ago and they work fine. The five stars are for the quality of the product. Without details, I recommend you order through Amazon. Not their website. This is because of the Amazon shipping. It is better imho. You will get it delivered to your door very quickly.Again, this is a great product for people who do not have access to washing machines. It is a little labor intensive, but it is so much better than washing by hand. You will need a laundry centrifuge to pull the water out of the clothes if you don't want to wring out your clothes by hand. This with a centrifuge makes a pretty good combo. Make sure you do not overfill, but I recommend experimenting with water levels to find the best balance for your strength."}
{"review":"This is a positive review: It’s been about a year and a half that I’ve been using this little thing. I love it! (It reminds me of R2D2.) Over that time I have learned a few things. In the beginning I filled it half full with water. Then one day I wasn’t paying attention and filled it to within about 3” of the top. I decide to leave it and see how it goes. And I’ve done that ever since. I think it dissolves the soap better and gives the clothes more room to swish around. And I have cut down on the amount of soap I use. I figure I use about one fourth of what I would use in a regular washing machine. When I was researching this before I bought it I saw a guy on YouTube who suggested turning the crank 20 times forward, 20 backward then repeat. About one turn a second. That’s what I have always done and it works. Sometimes I turn a little more or less depending on what I’m washing. Also I sometimes let things soak a while if I have pretreated stains. And I think using Oxiclean helps make up for the lack of dashing a regular washer would do.  I’m single and only wash for myself and haven’t been downstairs to the laundry room since the beginning. It handles all the usual stuff plus I’ve washed throw rugs (one at a time) and a down throw, and heavy jeans. The directions said something about how much water for how many pounds of laundry but I don’t weigh my laundry (does anybody?) so I have just learned by trial and error how much I can put in it. Everybody’s laundry is different. I probably do 8 to 10 loads a week and so far it has held up great. I keep it, use it, and drain it in the bathtub and fill it with the handheld. I use a splash of plain vinegar in the rinse water, it cuts soap buildup and softens fabrics."}
{"review":"This is a positive review: one of the most amazing products i have bought!!!! however, every time i use it I'm a bit afraid the stand will fall apart :\\"}
{"review":"This is a positive review: This washer washes my clothes better than a high quality washer in my parents house and the laundromat washers.  I LOVE IT...  I am no long spending tons of money to bring my clothes to the laundromat.  No more shlepping!  I live in an apartment on the 3rd floor.  This washer is a god send.  My only complaint is that the frame that holds it up is horrible!  I am wondering if my dad can make me a replacement built from wood ."}
{"review":"This is a very positive review: I'm disabled and quite weak and was worried it might be too hard to crank or just plain tiring. It's not. The trick is to get the amount of water and clothes correct. It took me a couple loads to figure it out. If it's hard to crank or feels heavy, you either need more water or fewer clothes. If you get it right, a,small load feels about the same as a large load.In order to get the clothes clean, make sure you hear a THUNK sort of sound as you turn it, as the vacuum created inside works. If you don't hear that, it means you need more water, fewer clothes and\/or you're turning it too fast.Also, you don't need to use hot or warm water, cold is fine. I've found that my whites clean better with hot water, just as they do in a full size washer.I use the Laundry Alternative mini countertop spin dryer with this washer and a portable mini dryer (eg Panda) if I don't want to air dry."}
{"review":"This is a very positive review: Love it.  It's a bit bigger than I was expecting but it does a great job of washing the clothes.  Takes a few times to learn how much detergent you need and water for how much clothes you put in to wash.  Overall it's a purchase worth investing in."}
{"review":"This is a negative review: The Wonderwash is flimsy, leaky, and simply not effective.  I am perplexed as to how there are so many high ratings for this device.  I ordered the Wonderwash with low expectations and have still been disappointed.  I was seeking something I could use to pre-clean \/ pre-rinse really dirty clothes from things like Tough Mudder runs before they hit (and clogged) my washing machine.  I thought Wonderwash could work – at least a little.  It does not!  Other than getting my cloths wet, it seems to do nothing but leak when I turn it."}
{"review":"This is a very positive review: I have a Wonderwash  that I keep in the kitchen. It is easy to use and only takes a few minutes to keep up with kitchen towels or lingerie.  If you need to wash out a pair of jeans or a couple of items and don't want to use the electricity or water in your larger machines, this is a fast alternative.  You can rinse in the machine but I find it easier to just use a bucket or sink after transferring the wet clothing from this machine.  Used in conjunction with a laundry spinner, it is a fast way to wash clothes.  Otherwise you will have to hand wring the clothing.  Clothes come out clean washed this way.  You still need to pre-treat any stains or add bleach to things you would normally add it to.  It takes only a tablespoon of laundry soap.  Altogether, I enjoy this product and wish I would have had one years ago to wash baby clothes."}
{"review":"This is a very positive review: Cool idea, but I can only use this in my shower due to not having a kitchen sink that has a detachable faucet, and the plastic drain tube makes this part really difficult, as it does not flex and is only a few inches long. Would love to add a cheap plastic hose to the end of the drain pipe :D"}
{"review":"This is a very positive review: I ordered this yesterday with a delivery promise of five days out, but it came this morning. That was great!Ok, I read the pros and cons of many people here and my conclusions:VERY easy to assemble and it did come with easy to follow picture directions.Read and follow directions for soap and bleach amounts, they're spot on. Remember, it is plastic, so, don't be rough with it and I think it should last a long time.The item takes more space than I thought on the counter, so, I used it outside to be sure it didn't leak. It didn't and then, I put it in the tub.  I filled as directed with water, soap and bleach and let clothes soak for a bit. (A luxury you don't have at the laundromat). I let the spinning commence - some back, some forward and let it have a good tumble for 3 mins.  All came out cleaner than the last time I had to use the laundromat. None of the greasy spots I get sometimes from machines that someone's put crayons or some such in. IF anything isn't clean enough, at least, I can put it through, again and not waste money.For my husband and myself, this will work just fine.  Hope this review helped."}
{"review":"This is a very positive review: I wasn’t sure how I would adjust to having one of these after only living in places with in unit electronica washer and dryers. But this little thing paired with a drying rack gives me a sense of satisfaction upon finishing a load of laundry. And it save a lot of time\/water."}
{"review":"This is a negative review: I brought this product to take out to our cabin to use for small washing jobs when necessary.  It was a terrible waste of money and I ended up giving it to a thrift shop after trying to use it just once.  It is very cheaply made from all plastic parts and I can't imagine it surviving very long IF you could get it to work, which I could not.  It leaked all over everywhere.[[ASIN:B002C8HR9A Wonderwash]]"}
{"review":"This is a negative review: Not gonna lie, was a pain to put together and I have not used this once since we got it over a year ago.*UPDATE* lost a piece to this. donated it to goodwill. Never used it, was too much of a hassle. took up a lot of space too."}
{"review":"This is a very positive review: We use ours for cleaning the dog towels\/clothes and any soiled garments that we just don't want to wash with out expensive front-loader. Awesome alternative and easier than having to deal with a traditional bucket."}
{"review":"This is a very positive review: I really love the concept of this machine and had hoped it would be a simple fix for mini loads when I don't have a full load to wash.  I've only used this one day so far and have done the following 3 loads:  a load of about 6 of those white, cotton kitchen towels (I think they call them flour sack towels.), a load of 2 &#34;camp&#34; towels.  Mine are full size bath towels, but they are more like a chamy than a towel, so they soak up a lot of water. and the final load was a pair of leggings with an extra large tshirt and some underpants.  All the loads are WAY smaller than would fit in this tub.  I haven't had a chance to determine the maximum amount you would want to wash in this tub.  SO HERE IS THE BAD:  The bummer for me is that as soon as I start filling the basin with water, water starts dripping out of the bottom drain valve, even though I do not have the drain tube inserted.  Inside this valve there is a little &#34;X&#34; shaped thingy that pushes in as you insert the drain tube.  Pushing it in supposedly releases the seal and allows water to flow freely into the drain tube.  That part of the system does work as it should.  Unfortunately some water leaks out of that area even when the drain tube is not inserted.  This wouldn't be an issue if the drain valve was always in a downward position because I would just put a towel under the whole thing and call it good.  The towel would catch the water that leaks out.  The problem is when you spin the handle causing the tub to rotate round and round, water flies all over the room originating from the drain valve.  So far I have not found a way to avoid this.  I've double and triple and quadruple checked to make sure the plug is pushed down tight at the bottom of the inside of the barrel.  I've pushed and prodded the &#34;X&#34; shape mechanism hoping maybe it was just a fluke and didn't seal tight from the factory.  No luck.  I've got a phone message and an email into the company hoping they can offer me some words of wisdom.  I'll let you know how that turns out, if it turns out that I can fix the issue.  The number listed online at laundry-alternative.com is 888-813-9559 if you live in the U.S.  They are located in Los Angeles, CA and office hours are 9am - 5pm Pacific Time.  There is a spot at the bottom under &#34;contact us&#34; where you can get their phone number and\/or send them an email.  If anyone has found a resolution for my problem, please reply to this review.  Otherwise, I will be forced to use this outdoors only as it is too hard to fit this into the bath tub, lean over, and try to turn the crank handle in the cramped space all while getting drenched. Thank you very much.  Aside from this one issue I LOVE this product."}
{"review":"This is a positive review: The plug at the drain came apart into three parts and I couldn't put it together again. I asked WW for helpm like a blowup diagram  of the parts. Ignored. So I used a cork wrapped in electrician's tape and it seems to work, though may soon pop out.  Plastic frame is flimsy so needs to be handled carefully."}
{"review":"This is a negative review: The whole thing is made of plastic. After 3 months, the lid cracked in transport, the handle came off and got lost, and the legs were cracking. I siliconed the inside of the drum at the middle seam to avoid leaks but since the lid cracked, I couldn't use this any more and made the spinner useless after just taking the laundry to the laundromat. I wish because of the weird shape, that the machine was made of stainless or something more durable."}
{"review":"This is a positive review: I just used this thing for the  first time!.  I washed 24 under pants 6 pair, then 18 pair. 2 t shirts and a pair of shorts together in 20 minutes. The soap absolutely get completely into the clothing. I use far less soap then when i hand washed in the sink. AWESOME!NOW...If it only folded the clothes!"}
{"review":"This is a positive review: Only complaints I have (reason for 4 stars) is that the bottom leaks when you plug in the nozzle or take it out, although I understand that's just how it is, and I wish it came with a hose you can plug into the faucet. It's pretty tiring to pour water into this thing one cup at a time (I live in a hotel, no bath faucet and the sink bowl is very shallow)."}
{"review":"This is a very positive review: I had an opportunity to use this machine for 3 weeks during a camping trip in which we used it hard and frequent.  It worked excellent and I had no issues.  But I would like to augment my review by responding to the review below me...specifically the cons in which I had a totally different experience.Cons:* The machine is basically made of plastic. The manufacture says that it's made of the highest, most durable plastic, but at times the brackets do seem a bit wobbly. The washer itself seems sturdy. The base is questionable. Some of the small screw caps did not stay in place, but they are not essential to the unit staying together or washing properly.It is completely sturdy and mine did not wobble at all.  Perhaps the reviewer did not set it up correctly as the machine needs to be put together properly.  They say plastic as if that is a bad thing, but this makes it lightweight and many things are made of plastic and sturdy...take a look at your car next time you're in it.* Can be messy: Washing clothes in this unit is not the tidiest of processes. I initially tried it in my kitchen, but I spilled more water than I used, so I eventually move the unit to my bathtub and found that it fits perfectly and I don't have a problem with water being everywhere.It can be, but ours was not.  This point is the fault of the reviewer and NOT the machine at all. Make sure you put the drain tube on correctly and into a sink and put the cap on tight and no issues.* No assembly instructions: The unit does not come with a lot of instructions on how to put it together, but it's not that difficult to figure out. You are really only assembling the base not the tub. You really can look at the pieces laid out and see how it all fits together. It took me less than 10 minutes to unbox and assemble.Now this one is ridiculous to me.  I have heard others say this.  I have put together Barbie stuff for my neice harder than this.  There are about 5 parts in total, I could have done it without ANY instructions at all.  I seriously have to laugh...if you can screw in a lightbulb you can do this.  Of course, we now need warnings on hot cups of coffee so one does not burn themselves... seriously...c'mon.* Where the suction?: The unit does have suction cups for stability, but I have to say they stick the best when you don't need them to. When the water splashes, the suction cups tend to not stay in place. However, I've found when using the unit in the bathtub, this wasn't an issue. The unit did still slide around a bit but not enough to disrupt the washing process.This one makes sense.  It does sometimes stick when you need to move it but you just pull up on the suction cup edges and wala!  But I get his meaning here...it is true.* Bait and Switch: When I received my Wonder Wash I was surprised to find they sent me a Sputnik 3 that looks exactly like a Wonder Wash, but was renamed. I hadn't seen anything on their site claiming they renamed the units, so I was a little suspicious. However, the unit seems to do what the Wonder Wash claims to do, so I kept the unit. I can, however, see how other reviewers see this as a bait and switch and question the quality of the Sputnik 3 compared to the Wonder Wash. I can only speak for my unit and say that so far I haven't had any problems. I do think the manufacturer should really clear this up or stop sending out the Sputnik 3s as Wonder Wash.I have heard this before as well and it did not happen to me.  I cannot comment therefore...but mine was the Wonderwash.  Make SURE you ask the seller first to send you the Wonderwash or do not buy it.* Hard to Crank: When I first started using the unit, it was at times hard to crank. But, through trial and error, I found that the amount of water you use for the size of the load is every important. The instructions say that the smaller the load less water is needed, but I didn't necessarily find that to be the case all the time. I eventually found that over time you will be able to determine what the right clothes to water ratio is to make it crank smoothly. The right amount of water in the unit can make the cranking action effortless.Not really.  I agree if you are 5 years old but it is NOT hard to crank.* The Tricky Lid: The lid for the machine can be a little tricky. It's almost like working with a child-proof cap to get the right fit. The trick is to unscrew the lid all the way until you almost take the screw out. Place the lid on the unit and lock the lid in the groves around the unit. Hold the lid in place around the groves and then tighten screw back all the way down. By doing this, you get the tightest fit and therefore the most pressure and fewer leaks. When you loosen the lid after a wash, you should hear a hissing sound of the air releasing, then you know you had a good tight fit.I am shaking my head.  This should not be a con at all.  It is not really like a child proof lid but you have to turn it and then screw it.  But this is also childsplay and very simple.  But I agree, if you are a 5 year old and you want to do this get someone to help you first.* No Spin Cycle: Since this is not your typical washing machine with a spin cycle you will need to either ring your clothes dry by hand or do like I did and buy an Spin Dryer Centrifugal Clothes Portable Spin Dryer. As stated before I'm lazy when it comes to laundry, so wring out the clothes after washing would have been deal breaker in buying a Wonder Wash. The Spin Dryer completes the Wonder Wash.Lazy is correct.  Did you see Kenmore or GE written on the side of the unit?  How about in any of their ads?  Where was it written that this thing ever had a spin cycle?  Nowhere...So why out this in the cons?  That's like buying a a minivan and then scoring it lower because it is not able to do 0-60 in 3 seconds.  It was never promoted not sold to have a spin cycle so I am not sure why anyone has it on their list.  Yes, wring out the clothes...it takes a few minutes but so what.  Do not buy a manual machine if you are lazy.  But I suppose lazy and cheap are a bad combination.This is a great machine and we were happy with it.  I expected to not like it considering some reviews and especially the one I quoted here...I am sooo happy I never listed.  it saved us money whiloe camping and was extremely convenient if we were staying at a campsite for at least 2 days."}
{"review":"This is a very positive review: I love, love, love the wonderwash!!!I June 2013 - I was always dreading about going to the laundry mat, staring at the pile of clothes slowly growing and looked online for something to help me and here it is! They also had great customer services. July 2015 - my drain spout broke, I had sent an email and they shipped me a new one right away. I have to say I am one happy customer, still using it now Sept. 2015 and will still be using it in the future."}
{"review":"This is a positive review: Very shaky construction. Leaks all over though the top. Peaces of plastic coming off. I would glad to return it but its over 2 months past..."}
{"review":"This is a negative review: I had to cancel the order as it is not BOTH the washer and drier as shown in the picture that was up at time of purchase and as it was also described as both items. READ the other low start reviews to see more complaints of similar issues."}
{"review":"This is a negative review: product ok. works kinda (clothes could be cleaner) until trapped in washer.  I was unable to open sealed lid for 3 days with my clothes trapped inside!  this possibility should be mentioned  in the product details!!!. here is comments and how to fix per  wonderwash company:\"What happened to your washer is a phenomenon related to the atmospheric pressure. It usually happens if you let the water cool down in the washer or if the atmospheric pressure changes or if you drain the washer without removing the lid first.Let's open you washer in less than 5 seconds1) spin the tub to leave the drain upright (the tub will be upside down.2) insert your finger in the drain spout to push the valve to the open position. You will hear a noise similar to a soda bottle opening, when you break the vacuum.3) spin the tub to the upright position and try to remove the lid.Please note, the longer it remains with vacuum, the tighter the rubber gasket will be. You may need to force a little bit. This may happen now, past hours that the vacuum has been formed. It doesn't happen during normal operation.\"this does work  (but flooded my floor) initially left lid in locked position but it did not release so I put in open position, it unlocked and  water gushed out..  I'm unhappy with this product because  the drain pipe wont attach so washer has to be tilted to empty. I cant \"soak\" clothes in hot water before washing (im 73 & 2 min is approx. 80 turns so soaking helps to clean clothes. of course if I had known removing lid was a common  problem I would not have purchased.. now afraid to use it at all... seller (bob4you, suggested I \"forced\" it open but wasn't willing to do since I paid $84 total and don't believe he would have refunded my money for a broken return. great idea just wish it worked better.  thanksforgot to say both owner and seller did respond within hours of my frantic call & emails...(they asked for model??) but there is no model #"}
{"review":"This is a positive review: It's not a Wash Ing machine by  I do one pj set at a time depending on thefabric comes out so clean. Note push in the water release tube in and turn a bit and it releases on its own. Yes it drips little at the release valve"}
{"review":"This is a positive review: This little machine gets your clothes clean without electricity. It uses less water and gives you a little work out. What more can you ask?"}
{"review":"This is a very positive review: Wowza i was spectulatice but this thingy is great i wash my under grarments in it and my hubbys and my work clothes.  Saves cash bc we dont have a washer and dryer."}
{"review":"This is a very positive review: Use it mainly in the summer time, because I air dry the clothes after. Good capacity, easy to use. My 8 year old can also do his own little loads. Wished the sucction cups worked better, but it is still a good buy."}
{"review":"This is a negative review: You'd expect that for something you paid 50 dollars for, that it would have all the parts.It has SIX spaces into which the frames interlock. These SIX spaces have holes that are supposed to be then blanked out with SIX plastic bits.I ONLY HAVE FIVE.So pay your fifty dollars and you still might end up dissatisfied with unboxing.Made in China."}
{"review":"This is a very positive review: This product came with no instructions whatsoever.  Though simple enough to figure out how to assemble, there are issues with it. It may be good on a camping trip and for travel but there is nothing to help wring out or press out the clothes.  I wish it had a &#34;plate&#34; of some sort that would allow you to squeeze it down and press the water out of the drum.  As it stands, the pipe lets the water drain out but you are still bringing out sopping wet clothing that you have to wring out by hand.  It would be different if you could spin the water out but you can't spin it with the drain pipe in it.  It could maybe be helped with a shorter &#34;spin cycle&#34; pipe so that you could indeed hand spin it."}
{"review":"This is a very positive review: I bought this instead of an electric portable washer because it is significantly cheaper. I have a lot of cloth diapers to wash and wasting quarters in my apartment's laundry room was not feasible. I've used it several times since it arrived and aside from no spin cycle, it works well. Sometimes I accidentally put in too much detergent, but that's always fixable with extra rinses. The only difficult part is when I'm finished washing\/rinsing, I have to drain the washer and wring out the diapers and covers by hand. The diapers come out clean, no stains, gunk, smell...Just a clean diaper. I usually dry the diapers on the shower curtain rod with hangers. So, I've saved money all around with this purchase and decision.Update (12\/28\/12):My son (1 year old) got a hold of the drain tube and decided that it makes a spectacular sound when he smacks it real hard on our coffee table. The cap on the tube that screws into the washer broke off (making it useless) so I took \"industrial strength\" glue that I had purchased from a craft store and glued it back, it works well now. The one thing that I did not do, before gluing, was make sure that the pegs were aligned properly so that the bend at the other end faced down after attaching it to the washer. It now points a little to the side, which is fine, it still drains.I recommend using kitchen cleaning gloves while washing. If you use HOT water, the gloves will save you from calluses and insulate your hands, wrists and arms slightly from the heat. Actually, they'll save your skin no matter the temperature of the water is, especially when you're wringing out the clothes or diapers. My palms are rough now, even after incorporating the gloves a few weeks ago, because I didn't think about this until recently.For you cloth diapering parents: It is near impossible to rinse detergent or bleach out of microfiber when you're handwashing or with the Wonder Wash. My son's diapers have microfiber inserts and I have to take a few dollars to put them through a detergent-less\/bleach-less wash, twice, to make sure they're completely rinsed."}
{"review":"This is a very positive review: This gadget gets the job done, not as well as a full-sized regular washer, but pretty close. There are some tricks that make it easier to use and more effective. I live in a small apartment where regular washing machines are not allowed, so this little washer really helps.I purchased this open-box, which was cheaper and worked out fine. The washer came complete and undamaged.Assembly was easy. Some reviewers have missed that the small \"oval\" plastic pieces *must* go into the spaces on the legs. They help hold the assembly tabs in place and keep the legs from unlocking and falling apart. The washer is much stronger and more sturdy with these pieces in place.The washer works fine with cold water. The lid still seals tight, mostly due to it being a little wet. You need to unlatch the lid and break the seal when done with the wash or rinse cycle. The washer still \"whooshes\" water through the clothes, even when the water is cold.Load size can vary with good results regardless of size. The washer does a fine job when half-full or 3\/4-full of work shirts, with the water filled to where the washer's \"tub\" starts to curve inwards towards the lid. I've run white socks loaded almost to the top and with the water 7\/8 full, and they came out clean.For me, a typical load would be a pair of work slacks and 3 or 4 work shirts in cold water and just a splash of soap. Or 40 to 50 white cotton socks with hot water, extra soap, and bleach. Two bath sheets will make a load.I've had good luck with Oxydol (in the blue bottle, which is less concentrated). It has a nice scent, gets the clothes clean, and allows more leeway when adding it than more concentrated cleaners. It's very easy to add too much detergent when working with triple concentrates, so lower concentration helps prevent this.There are a few tricks to rinsing after the wash cycle. Attach the drain tube before removing the lid. The tube stabilizes the washer which makes the next steps easier.  Water will start to drain out, then stop because the lid is sealed. Unlatch and remove the lid, then let the washer drain. Now start filling the washer with clean water *without removing the drain tube*. Continue until the drain water appears to be soap free, 10 or 20 seconds. The clean water will help pre-rinse the clothes and you can use it to rinse down the insides of the washer too. This makes a huge difference in how well soap-free your clothes are. Remove the drain tube and finish filling the washer with water, then continue the rinse cycle like normal.Patience while draining the rinse cycle is rewarded with clothes that are noticeably less wet. After the rinse cycle, attach the drain tube, remove the lid, and let the washer drain for *several minutes*. Just go do something else during that time, and the clothes will be much closer to dry than if you try to remove them right after the washer drains.You can also press down *gently* on the clothes to \"wring\" out some additional water while they're still in the washer (but be gentle, you could break the washer if you press down too hard).Note that the drain hole is to the crank side of the washer, and a little water will pool in the bottom of the washer, so tilt the washer crank-ward to get out that last bit.I've found it's easier overall to do loads sorted not just by color but by type. White socks can be gathered into bunches of 4 or 5 after rinsing, then folded over and twist-wrung until damp. Doing a load of socks together makes the wringing go much faster, and 4 or 5 in a bunch is just about the right size for wringing really well.For drying, adding a second shower-curtain rod high up and in the middle of the shower is really helpful. You can hang clothes that are still wet from the high rod and they'll drip directly into the shower. Close the shower curtain to keep the drips from splashing out. After a few hours, the clothes will stop dripping and can be moved elsewhere to finish drying.Overall, I end up using this little washer about 2 or 3 loads a week. I'll still go to the laundromat for big loads like comforters, but it does the job for everything else. It works well to do one load early in the morning. It doesn't take much time, maybe 20 minutes total, and it's quiet enough to not disturb the neighbors."}
{"review":"This is a positive review: I love THE LAUNDRY ALTERNATIVE WONDERWASH. I am disabled and live in a not so great neighborhood a mile or so from the laundrymat and it becomes a pain to have to load up laundry,find quarters, shlep everything in and out of the laundry mat and come home with not- so- clean laundry. I put this little beauty in my tub, put in a few pieces of clothing or 2-3 bath towels along with a tablespoon of laundry detergent and within minutes I have clean laundry! I use this in conjunction with the BREATHING MOBILE WASHER ,  and it works great! This is my routine1. Add laundry to the WONDERWASH  with laundry detergent and wash for 3 minutes.2. Remove laundry and place in a five gallon bucket and rinse and agitate with the BREATHING MOBILE WASHER 1-2 minutes3. Place back in the WONDERWASH with fabric softener and again agitate for 2-3 minutes4. Drain, wring and hang dry5. 6-8 minutes CLEAN LAUNDRY!!!I plan on buying a spin dryer in the future to make my routine easier as it is hard on this old ladies hands to wring laundry but hey at the rate I'm saving $$ I'll be able to do so very soon!!"}
{"review":"This is a very positive review: I live full time in an rv, and was looking for something to do laundry while boondocking that didn't require power and running water.  This fills the bill.  I am a big girl, and I can do several pairs of undies, a couple tshirts and a pair of pants in here no problem.  Probably could fit in more but in think it works better if clothes can move around a bit.  Takes a gallon to wash that amount,  and another 2 gallons to rinse.  Its quicker than doing it by hand in a basin.  Clothes are possibly not as clean as they would be after agitating in a conventional washer, but it works for my purpose.  It seems sturdy enough and was easy to put together"}
{"review":"This is a very positive review: I was living in a basement unit without a washer\/dryer and I didn't have a car.  That would mean walking about a half mile to the laundromat with my clothes, which was NOT appealing to me.  I bought this thing, and it made my time in that apartment so much more enjoyable!  Granted, I had to wash my clothes about every other day, but I was just fine with that.  I didn't have an outdoor area to hang my wet clothes, so my process would be to wash my clothes in this, then hang on a drying rack in the shower with a fan or heater blowing on the clothes.  I probably went to the laundromat every 3-4 weeks to wash towels and sheets, but other than that, this thing did my laundry for a year and a half."}
{"review":"This is a very positive review: As others have noted you have to use it properly to work (turn slowly not quickly) and add the correct amount of water. But when it's ran correctly it works as well or better has a washing machine."}
{"review":"This is a very positive review: While it's not perfect, it doesn't claim to be either. Heavily soiled or stained items will still need to be washed in a machine. Clothes that dry after being washed with the Wonderwash could stand a fluff cycle in a dryer if you have one available so they aren't so stiff. They do come out cleaner though, and for small bits of laundry, like underwear, socks or polos, it works just fine and they do not take too long to dry.I did not find any of the materials to be cheaply made whatsoever. Additionally, there are no assembly instructions and I found none to be necessary. Simply by looking at the parts, it is easy to see how they all fit together. I assembled the whole thing in about 5 minutes or less.A tip that I've found, which I think a few others have posted as well, would be to let the clothes soak for a bit after you spin them around and before you rinse. The instructions say just to spin for a few minutes and you're done, but I had much more success getting out simple messes like pen marks when the clothes are soaked for 15-30 mins."}
{"review":"This is a positive review: First impressions of the Wonderwash.. It didn't take long to set up, the instruction papers that came with it were fairly helpful. The first load I attempted with it was three polo shirts I use when ever I'm not working. Added them in, plus 3 quarts of water, and about 1\/8th a cup of detergent. I noticed almost immediately that the suction feet on the bottom of the device seemed to have been bent in such a way that they didn't properly stick, but it could have just been the surface I'd decided to use the Wonderwash on (A bathtub).It takes a bit of effort to get into a good spin, but it's effortless while it still has momentum. I'd also noticed that as I was using it, some of the pins would pop out, which I can imagine for a larger load would spell trouble. After the initial wash cycle, I'd attempted to drain it, which didn't take long at all. Proceeded to fill again and go for a rinse, but I believe I'd not drained it properly, as it was much more difficult to use the second time around.When I'd finished, I'd drained it again (And made sure it was actually drained, this time). I attempted a \"Spin\" cycle, but I don't believe the product is meant for such a thing, as at the end of it the three polos were soaking wet. I wrung them out, and as of this review, I have them hanging out to dry.In my opinion, the Wonderwash isn't something that will replace going to the laundromat, or using a normal electric washer, but to prepare a small load for later, it seems to be just fine. If you have an electric dryer, this is absolutely fine in a pinch, but otherwise I'd suggest it as prep if you dry using a clothesline.Overall, I'd say if you don't mind the price, definitely give it a shot. It seems pretty sturdy, minus what I can only assume was my own user error."}
{"review":"This is a positive review: This thing was not what it was made to look like. It was hard to put together and then it was hard to use and really didnt wash clothes like it was supposed to. Wished I would have gotten another one to try, might have been better then this one."}
{"review":"This is a very positive review: Love this thing!! I only use it for small loads of underwear and undergarments, maybe a workout outfit here and there, and t-shirts when I just don't feel like driving to the laundromat (but I still do to do my big things like bedsheets, towels, etc). One cycle for wash (= 1 min of cranking); and 2 cycles for rinse (= 1 min each), so for 3 mins of my time, I have what I need for the next day. I wring everything out well, perch them on one of my foldable drying racks and I'm good to go!!"}
{"review":"This is a very positive review: Gave as a gift to my retiree, camper living, parents. They love it. Really helped when they were off the grid in Baja. Said it's an arm workout but it works great."}
{"review":"This is a positive review: I really like this machine. If you cannot pour wayer from the sprayer and have to use a bucket, it can get messy. Also found if you pour water you have to watch for tipping. Otherwise it works."}
{"review":"This is a positive review: i wasn't exactly looking for it in pink. photo misleading. better get the drain pipe inserted on your first try, or water comes out. i MUCH prefer using twice the water they recommend."}
{"review":"This is a very positive review: If you have assigned laundry duties to one of your children, and that child doesn't like to wash your &#34;delicates&#34;, then this portable washing machine is your savior.  I personally don't see what the problem is with loading undies into the washing machine, but DD (age 17) is a little OCD and she can't bring herself to wash other people's panties.  No problem with this mini washer, because in only a few minutes I can have a small pile of them taken care of and ready to hang dry!  Actually, they are probably cleaner and fresher with the WonderWash, because I can give them an extra rinse to be sure there is no soap remaining.  Well worth the $."}
{"review":"This is a very positive review: I live in an apartment and have a laundry facility on site ($1.25\/wash and $1.25\/dry) and I have a relatives house down the street with a good washer and dryer.  I got this because it was a very good price and I wanted to have a way to wash; towels, bedding (sheets and pillow cases), blankets, or a small load of clothes; easily, inexpensively, and conveniently.  I have used this many times to wash towels after my dog comes in wet\/muddy, a quick clean of sheets (again because my dog sleeps on them and they sometimes need freshening up before my &#34;regular&#34; cleaning day, or if I need to wash my gym clothes outside of my regular wash.  This has been great and very easy to use and gets clothes smelling clean and feeling clean."}
{"review":"This is a positive review: My wife likes to use this washer for her delicates . It works very good rotating all the way around or just swinging handle back and forth . The drain tube needs improvement but works okay when you get the hang of it ."}
{"review":"This is a very positive review: First off, It is bigger than I expected. It works wonderfully. I am pleased with the overall performance of the product. I do like to let my clothes soak in the washer for a bit before putting it through it's paces and adding baking soda to the wash has always been my style. It was suprisingly easy to turn the crank even for an old lady like myself. As long as you don't overload (and it does hold a good bit) it does a very good job of getting the clothes clean. I do have to say that it is well made and nice to look at. It stores easily between usings. I did have to take the suction cups off the bottom (It works quite well on my bath mat without them) because they hold so well that I had too hard of a time getting it out of my bathtub. Of course I am old and my strength is not what it used to be, so as not to frustrate me I took them off. I think it is a wonderful product and would not hesitate in buying another should the need arrive. It would also make a good gift for someone."}
{"review":"This is a positive review: This is a really great product for someone in a dorm or with a small child. It wasn't up to my standards as I do big loads."}
{"review":"This is a very positive review: I bought this mainly for my silk things and caftans.  It was very simple to put together and use.  It arrived today and I’ve already done two loads.  They came out perfect.  I followed the directions but only used one teaspoon of my home-made detergent per load.  I rinsed in another small tub then poured the rinse water and spun them in my regular washing machine.  I also purchased this as a backup if my washing machine should break.  The only items that I couldn’t use my hand crank washer is king size sheets and bedspreads.  Some have said hand washing is just as easy.  I disagree.  The turning action in this nonelectric device is far superior.  It forces the water through the garments without snagging your fingernails on the cloth while pushing the clothes around in the water.  It’s far more efficient.  Additionally, it’s a closed container for soaking the laundry.  You don’t have to overdue the cranking.  The directions recommend soaking for a bit after initial cranking then give it several more cranks."}
{"review":"This is a very positive review: CUT MY ELECTRIC BILL IN HALF!!!!! LOVE IT !! No more having to deal with these crap apts washer constantly breaking on me and the weeks it takes to get them to service it! It does about 5 pairs of my jeans size 0 womens or 4 of his 32\/30 mens with two shirts: very compact although somewhat odd to place around your sink :) its not very flimsy but if you arent careful you could defntly snap it on accident (its pretty sturdy for 50$) Best buy in a while"}
{"review":"This is a very positive review: Here's my take as a single mom. The thing is great for saving money but if you aren't planning on buying the Nina soft spin dryer then I would advise not to do any kind of at-home washing because you'll end up messing up your hands with all the wringing you have to do. I bought this with the Nina soft and together they are great. My advice is you put it in the bathtub and have a bucket handy. This is probably the only way you can do it without creating a mess on a countertop. You do have to lean over the tub to crank but if you put a matt down you should be fine. I do no more than 4 loads a day because after that I'm tired. Not that you get sweaty or anything but there's only so much cranking I want to do in a day.Mine does not leak, I don't think, but even if it did I don't mind because it easily drains in the tub. As you fill your bucket, place the detergent in the wonderwash. I also add vinegar to my washes since, without a real heat dryer, I'm not sure how much germs are actually left. The vinegar probably takes care of some of that.I set a timer for two minutes while I crank so I never do it for longer than that. If I know there's a stain on clothes, I just let the clothes soak for maybe an hour in the wonderwash before cranking. This helps a lot. Hope this helps."}
{"review":"This is a very positive review: I read they used to have a screw on lid  that did not leak, this new version does leak to varying degrees. A towel under the washer seems enough to avoid water on the counter, we will see if that changes with use.  Another brand still sells the  screw on lid, sold at W*****t  here as well  https:\/\/www.amazon.com\/EasyGoProducts-EGP-LAU-012-Clothes-Washer-Mobile-Powered-Portable\/dp\/B074TX7MF2\/ref=sr_1_50?crid=2I30BAOOM4K1D&dchild=1&keywords=portable+washing+machine&qid=1613539013&refinements=p_amazon_business_seller%3A15156999011%2Cp_72%3A2661618011&rnid=2661617011&sprefix=port%2Cmobile-apps%2C334&sr=8-50.The base is ok but clearly needs gentle care, prone to wobble.  The holes that secure the rubber feet already split on both back feet.Excellent for some crafts,  sweaters that you would not  want in an agitator washer.  Useful to pre soak then  let it gravity drain rather then  wring.The larger spin dryers are a great combo with this. This same company makes one as does Panda, both similarly priced.  https:\/\/www.amazon.com\/Panda-Portable-Dryer-22lbs-Stainless\/dp\/B01IRMBG7I\/ref=pd_sim_b2b_6?pd_rd_w=ff6H3&pf_rd_p=a07701e4-f565-442a-b97f-93ab23cbb7ef&pf_rd_r=F3Q9WEAZ2DMM6Z11HV25&pd_rd_r=f7129a4f-b652-4a76-847e-42c22171822e&pd_rd_wg=6dLmv&pd_rd_i=B01IRMBG7I&psc=1Holds  five pounds. In most cases it holds one outfit ( chinos and top with socks), holds 2 sets of  flannel pajamas,  holds my  Columbia fleece jacket with gloves and scarf,  and  holds many  cotton masks  and gloves used daily during this virus pandemic, so I can  let them soak in bleachy  sudsy water, drain, then wash.There are electric small one tub washers  https:\/\/www.amazon.com\/SUPER-DEAL-Capacity-Washing-Machine\/dp\/B07MCTYSXN\/ref=pd_bp_sim_b2b_2?pd_rd_w=23XGq&pf_rd_p=bdb5d774-733c-4f04-8009-80f934b6d9ff&pf_rd_r=GB35KS8SYP4M4A57EYRD&pd_rd_r=35cf9fa7-3706-4a59-b5e1-fa72abce5830&pd_rd_wg=uhcwB&pd_rd_i=B07MCTYSXN&psc=1"}
{"review":"This is a negative review: I wash everything 3 times. Plus in between rinses. I actually expect that seeing as how dirty my kids get their clothes. I only have to do one wash cycle with my clothes.Super impressed.Tip for negative reviews: if the water isn't clear then they aren't clean yet so do another cycle."}
{"review":"This is a very positive review: The answer is, yes! When shopping Amazon for an inexpensive washer to eliminate my trips to the laundromat, I found two that appealled to me. One was a motor driven machine and the other was the Wonderwash. I was attracted to the motor driven machine but after watching and comparing YouTube videos of the two machines, I didn't like the idea of needing to turn the machine upside down to empty it. Another thing was that the videos usually showed the machines being used in a bathtub. I'm 78 years old and have arthritis so a countertop machine that didn't make a mess was a number one priority. Wonderwash filled that criteria. The next questions were will the wash look clean, smell clean, and feel clean. My first use answered that question...Yes! Then I wondered if the suction cups would really hold the machine in place on the counter? They did! Careful measurements of the space available under the kitchen cabinets and adjacent to the sink indicated that I had just under 18\". The machine is 18\" tall. If I placed the machine at the rounded edge of the countertop, all would be well. As soon as the machine was delivered, I was anxious to try it. Where is the instruction manual? There wasn't one. This machine is so easy to assemble that one isn't needed (I seldon read them anyway). It went together quickly. I placed it on the countertop. My measurements were right on the mark! I was in business! One important thing was, will the machine wash a pair of heavy denim jeans and remove the stains. I took a pair, sprayed some dollar store stain remover on the spots and put them in the Wonderwash. A few minutes of cranking and drained the soapy water, filled with rinse water and cranked away. My next concerm was, did the rinse remove the detergent? I'd soon find out when I took the jeans out and put them in the sink to wring the excess water. No sign of detergent! This little machine's name is certainly appropriate! The stains were gone, the jeans looked clean. They smelled like clean laundry should and they felt clean! Now comes the important part: I live in a condo and have my own washer and dryer. The washer failed some time ago and I had been using a nearby laundromat for my wash. I live alone so my wash isn't like washing for a family. I was seeking a solution to the visits to the laundromat. Wonderwash was it! The problem was wringing the items. My solution was that I have a gas dryer that still functions so I didn't need to wring all the water. If I didn't have the dryer, I would certainly look into one of the machines that spins the excess water to supplement the Wonderwash. Otherwise, I suppose I'd need to hang the wet laundry somewhere while it dried. In three nights, I was able to do all my laundry and didn't need to leave my condo! Well worth the price! What I learned was: don't put a lot in the machine. With a 'full load' of clothing and the required amount of water, cranking can become an effort. I prefer a smaller load. One heavy pair of jeans, or one big bath towel, or one double bedsheet would be my limit. What did surprise me was that with so little effort, my wash is as clean as it would have been in a commercial machine. It smells much fresher, and it is really soft feeling. I'm really pleased with Wonderwash. If you are comparing various machines, I suggest that you watch some of the YouTube videos showing them in use. One last comment, when I was screwing the top for the first time, it was a bit difficult so I used a rubberized glove to make things a bit easier. The top must be screwed completely, otherwise water will leak."}
{"review":"This is a positive review: This is a great little washer. But, I have to say that I have a shoulder issue that I was unaware of until I started spinning the machine. So this particular model did not work for me."}
{"review":"This is a very positive review: I LOVE this little washer!!  It's so much easier than taking everything to the laundromat and more fun to use than hand washing.  (I have alot of lightweight clothes that would be destroyed at a laundromat, this washer keeps them looking new!!)  I was really surprised at how clean it has gotten everything.  I use the Laundry Alternative Spin Dryer after washing, and then hang-dry.  The money saved from not having to go to the laundromat, or to replace damaged clothes will pay for this machine (for me), in a month!!"}
{"review":"This is a very positive review: This is way Bigger than I expected and it's super easy to use.I use this for my delicate\/non washing machine friendly clothed and it works perfectly."}
{"review":"This is a negative review: I purchased this thinking it would save me with laundry costs, since it's just me in the house.It leaks.  Therefore, I use it in my tub and smash the crap out of my hand.It was on sale at the time and I was just trying it out.  If you had VERY lightly soiled clothing and were camping this would be better than nothing, but I wouldn't recommend it.  Save your money."}
{"review":"This is a neutral review: This lacked assembly instructions...had I have had that I could have put it together in 15 min versus the hour I spent. I will try washing something tomorrow."}
{"review":"This is a very positive review: First of all, I would probably have given it 5 stars if pieces didn't keep falling off, but the thing does seem a little cheaply made. However, the pieces that do fall off don't affect the actual functionality of the product. The other downfall is the suction cups on the bottom are often very difficult to get to adhere to a surface, but again, that doesn't really impact it's functioning properly. I needed something to supplement my trips to the laundromat, and it has worked well for that purpose. I have also found it's a better way of doing my hand washables versus the sink. It works best in a stand up shower so that you can drain and rinse in the same spot. Trying to carry the tub when it's full is heavy and awkward. I tried it in the bathroom with the bath tub, but your back will hate you by the time your done, so I don't recommend using it where there is a ledge that you will have to bend over to use it. Also, go light on the soap or you will be rinsing forever to get it all out. All in all though, it's a nifty contraption that supplements nicely, and your bicep will get a nice little workout! It has saved me when my son tells me the night before that he needs something cleaned-and it's simple enough that I can make him clean it!"}
{"review":"This is a very positive review: This washer keeps a good seal, is robust, and isn't too heavy.  But I'm returning it because it doesn't wash clothes very well, and isn't very efficient.  I would MUCH rather hand wash the old fashioned way to save water and detergent, as well as get a vastly superior clean."}
{"review":"This is a very positive review: We've had this WonderWash for two years now. I can fit up to 3-4 pairs of work pants in it, or 5 or more short-sleeve shirts. It fits perfectly in my tub so there is no mess. It takes 2 minutes of hand-tumbling to wash, five minutes to drain, and 1 minute to tumble with rinse water and fabric softener. I remove the clothes right away and throw them in my Nina Spin Dryer and that gets a great deal of moisture out. This appliance is not good, however, for bath towels and definitely not blankets or more than 2 pairs of jeans at a time. Also doesn't seem to get out deodorant marks on dark clothing, but I save that for electric washers or hand washing anyway."}
{"review":"This is a very positive review: This is an effective method of washing ones clothes if one has no alternative. However, I found another alternative that worked better for me for a bit more money. However, there is no denying that this product is a real money and energy saver. It does an excellent job with all sorts of laundry. So, if your budget is limited, this might be your solution. It does actually work quite well."}
{"review":"This is a very positive review: [[VIDEOID:mo3PN7CE2P74JSQ]]I recently traveled to Uganda (East African country) in October 2013. I had purchased this machine years ago for my own use and loved it. So I took it to a friend of mine who is a missionary in Africa for her to use. We both work as volunteers for a health care organization called Kissito.org. Kissito works with villagers in Africa to bring health and maternity care to villagers. So we demonstrated the washer to them after learning that the girls in African families must do all the family laundry each day before going to school. If they don't finish the laundry, they must miss school. Hoping to show the families something that could help them do their laundry well, and do it quickly, we took the machine into the villages. This video clip is one of a local villager who transports patients to the local health clinic demonstrating the machine to a group, including teasing a boy who is trying to turn the handle. This is the machine in action!What I love about this machine is it is pretty sturdy, since it withstood a year of my daily use, plus it survived 500 African villagers cranking on it all in ONE day!If you thought red Georgia clay was hard to get out of clothes, you haven't been to Uganda, east Africa.  These villages have no electricity, no paved roads, lots of kids (average family has 7 children) and lots of dirty clothes. Families there LIVE in dirt huts, farm, play, work and have the dirtiest clothes imaginable, yet the WonderWash got load after load of clay and dirt soiled clothing CLEAN! The villagers were amazed, as was I.I mean after all, my gym stains and smelly, lightly dirty clothes I expected to get clean, but the grime and dirt that rinsed out of the WonderWash when put to a REAL test was stunning. It was SO effective our organization is trying to find a way to get MORE machines to Africa. Why? Because the girls in each family are tasked with washing the family's clothes every morning before leaving for school. If they don't finish the laundry, they must MISS school to do so. WonderWash could CHANGE the world simply by providing the ability to wash clothes fast enough that these girls can do the laundry and get to school on time.WHY WONDER WASH ROCKSIt's lightweight, yet sturdy. I mean, after all it stood up to the rigors of a hike and trip in the back of an SUV on really rocky, difficult roads to get to an African village! It traveled TO Africa in a plastic tub packed with medical supplies, and survived the airline's handling without a crack or scratch!It is easy to assemble.It's durable. More than 500 villagers each had a chance to crank on the handle over the period of ONE DAY as we moved into three separate villages and demonstrated the machine with clothes the villagers brought to us. Kids, men and women of all ages and strengths gave it their best and it kept on working!It cleans! At one village we received a pair of pants a toddler had soiled himself in, a bloody towel from a health clinic, a pair of men's pants used by a man herding cattle and soiled with manure, and several very delicate, beautiful and colorful women's dresses, plus a large scarf. We washed them ALL in one load and they ALL came out CLEAN! Plus, they smelled GREAT!I can't say enough GOOD about this machine. I used it in the USA for a year until I got a car and could go to the laundromat where there was also a dryer. The only thing NOT to like about this washing machine is you do have to wring the clothes out and hang them up to dry...not a big deal. It works and for the price there's nothing better! I love it!"}
{"review":"This is a very positive review: We got this because the washer quit right before the holidays and we wanted to wait and buy a replacement washing machiune when appliances went on sale.  Now that I have this, I will never buy another washing machine.  Love it.- I recommend putting it up on a counter, workbench, etc.  Ours is on our head washing machine.  I think putting it down in the bathtub is awkward.- I also recommend filling it with a hose instead of trying to hold the tub under a faucet.  I disconnected the water hoses to our dead washer and use those.-- Some people dump the tub over because they don't like to wait for the Wonderwash to drain on its own.  I use the drain pipe and let it fall into the utility sink.  I think I will switch to a five-gallon bucket at some point and use the gray water outdoors for gardening or landscape plants.-- The clothes look better than they did using the regular washer.  I think the compression pushes out the dinge by percolating out the old detergent from previous washes.-- I bought a janitorial mop wringer and bucket to squeeze out the clothes.  I hang most of the wash on the basement clothesline and then do the rest in the dryer.  Some people buy a little electric spin dryer.-- The tub holds about half of the normal load I use to put in.  It takes less time to do each load, though.  I can put both the top and bottom queen-size bedsheets in and then do the pillowcases with the towels.  If I was doing king size sheets, I'd just do the top and bottom sheets separately.  I do one or two tubfuls of laundry daily and our clothes hamper is usually empty for the first time in my life.-- I timed out the spins and for a normal load, I spin the washing tub moderately slow 30 times in each direction.  If the clothes are very dirty I do double the number of spins.  To rinse, I can do more like 15 or 20 spins each way.-- The stand has suction cups on the bottom but I put mine on an old bath towel as I splash a bit as I pull out wet clothes.-- It was easy to assemble it.  Five minutes tops.-- I use a fourth of the detergent I used to use, and much less water.  The dryer runs a bit longer as the towels and jeans don't spin dry but I hang most of my stuff on the line so I use the same amount of electricity to run the dryer or maybe a little less.-- The shipping speed was fantastic.  I think I got it the day after I ordered it.*** UPDATE: The Wonder Wash lasted over a year, with a lot of use. I literally used it every day. One day the glue quit on the axle peg which holds the tub to the supporting frame. I tried to repair it, but couldn't figure out a solution. I have now switched to a plastic laundry plunger.  I got my money's worth out of the Wonder Wash, and it got me started with doing my laundry without a machine. I am glad I bought it. Here is more about my laundry switchover process: http:\/\/mgseltzer.hubpages.com\/hub\/I-Never-Replaced-Our-Washing-Machine-Part-One"}
{"review":"This is a very positive review: This is an amazing example of low technology. This simple washer works as others say it does and gets clothes really clean in just a few minutes.I would consider rinsing in the machine optional and it will be faster to rinse out socks, kitchen rags, undies, etc. by hand. As others have mentioned a laundry spinner would really round out the functionality. It is a challenge to get larger garments or other washables rung out by hand.Assembly was straight forward except that I could not get the front and back pieces to slide into each other completely. I got close but the little caps for the openings will not fit. No big deal.I read to fill with water over the top of the laundry but it works better following the directions (this manly man rebels against the idea!) for the amount of water to use based on the amount of laundry you are washing. The washing action is based on turning the handle about once every second. By reducing the weight from less water it makes it easier to turn.It is not at all difficult to turn. I washed a pair of chinos and a couple shirts at the same time and had no problems. The adverts say you can wash two pair of jeans at the same time. I suspect this is true.Most important the machine allows me to get back at all the people hoarding coins! You can keep the laundry machine quarters now for all I care!"}
{"review":"This is a very positive review: Just got this yesterday (3\/25) and washed my first load this afternoon after I got home from church. Put in five t-shirts after filling with water and shampoo, since it was on hand. Got the five shirts clean and smelling great after doing two rinses. Tried to wring out the water with two five gallon buckets (one with holes drilled in the bottom of it and using the other to press out the water), but there was still a lot of water. Hand wrung out the water before I hung them on the shower rod moved to the center of the bathtub. After three hours, they had dried a lot, but were still wet. Does work and will be recommending this to my friends. The reason for a loss of a star is the frame is a little fragile and the unit does move around quite a bit when you crank it. Am thinking about fashioning a wood frame out of plywood and buying an old piece of furniture to screw it into place to become more stable. Other than this, I wish I would have known about this a long time ago. Would have bought one."}
{"review":"This is a very positive review: This is great for quick loads of laundry, perfect for camping and small spaces. It's easy to assemble and use and cleanup is a Breeze. I'm very happy with this purchase."}
{"review":"This is a positive review: The instructions to the laundry alternative are easy to use. The product itself is simple! My only issue is that the knob on the lever broke off on my first use. Other than that, I can still use it."}
{"review":"This is a very positive review: Perfect for delicate items! Earth friendly! You can fit a full outfit in this thing including a pair of jeans. Ideal for camping or washing all of those delicate items like bras and lingerie. It uses very little water and was a blessing to have when our regular washing machine was in need of a part that took two weeks to ship!"}
{"review":"This is a positive review: Just spend the quarters at the campsite laundry area. I have used this twice and the clothes still do not feel or smell clean and all the clothes are stiff after washing. I have followed the directions and have rinsed the clothes 4 times the 2nd time and it didn't help. Just going to use the laundry facilities instead."}
{"review":"This is a negative review: I just received this plastic piece of garbage ... what a waste of money! You have to assemble it and the tabs they sent don’t fit into the holes of the triangle .. they give you two metal pins to hold tub on frame and one already bent trying to push it down .... so not buy ... a $50 pandemic waste of money as I can’t get it together and I won’t go out to UPS or post office to mail it back .Buy from a reputable store like BBB that will take it back"}
{"review":"This is a very positive review: my husband uses this and loves it. it fits in the bathtub, it's easy to use, and pretty sturdy. if you don't mind waiting for it to drain, it's pretty convenient."}
{"review":"This is a positive review: The wonder wash is perfect for my needs. This works great for apartment dwellers who hate laundromat. It takes more time (drying is time cosuming as the clothes have to wait dry, washing is simple and easy), but for me, it is totally worth it."}
{"review":"This is a very positive review: This is a great little washer that has just made our apartment life a whole lot easier. We have washed the usual stuff--pajamas, underwear, polo shirts, tee-shirts. All the items came out  clean. Also washed a king bottom sheet and two king pillow cases with bleach. Wonderful results. Haven't yet washed bath towels, but have done several hand towels at once. Those came out well too. On the strength of the hand towel results, I am looking forward to trying bath towels. I have made sure to weigh everything in a load so as to be sure I am not overloading. This little washer holds a surprising amount. Have been using a tiny amount of liquid, low-sudsing detergent, rinsing twice and it seems like things are cleaner than the community laundry could ever achieve. The cranking isn't bad. And. We got a spinner at the same time. Can't imagine using the Wonder Wash without it. All in all, we are very pleased we purchased this machine."}
{"review":"This is a very positive review: I've had this device for almost a week, but I've used it several times. It does exactly what its supposed to do, clean clothes. There are some issues I would like to mention, the first being the build quality. Now I haven't ANY problems, but I have a feeling that after a few months of use this thing might fail. The stand could snap and that would be a complete failure of the machine. Of course I could return it, but it would be a hassle. The lid is well made but again I have the feeling it could have fail easily, especially if you drop it or do something careless. And finally the draining system requires the user to push a drain pipe and then twist and lock it into the machine. This looks to be another possible failure point, the system uses a spring or mechanism and doesn't look to last very long, any slight problem with this would cause complete failure.The machine works great but come rinse and dry time, well that REALLY sucks. I've had to rinse up to 8 times to remove all the detergent. I do use more than normal, but I want to make sure my clothes are clean so I use a tiny bit more. If you use the 2 tablespoons then you'll probably only need to rinse 2 or 3 times.What I actually do for rinsing is I will leave the top off and twist the drain into place. Then I let the shower nozzle just fill up the basin, it usually doesn't over flow the top because it's draining at the bottom. This seems to help me save hassle time rinsing because I just let it run for like 5 minutes.If you leave The Wonder Wash in your shower like I do, then watch out for the pin clips that hold the handle on. They are very sharp and need to removed, especially around kids...you might need to fix them."}
{"review":"This is a positive review: Its holding up strong.Ive had it for over a year now, and it still works, though when i spin it, it shakes side to side cause of constant use out of it.Still use it frequently along with the mobile washer that i think does a better job of cleaning your clothes. To go along with the spin dryer sold by laundry alternative it has saved me money and has made trips to the laundry mat history now. hated carrying all my clothes dow the the mat, that no more!Will recommend this."}
{"review":"This is a very positive review: Maybe if I had the spin drier, no cat, a full sized shower, and loads of time to hand scrub all stains, then this would be worth it. As it is... Not so much. Here's why.I read all sorts of reviews and watched youtube videos before purchasing this through The Laundry Alternative's website. It is more unsteady than the videos showed. I worry that it will break while I'm turning it. And about stains. One older review states that the Wonderwash doesn't remove stains, and then other people replied say that he must not have pre-treated. Well, I had a light stain, so I not only pre-treated with Shout, but (after letting that sit for about five minutes) pre-soaked in hot water for over twenty minutes. Then washed it in the Wonderwash. It didn't come out. I then lightly hand scrubbed it, and it came out right away. So even though the clothes smell nice after, I won't be able to use it for even the most lightly soiled clothes unless I want to scrub each item by hand. Oh, and unless you tighten the lid VERY well it will leak like crazy.I have a very small apartment with only a stand up shower stall. My kitchen is too tiny. So it is very awkward to crouch in the corner of the bathroom cranking, then lean over to hand-wring everything.On a side note, I have a cat, and the lack of a spin drier (I'm too broke to spend another $68+shipping) means that all that cat hair is still on all my clothes. A normal clothes drier will remove a great deal. I know, that's just the way it is but it was still surprising to see all that hair on everything!"}
{"review":"This is a positive review: Very easy to assemble washing was a breeze the only thing I forgot to realize is that it doesn't really have a dry spin cycle so unless you live in very hot climates or have outside locations to hang clothes I would caution you from getting this project 😳"}
{"review":"This is a very positive review: I live on the third floor, no elevator,  no laundry. And I hate doing laundry, so will &#34;batch&#34; it and go to laundromat when everything is basically dirty.This is good to help stretch laundry times out. I wouldnt ever think to do heavy clothes like jeans or sports socks, but for light clothes or even women's delicates, I think this is ideal.I recommend you check out some YouTube videos on this first before you buy.One tip I recommend is that you use it to rinse your clothes after you wash them.Also, I dont have a good place, so I sit on the floor when I use this.Women, your arms will get tired, but if you switch your arms, you can probably use it as a workout too! Im no wimp, but my arm got tired.The unit needs partial assembly, but its not hard. Also, you aren't going to be able to power-crank on the handle, you will likely break it. This works on the motion, not the force, so you dont need to be super strong to use it, but the few minutes of washing will seem like a LONG time, lol.Drying is another issue, Ill leave you to figure what works for you.This is also a great &#34;prepper&#34; item if you believe the world will crash and need a couple years to re-boot and we'll all be reduced to...something akin to the second Planet of the Apes movie. For me, it stretches my laundry hauling!I would buy this again no problem, but Im glad I looked up a video or two online also.Enjoy!"}
{"review":"This is a very positive review: I got this gadget after much debate and lots of laundry washed by hand. My primary intent was cloth diaper washing but have found its impressive with reg clothing too! I have done several loads in it so far and am shocked at how dirty the water was when draining it. I have never seen such grudge come out of clothes that were not even VISIBLY dirty. I am doubting ever going back to an automatic machine. As for the washer, it was very simple to assemble, and very easy to use. I know a lot of ppl say the base doesn't seem sturdy, but so far no issues with mine. The only major downside is, you need to wring the clothes out either by hand, a wringer mop bucket, or get their portable spinner. I think I may invest in the spinner down the road after its been out a while longer (they recently released a new version) and I get to see more reviews on it. I currently wring with a pro yellow mop bucket I got at menards for 49.ish dollars. I also ordered the easy dry portable dryer which I am waiting on to arrive. Will review it later.I do recommend this washer! It's fantastic!"}
{"review":"This is a very positive review: I feel like it would be a 5 star product if not for 2 things. First of all, it does not come with instructions on how to put the product together. I comes with a piece of paper with instructions on how to use the product, why not just put assembly on the other side of that? Second, the handle to rotate could be better designed. The handle is like a normal door knob, I feel that if it stuck out more it would be easier to grasp onto rather than wrapping my hand around a ball like object.I've used the product only twice now, I do not know about long term at this time."}
{"review":"This is a positive review: It just lightly tumbled clothes around and didn’t really clean them. I tried spinning fast, slow, hot and cold water, and nothing really worked for me. Also doesn’t drain all the way, leaves about 1.5” of water at the bottom."}
{"review":"This is a very positive review: Four years later and I've bought two more of these to give to travel nurse friends as gifts! It's small, lightweight, an the drum holds detergent, softener, and Lysol laundry sanitizer  when I transport it.I'm still cranking my washing when I rent a place with no washer and dryer, and still delighted.I hand wring everything still, and have upgraded from rope in a closet to a collapsible clothes tree I spotted at a big box store. See the latest picture. That way, I can dry outside if the weather is compatible, but easy enough o do inside as well.I figure the Wonder Wash has saved me about 80 trips to a laundromat. Fantastic!-------------------------------------Holy wonderful washing unit! I really cannot tell you how impressed I am, but I am sure going to try.I've had the Wonderwash for about a week now and I've done laundry every other day. It's so quick and easy that I start it while waiting for my coffee to brew, let it drain while I make breakfast, do a rinse run while my eggs finish cooking, plate up my food while it drains, rinse one more time, and eat my meal while it drains the final time. It doesn't even need that final rinse, I'm just picky.It is absolutely perfect for my scrubs. I can wash and hang a couple of uniforms every couple of days and never run out again. No more waiting for the laundry room in my apartment to have a free machine.I've converted a closet into a make shift drying area with dollarstore plastic drop cloth, clothesline, and clothespins.This machine has successfully washed scrubs, delicate, jeans, workout clothes, towels, sheets, and tonight I ran my tennis shoes through it! The absolute success of it, across the board, has me writing this review while it drains.The machine is almost entirely plastic so it is super light weight. It snaps together easily for use. It uses very little water and detergent. Best of all, it really cleans.When not in use, I wipe the drum dry and stash it in the same closet I use to hang clothes. This is a must have for travel nurses. No more hunting for open laundromats at 2am, or checking the facilities machines every hour hoping to get some laundry done.I see this being great for camping too. I can't wait to take it on a trip. For now, it certainly sees enough use. Love love love this.TIPS AND TRICKS (Because I can find a dozen reviews and very little advice)°Add water and soap before clothes.Keep a hand towel nearby for inevitable dribbles.°If using hot water, pressure builds up (that's a feature, not a bug!) and sometimes the lid will start to leak. After a few turns, release the lid, lock it back down, and keep going. You may have to do this a couple times based upon how hot the water is.°This is where that hand towel comes in. Give the drum a quick wipe to reduce splatter.°Use a permanent marker to indicate the grooves on the drainage tube (see picture). This saves you the messy fumble of trying to line it up while water leaks everywhere.°Use less water to rinse than you did to wash. The clothes are already wet, and too much water causes the unit to wobble and thud loudly when it is turned. I have found that my rinse cycles take about half the water of my wash cycle.°Wash with hot and rinse with cold to save the &#34;lid dribbles&#34; when you don't need them!I rinse twice. After my wash, I add a spoonful of fabric softener to the first rinse, and plain water to my second. My clothes smell fantastic.°If you are line or coat-hanger-drying indoors, set up a fan to decrease your drying time exponentially. Also, it makes the whole room smell like clean laundry which is awesome!°Worried you're not rinsing out all the soap? With dry hands, rub your washed clothes between your fingers and then rub your fingers together. If they feel slippery rather than just wet, rinse again. And stop using so much soap, jeez.Hope that helps."}
{"review":"This is a very positive review: I had high hopes for this. I do a lot of outdoor activities that get me grimy sweaty gross and I don't have enough to run a load of laundry and I don't want it sitting around stinking... so I have been hand washing in large buckets in the shower.1) despite the suction cups, it isn't particularly sturdy. Shower floor was wet, tried repeatedly to get them to suck but nope.2) don't even think of trying to carry it and attach to frame with water in it. It is heavy and slippery. Fill a pitcher or whatever and fill it.3) Draining. Attaching the drain pipe is easy when it is not wet, but when it is wet, it is a beast to get locked on. And, the drain is in the very bottom, you have to reach in and moveclothes yo clear the access to the drain. And even after removing all the clothes, there is still water in it that won't drain out. (Suggestions to mfr: make drain tube textured and have it pointing out opposite side of handle so someone can see it a little easier)4) Damaged clothes: for the only washing done with this - i didn't have any stinky clothes, so I tossed in 2 cotton nighties,  3 socks, some knickers and a corron sarong. Nothing had buttons or rivets or zippers. But my sarong was ripped in multiple spots. Ruined!Cleanliness wise, i washed the mates to the other 3 socks &#34;the old way&#34; in my bucket and compared them after drying. Didn't see any difference in the Laundry Alternative method.Returning."}
{"review":"This is a very positive review: I don't have a washer or dryer so I was looking for something to help me with hand washing my laundry. I got this wonderwash. I was very disappointed at how little you could put in there and spinning the machine actually takes some strength. I used it for a week and was back on amazon looking for a better alternative. It does get the clothes clean but it hardly spins the rinse water out. As I said it holds very little, maybe one outfit. It would be great for camping though, especially for swimming suits.I ended up ordering the laundry alternative washer that plugs in and was much happier with that. I also think the price is way too high for something that is not electronic, made of plastic, very small, and requires a lot of work. Emptying this thing was also a pain."}
{"review":"This is a positive review: Item arrived with incomplete instructions for assembly. I had to search online to find the info needed. Cleans clothes okay. Requires wringing of clothes before hanging to dry. I have arthritis in my hands, so I purchased separetly an electronic portable spin dryer. Compact size."}
{"review":"This is a positive review: Great in-between small portable table top washer.  A lot of work though.  The only thing I didn't like was the handle was not movable to the other side, and the way my Kitchen is set up, I didn't have much room.  They should have made it so you could change the drain pipe so it would work on either side."}
{"review":"This is a very positive review: Love this!!! I use it wash cloth diapers (pre wash) it works better than I ever expected!! I will definitely be taking this camping with us!"}
{"review":"This is a very positive review: This thing is a lifesaver!!!!!!!  I absolutely love it!!!!!  It is such a timesaver and money saver.  I washed my son's clothes last night in 15 minutes - 2 loads washed and spun dried with the Nina Soft Spin Dryer (WHICH IS FAAAAAAABULOUS).  I don't know how I didn't know about this sooner.  I washed clothes while I was making dinner in the kitchen.  For those who can never make it to the laundry mat before piles and piles of laundry build up, this is the way to go!!!!  You absolutely must buy the two together.  Clothes are soaked after using this washer, but I squeezed the excess water out, and dumped it in the spin dryer, and it comes out like it was just damp - no lies!  I highly recommend them both, especially for stay at home moms that don't have washing machines at home."}
{"review":"This is a positive review: I am using this for convenience, cut electric bills and as a key tool for surviving hurricanes here in Florida when the electricity goes out. It is so cute and so well made. How anything could be so sturdy and so light is a mystery. It functions very smoothly."}
{"review":"This is a very positive review: I bought the Wonderwash to take camping in my small travel trailer. It works like a charm. I've been using it at home off and on to test it. It's easy; the clothes are clean. I'm using biodegradable detergent. The clothes are really wet, so I bought the Nina Soft Spin dryer, too. I highly recommend the combination."}
{"review":"This is a very positive review: This is the perfect supplement for when I can't use the machine. It's easy to use once you get into a rhythm, and it works!"}
{"review":"This is a very positive review: This is awesome! It saves money & electricity! I even made my own homemade detergent & it works perfect in this little washer. I love it!"}
{"review":"This is a positive review: I have used the washing wand but since using the wonder washer just about an hour ago completely chnaged my mind, this will be my one and only washer combining with the Nina soft spin dryer I am set. You could literally see the water turn dark every after wash. Thank you so much Laundry Alternative!!!"}
{"review":"This is a very positive review: The Wonderwash works well, including the advantage of being able to time your own bleaching or fabric-softener rinse.  Along with a good indoor\/outdoor drying rack, you can do small loads more often and save quite a bit of money in no time over using laundromats.  Also feels more self-reliant; you could still wash your clothes in a power outtage, as long as you have water! - The one-star deficit is because the Wonderwash doesn't remove stains very well, as other reviewers have noted, but using a' stain stick' or spray beforehand might help (will try on my next load).  Worth the price!"}
{"review":"This is a very positive review: Super easy to use, cleans laundry shockingly good! This is a must have for long camping trips, or if you just have a few delicate items that you don’t want to use a washing machine for. I’ve washed my cloth diapers in mine and they came out spotless!"}
{"review":"This is a positive review: Still in the box and hope it stays there. I got this for a rainy day and i hope that if i ever need it all the parts are in that box."}
{"review":"This is a negative review: We live on a boat so we needed an inexpensive alternative. The whole thing started disintegrating during the first use. Replaced the cotter pins and glued in the stability arm pieces. This is a rinse, not a wash. All stains get locked in. Now, it no longer holds water because the cap is cracking."}
{"review":"This is a negative review: There is no point to this. May as well fill a jug with water and shirt. It arrives in 50 pieces and instructions SUCK. I SENT IT BACK FOR REFUND."}
{"review":"This is a very positive review: I have a family of 4 that I do laundry for and wanted to save money, so I purchased this product.  I love it and I actually enjoy doing laundry now.  This cleans better then my front load washer. It gets wine, blood and chocolate out of clothes without any pretreater. My clothes are clean and smell great. I highly recommend this to anyone.  I had it now for several months and it works."}
{"review":"This is a negative review: It works but it leaks water out of the top terrible. It isn't a big deal if you're using it outdoors but I don't want to fling laundry water around my house and have that mess to clean up. I wouldn't purchase this again."}
{"review":"This is a very positive review: Well first of all its not made to wash full loads of laundry! I bought it to have just in case of power outage or to wash small loads in case of emergencies, and for that it is absolutely perfect. It uses a small amount of water and detergent and I like to crank the load for twice the amount of time described to get clothes cleaner. Clothes came out clean and after sun bathing them for 20 min they were dry. I love this product highly recommend it."}
{"review":"This is a very positive review: If you are single and live in an apartment without space for your own washer and dryer, this is the way to go. It works great to get your clothes clean, and with a little extra labor it is well worth it. I did a little math, it cost me about $10 to $15 a week at the laundromat, that is $50 to $60 a month. My total water bill is $12.00 a month. Do a load with this every other day or so and save at least $40 a month. That adds up to $480.00 a year. That's not including the gas you burn driving there.Things I've been able to wash with Wonderwash: a bunch of various whites, socks, underwear, a couple of T-shirts; a pair of jeans with a sweatshirt, 2 unlined curtain panels, and even a winged back chair cover."}
{"review":"This is a very positive review: Easy to assemble. No scent. The suction cups don't readily work but who who cares. This is a fantastic product. 2 minutes to crank a full load clean 30 seconds to rinse. I hand ring mine. They came out bright and very clean. I used a half a lid of tide liquid detergent and half a lid of gain fabric softner. I love this and use it weakly."}
{"review":"This is a very positive review: Look, it's a good product don't get me wrong. Very excited to save time and money at the expense of a little bit of storage and modest effort.But... it's pink. Why pink? The Amazon picture is as white as anything, but not the product I received. Doesn't bother me enough to send it back, still, use better pictures man."}
{"review":"This is a positive review: I got this for my small RV for when I'm out boondocking for extended periods. It was easy to assemble and gets my clothes clean. I will say if you have dirty, grimy socks it's best to pre-soak them first, but normally soiled clothes are good to go.Only complaint is what are all those little inserts along the base for?  I put them in but the darn things keep falling out."}
{"review":"This is a very positive review: We use this product on a daily basis along with another Laundry Alternative product the Nina Spin Dryer. Both products work great and seamlessly together. Tips when using the Wonderwash is to use 2 tbsp of Tide powder and 1 tbsp of Oxi Clean per full load along with to pitchers full of HOT water this machine works via steam pressure. We spin the washer several times, wait thirty minutes to soak, spin again several times, empty and repeat twice with detergent once without. Our clothes are very clean everything from my husband's work pants to dirty cloth diapers. This is so much easier for me as a pregnant woman than the ole plunger bucket method and it is much more effective in cleaning our clothes thoroughly. One full load is roughly 3 towels, 2 men's pants, and 4 shirts."}
{"review":"This is a very positive review: This washer is a gem: it does a couple of pairs of jeans at a time and GETS THEM CLEAN without my having to get my hands wet.  For best results,  let heavily soiled items sit overnight in the washer with soapy water before washing.Provides a workout -- And you might try to pick a spot where splashes won't be a problem, and water supplies are easy to manage, as the fun wears off if you have to bend double to crank the arm and then lift the whole thing to bring it to a drain.  I work outside on a picnic table and let it drain into my garden.This would be an excellent gift for our friends in the Islands, especially those hit by the recent hurricanes..."}
{"review":"This is a positive review: This worked ok for us for a few months but the seal on it broke after a few times and it slowly fell apart after that. I gave it to my sister when it was mostly functional and her kids were kind of rough on it too so if you have any kids this probably is not the product you want. My husband and I did like it for when we were traveling though."}
{"review":"This is a very positive review: I received this item by mistake but I am glad I got it!  I use this for small loads only and it does the job for me.  I use liquid detergent with oxyclean powder and my clothes came out clean.  I did have some spots on my clothes which this unit was able to get out.  I rinsed me clothes twice.  I also have the spin dryer by the same company and they work well together.  My only problem with this unit is it is messy; water seems to get everywhere.  I use it in the tub so it really is not a big deal.  For the money it is a good buy."}
{"review":"This is a positive review: Assembly didn't need instructions. It's that straightforward. The washer is a little too large to tuck under a counter or in a coat closet, but it does sit nicely on the counter. You will need something to hang wet items on for drying.Others complained about the washer not providing agitation, and I can't help but wonder if they missed a crucial idea: you determine how much agitation the laundry gets. First, the clothes have to have room to move. Don't cram everything you can into a load. In fact, the more agitation it needs, the fewer items should go in. Second, don't fill the washer up with water. As you turn the handle, you should hear and feel the water slosh and the clothes fall from one end to the other. If you turn to quickly, the water and clothes will stick to one end due to centrifugal force. If the washer is full of water, there's no chance for the clothes to hit the bottom and the water to pour over them. If you're absolutely determined to get more agitation than the washer can provide with simple physics, get yourself some decorative river rocks - heavy, round, and small enough to fit in the palm of your hand - and put a few in the laundry when you wash it. That will allow you to beat the clothes without tearing them up."}
{"review":"This is a very positive review: I am 63 years old and it’s just myself and my handicapped adult son we live in a 2 bedroom apartment it has a stackable washer dryer in the bathroom but our apartment at one time was a mansion now converted into 4 apartments and is beautiful but was built in 1850 so I have no idea how old the pipes for the washer are but our clothes always smelled no matter what I used to clean the washer ( water in the rest of the apartment is fine) certainly did not wish to move out of our lovely apartment over this 1 issue so I purchased this to keep from having to go to the laundry mat ( along with the Ninja spinner) ( My dryer works fine)Oh my goodness am I pleased!!! This gets our clothes extremely clean ( I pre treat just like when I use a standard washer) If you are concerned about how much clothes can fit in here my son is a very large man wearing size 54 jeans and a big man size 7 x shirt and his clothes fit in here just fine! I use maybe slightly less than 1 measuring tablespoon of Tide to wash and a little less than 1 tablespoon of downy in the rinse cycle the clothes are not only clean they smell amazing! I then put them in my Ninja spinner for 3 minutes and then into the dryer( they are so dry out of the Ninja spinner that if you don’t have a dryer it shouldn’t take long to dry on a rack) I absolutely love this thing and I believe most people would be pleased with its performance and ease of use( like I said I’m 63 and it’s very easy and not strenuous to use at all)I hope this review helps someone who is thinking about purchasing it... the washer and spinner take up very little room fit easily in a closet when not in use."}
{"review":"This is a very positive review: +laundry bucket itself is sturdy+very easy to use+cleans well enough+great for laundry emergencies-weak stand, if that thing finally breaks then that's it. Will either have to order a new stand or make my own."}
{"review":"This is a negative review: This unit does work and gets clothes pretty clean, but the handle develops cracks with continued use. Mine cracked on the sides in two places, and if I had continued to use it without reinforcing it, the lower third if the handle would have broken off, rendering the unit useless. I have put several small zip ties all along the length of the handle, and this has made it function as it did when I first got it. If you want it to last I suggest you reinforce it with small zip ties before it cracks, and you should have no problem. I have had the wonder wash a couple of years and this has been the only issue I have had with it.9\/1\/14. Now the frame has cracked and it is no longer useable unless I purchase another frame. I don't use this on a regular basis anymore or I'm sure it would have broken sooner. I got an electrical countertop one by Avanti which is much easier to use."}
{"review":"This is a very positive review: I admit it, I bought this because I had a fantasy of myself as an earth mother with fabulous biceps.  I pictured doing small laundry loads a few times a week, cranking away flabby chicken wings as I cleaned up my laundry pile in wholesome, green, human-powered virtue!  Realit, on the other hand, was a crank that is a little easier than I pictured so my chicken wings are not threatened, and the wash water wasn't the thorough human-powered pinnacle of cleanliness I had pictured.  It wasn't bad but I had to repeat my wash a few times, and then hand-rinse in the sink, so no green water saving either.  I might just not have mastered my technique so I'll give more tries on this before I find a camping friend who wants to share laundry with the mosquitoes under the stars, but pretty sure that my dreams of buff earth-mother virtue are dashed."}
{"review":"This is a negative review: Works swimmingly!!  Just crank slow to avoid that spinny thing they warn you about.  I will be installing a bigger handle because you can barely grab onto that tiny knob."}
{"review":"This is a negative review: It is not for me.  It takes quite a muscle to crank it.  Mine came with broken part where the crank is in contact with the frame.  I think it is a poor design and I can do better with hands and a cleaning board.  Besides, to close the top lid is not easy in order to catch the suction.  I tried several times using it and I find the bucket with soap and hands is more efficient."}
{"review":"This is a very positive review: Easy to assemble even with limited directions.  I've tested it and am impressed!  My only complaint has been mentioned in reviews before and that is the base is not really solid.  The clips don't secure as well as I would like to see but would not preclude me from purchasing.  The machine does everything claimed and I really love it!  Great for apartments, dorms, camps, campgrounds and extended power outages!  Also a great machine for off grid!  I would highly recommend it!"}
{"review":"This is a positive review: One at the moment. I received this opened it up today. The drain pipe was chipped and cut my hand. Also no directions on how to wash clothing. So emailed a nice note to company. Meanwhile  the base will not go together on one side ovioussly it's broken. So emailed again will see how customer service is will keep you all updated. Because it it worked it would be good."}
{"review":"This is a very positive review: 5-year PREFACE:In January of 2020, I will pass the 5 years of usage point. This Wonderwash is still one of the greatest purchases I have ever made. If you read past the preface, you get the entire story. I wrote my first review after 1 month followed by an Addendum after 1 year. I thought I should come back to give this update... I'm still cranking & my clothes need less detergent to get clean. At some point, between 1 & 5 years, my rinse water started running clear after the detergent removed the dirt. I don't ever need to wash twice now; nor do I need to soak as much. I generally do let the detergent & softener rest for about 10 minutes then crank for 1 more minute. However, I'm no longer dealing with old stains & buildup so my clothes are cleaner. Bonus: they look better too... like new again. I love my Wonderwash!!!ONE MONTH REVIEW:Stains are fading! I've been using it for approximately 1 month now and I've noticed the stains in my dishcloths and cloth napkins are fading away! My clothes seemed to be looking better but I thought it was my imagination until I noticed & watched those specific stains. I guess it's the smaller loads or something? Whatever! It works better than the standard washer I was using... And it's Eco-friendly! Win-win!  If you were wondering about ease of use... Be sure to measure the water, per the instructions, and away you go. I do switch arms to keep the workout balanced... Generally, 2-3 loads each day I do laundry; alternating arms by day, not load. Once you get it going it's 100% aerobic...but EASY! The water gets flowing & it is almost self-propelled; if you feel like you are struggling you have too much water or clothing... Or you didn't get it going fast enough, crank faster. Once you get the speed right, the water seems to do most of the work. Just remember not to smash the clothes in too tight and you should be fine. [When you drain the water, if the clothes fill more than half of the washer... you got too many clothes in there!]  As for drying, I use the Nina Spin Dryer - also from The Laundry Alternative. They are a perfect match. By the time I finish another load in the Wonder Washer, letting it drain for a while between cycles, the prior load is almost done hang-drying. I let the rinse drain until the first load dries, then I spin dry and hang. It makes the process almost relaxing. A friend stopped by while I was washing & was amazed that things hang dry as fast as his big electric dryer can dry things. He was also amazed at how much fit inside the washer...looks can deceive.ADDENDUM:Now that I have used the washer for a year, let me just say that my clothes like the gentle treatment! Stains don't last, fabrics have smoothed out, and the things I have purchased since buying it still look like new... it's like a front-load washer only MORE gentle!  I see that they have updated the lid, which I think is a great idea. The first time my daughter used mine she didn't get it closed all the way cuz my old style lid requires many turns to tighten\/seal it... she spilled water everywhere. But just once!  I have oiled it once but it is squeaking here & there so I will probably have to oil it again soon... making oiling necessary about twice a year. I haven't had to replace any parts but they are all available from The Laundry Alternative. It was super easy to put together [when it arrived] and replacing parts that break instead of buying an entire washer is another bonus.  I have to admit, I do 3 cycles most of the time.  I do the detergent cycle, a white vinegar cycle, and end with a softener cycle. I crank each cycle for the 2 minutes they recommend for washing. I count 120 cranks; as the cranks take about 1 second each. That's 6 minutes of cranking per load. [Super dirty stuff gets extra rinse water thrown in WHILE DRAINING & comes out clean.] I also alternate forward & backward cranking, not just left & right arms, & my arms look GREAT! Just thought I would throw that in.  I should add that I am enjoying the exercise factor. It has gotten so easy to crank that I love doing laundry! I also find that the rest of my body benefits from the isometric exercise; holding the rest of my body still while cranking has toned me from head to toe...And my clothes look great on my toned self; more bonuses!!!  One year later, still cranking & loving it!!! ^_^"}
{"review":"This is a positive review: This thing is bulky, it's not real small you can tell by the picture.  It is totally plastic, when you crank it it does wobble.  The suction cups do work but not well because some are crooked and wont lay flat to suction to the counter top.  You can wash as long as you want (keep cranking) or just rinse.  To drain you need a long hose to put to a drain or you need this thing sitting beside the sink.  When it is full of water and laundry it is HEAVY so it is difficult to move to drain.  It is great for small loads but STURDY it is not.  IT DOES WORK.  I have had mine a few months I have even washed sheets and pillow cases and small throw blankets and towels in mine.  I just crank, do something else, crank some more, crank some more as long you feel the laundry has been washed long enough to suit you.  It is wobbly but it does work!"}
{"review":"This is a very positive review: Awesome investment. Wonder Washer is easy to assemble and use. My clothes come out softer, cleaner, and less damaged compared to my giant electric machine - all while requiring minimal resources. The Wonder Washer is an impressive feat of design. Cap is simple to open and close while sealing flawlessly. Base is sturdy and secure. Cranking is easy and fun. Drain spout attaches to unlock the well sealed bottom valve to release the water with a satisfying click.I believe the level of cleanliness and softness is because while being cranked, the water becomes structured due to the circular tumbling. Structured water is known to improve clothes washing, plant growth, and body hydration. My electric machine really damages my clothes. The Wonder washer helps my clothes come out no only soft but with out pills or other signs of damage. It's perfect for the amount of laundry that I do. I was able to fit all of my laundry in one load. My clothes came out impressively clean and soft - no fabric softener required.Wonderful for a quick wash of socks and pants as as needed using minimal resources. Because of chemical sensitivity, I make my own detergent with borax and washing soda. DIY detergent works great in the Wonder Washer. I couldn't love my lil R2-D2 Wonder Washer cleaning pod more. Even considering purchasing a second to use as a water structuring device."}
{"review":"This is a very positive review: After reading many reviews, I decided to buy a Wonderwash in hopes of washing a few small items. I like that it's green, saves on water and doesn't use electricity. However, I had issues with the spout where it did not stay in place. After contacting the company, they sent out a new spout, free of charge and immediately. I really appreciate the customer service of this company. Using the Wonderwash for the first time, I had issues with the spout, not sure how to prevent it from leaking water -- perhaps it's meant to leak out a little when I want to rinse - but the clothes smelled and looked clean."}
{"review":"This is a very positive review: Yea...you have to work for the clean clothes, but so what? You get a bit of exercise. You get clean clothes at minimal costs. I purchased this because the barcode technology attached to the laundry machines in my apartment complex were down for a while. I was having trouble getting the appropriate amount of quarters needed to do my laundry. I ordered this and received the same day with same day shipping. Yay! Loaded this manual washing unit with clothes, water and detergent. My clothes came out just as clean as they would had I put them in the electric washer. I didn't enjoy having to hand wring my clothes prior to hanging them to dry (actually got a blister), but only found this to be a minor nuisance in the grand scheme of things."}
{"review":"This is a very positive review: I've been using this machine for our laundry for almost a year now. We have plumbing problems in the part of our house where the washing machine is, so this has been a really good stop-gap measure until we can afford to get it fixed. I still have it and use it several times a week and it's held up pretty well after almost a year of use. We own a farm, so as you can imagine our clothes get DIRTY.A few things to note about its functionality. The dirtier your clothes are, the more times you are going to have to run them through the machine. I find it works best to sort the clothes by their level of dirtiness. If you have a bunch of pretty clean shirts and you mix them together with some muddy jeans, you are going to be running it through just as many times as you would had you mixed the muddy jeans in with dirty socks or other equally gross clothes. The pretty clean shirts generally will only need one wash and one rinse, so you'll save yourself some time and cranking if you sort by cleanliness rather than color or type of clothing.The biggest downside of this machine for me, is trying to get a reasonable amount of water out of the clothes before putting them in the dryer. You really have to wring them out well, and some types of clothing\/fabric are easier to wring out than others. I find it works a lot better to dry them on a line outside but that's not always an option depending on the weather.As far as people's complaints about it not getting things clean, you're just not following the directions. It only works well if it is full of clothes, but not too full, and you can't crank it too fast otherwise the centrifugal force causes the clothes to cling to the sides of the machine and no agitation occurs. You want to hear and feel the clothes drop from one end of the washer to the other, that's how you know it's doing its job. Sometimes you might need to adjust the water level or add\/remove clothes to get the right balance.Overall, I recommend this machine to anyone who does not have a conventional washing machine in their home for whatever reason. Cheaper than a laundromat, and you can stay home and multi-task while you're waiting for it to drain or fill with water."}
{"review":"This is a very positive review: This was a gift for someone who does not have a wash machine and does her own clothes. She loves it not much else to say!"}
{"review":"This is a very negative review: It's good, but I washed a really gross towel in it and then forgot about it for weeks. I became too scared to open once I remembered that I had done laundry, and now this towel has been sitting in the wonderwash for months. I'm dreading what I find inside."}
{"review":"This is a very positive review: I live up three flights of stairs from the shared laundry facility in my building.  Due to some injuries, schlepping the laundry up and down was tough.  So this looked like a fantastic solution!  I was excited to receive it.The box in which it shipped worried me because it made me think the thing must be TINY.  But it's disassembled inside the box and actually larger than I expected once assembled.Assembly was super simple -- no tools required -- and seems to be a reasonably firm unit during operation.  There is a bit of twist\/wobble to the support base while you're rotating the handle but nothing that interferes with using it.  My counters are very small so I can't get all four of the very effective suction cup feet adhered to the counter before use.  That could be a big part of my problem, and I suspect it is.I do wish that the drain swiveled or had a flexible hose instead of the rigid one.  Because I'm right-handed, I want it facing in a direction during use that doesn't work well for draining it after the washing is done.  But it isn't heavy - even when loaded - so moving it into a draining position after you've finished rotating it the specified length of time is easy enough.The instructions that come with the unit are minimal.  I think I used too little water\/soap in the first effort so added more the next time, which seemed to do a better job.  Likely user error, as I underestimated the weight of the laundry I was adding.The volume is small.  You're not going to be doing bed sheets or bath towels in this unit.  But for shorts, tee shirts, socks, tea towels, and other small garments\/pieces, it's a great size and saves on trips up\/down the stairs.It does NOTHING to help you wring or dry the clothes.  So when you're done you'll be faced with absolutely waterlogged clothes that need to be hand-wrung, which was a bigger mess\/hassle than I predicted.When empty, it's really light and very easy to move -- except for those SUPER grabby suction feet!  I've never had such luck with suction cups on most products but these are EAGER.  They also have little tabs on the edge that makes it easy to lift and break the suction when it's time to move it.There are some clever things they could have done to make it a bit better. Some built-in lid holder that would let you keep the lid off when it's stored.  Same for the drain pipe, which I've just left inside the unit while stored.  A bit more rigid stand would be nice but might add to the weight, with which I was very pleased.  It's really light and easy to move.Oh, and I had thought that the product write-up suggesting that the hot water would create pressure inside the unit was probably optimistic.  But it really does create enough pressure to cause the drain water to come shooting out with some force after you're finished washing.The clothes that I've washed so far have not been as clean as if I had used a proper machine but that isn't the point of this product.  It doesn't pretend to replace big machines.  And what it promises, it absolutely delivers.  I can highly recommend this product."}
{"review":"This is a very positive review: I grew tired of going to the laundry mat, especially now with  COVID19. This was easy to put together, it's easy to use, and for me, a lot of fun to use. I get a work out using it so that right there is a bonus. I may never use a conventional washer again!!! And don't forget, I'm also saving a ton of money doing it this way...I highly recommend it."}
{"review":"This is a very positive review: Directions to put together were scary to look at, very intimidating. But it was super easy to assemble. Took a couple washes to get it down, but I absolutely love it.Adding after actually using, it leaks like crazy from the lid. I have tried positioning the lid different ways when putting it on etc. And it still leaks. Also, the drainage piece leaks, and does not attach to the hole. It's such a hassle, the water doesn't even drain all the way I end up dumping it."}
{"review":"This is a very positive review: I love this thing. I do laundry about every other day. For 3 of us...my husband, my 7 year old daughter and myself and it works great! I make homemade laundry soap, if the thing up and go. I do probably about 4-5 mins or less (for washing and then the same time span for rinsing). But not the 2 mins they suggest. Normally my daughter is in there talking to me...so I lose track of time. I also bought the The Laundry Alternative Centrifugal Clothes Portable Spin Dryer (from the wonderwash website...seems to be cheaper there). Tried that for the first time yesterday and it def works as well. Perfect combo. I can't wait to see what kind of dent it made in my electric bill!"}
{"review":"This is a very positive review: Living in an apartment without access to laundry facilities (except the laundromat, of course) kinda sucks.  I would throw this sucker in my tub and do my laundry there.  Some people complain about leaks when you insert the drain tube; put it in the tub--then you don't care.  I used this guy for around a year before I moved.  Just hang your stuff from your shower curtain rod and you're golden.  It's a huge time saver and I loved being able to do laundry when I had time (like at midnight) and not just when the laundromat was open.People ask, &#34;does it get your clothes clean, though?&#34;  Weirdly, it does.  I always used cold water because I just prefer cold water for washing clothes.  I never had any issues with getting stuff clean.The next question they always ask is, &#34;ok, but how much stuff can you actually put in there?&#34;  A LOT, actually.  Think of a regular-sized washing machine.  It's about half of that capacity.  I could put any one of the following in the machine as a full load:* 4-5 pair of jeans* 7-8 regular-weight tops (not like sweaters)* a week of socks, bras, and underwear* 10 pair of PJsI'm a plus-sized woman, so it's not like the clothes are Tinkerbell-sized.I used the machine with and without the spin dryer that LA also sells.  You can totally use this machine without the dryer.  If you're on the fence, just buy the washer and think about it for a while.  But I'll tell you this:  if you get both, you won't regret it.  Get the pink Ninja one and you will be happy, happy, happy."}
{"review":"This is a very positive review: Does what it says and I'm pleased with it. The crank is easy and it was also easy to put together. At first I wasn't certain how to work the pressurized lid but, looking through some Utube videos, it made sense and I understood it a little better. The Mini Washing Machine is easy on the laundry detergents and although there is no spin cycle I have no problem in wringing clothes out by hand. Fortunately, I DO have a dryer and it does take a little longer for clothes to dry but otherwise everything is good."}
{"review":"This is a very positive review: I'm single, live in a New York City apartment, and hate laundromats. When the basement laundry in my building was shut down (again!) I looked into something to do my laundry at home and after some research settled on the Wonderwash and the [[ASIN:B002HT0958 Mini Countertop Spin Dryer]].I've only used it once so far (it arrived today) and I'm quite pleased. It's still basically doing laundry by hand, but this makes it a little easier and probably gets the clothes cleaner, plus I don't have to scrub my sink first. It even gives me a bit of an arm workout!My sink is big, but not big enough for the Wonderwash with the handle in place, so I removed the handle. I put in a little detergent, put it under the faucet to fill, screwed on the top and just turned it with my hands about 100 times. No problem. Then I opened the top, tilted it to drain some of the water to lighten the weight, lifted it out and put it on the counter to put in the drain tube. Then repeated the process twice with rinse water.It works exactly as advertised - not as easy as a home washer\/dryer but it makes home laundry easier and more efficient in a small size."}
{"review":"This is a positive review: Boring to stand there cranking this thing 200 times, drain, add more water and crank 200 mores times and then wring it all out.  Don't know what I was thinking when I bought this.  Clothes didn't come out that clean.  Think better to use buckets with plunger"}
{"review":"This is a negative review: Takes forever to clean anything but that come with the territory. My problem is its build cheap and leaks I'd buy a panda duel washer but this works if it's all you can afford"}
{"review":"This is a very positive review: I bought this product thinking it would save water and money.It does both of those things. But. A honest break down of this mechanismIs. A bucked that you can spin with a handle and drain with a sligh vacuum pressure. It is useful for camping. But not useful if you have runnin water, a bath tub, a sink, or a bucket that you can drain.I am not trying to push you away from the product. But help you understand that you can achieve this goal with what you have at home. And if not.m, BUY IT."}
{"review":"This is a positive review: This actually cleans very well. I ended up getting an electric one because I got tired of cranking but I'm definitely keeping this for camping and stuff."}
{"review":"This is a very positive review: I didn't know really what to expect, but it's so easy and takes no time at all to do a load of wash.  It actually got out a sauce stain from a blouse!...wasn't expecting that! Great for my small apartment and I haven't been to the laundromat in weeks....it's already paid for itself...I love it! :)"}
{"review":"This is a positive review: I purchased this to put with my prepper gear but ended up having to use it when the apartment washer broke.  It worked just fine. The reason I am giving it 4 stars instead of 5 is because there is no way to spin some of the water out.  I had to wring them by hand and roll them up in a few towels.  I am not dissapointed though because for camping and during an emergency, it will do the job just fine."}
{"review":"This is a negative review: Might as well do the laundry in the sink.. this thing is awful and over priced. So hard to turn it. And takes forever to get the soap out, the clothes are never clean."}
{"review":"This is a very positive review: I'm not sure it was worth the $60 I paid for it but it works okay.  We live in CT and were without power for 7 days during hurricane Irene and then another 9 days during a freak October snow storm.  I wanted something so that I could wash the 'essentials' during extended power outages since they seem to happen frequently here.  I did three loads of wash and it worked okay, seemed to get things clean.  It was easy to assemble and use.  The material isn't the highest quality but it seems sturdy enough for extended use.  I did my wash in the bathtub and did not have any issues, it was easy to fill and drain in the tub and fit okay to be able to spin it.  I did not have any issues with the suction cups not working like some reviews mentioned. As a family of 3 with a regular washer in the house I can't see using this daily for us but it should work good for prewashing really stained or dirty clothing and washing the sand out of my daughters clothes after she's been playing in the sandbox.  If you were single and lived in an apartment with no convenient access to a washer then I could see this as being very nice to have around."}
{"review":"This is a very positive review: Much better than expected. I use it almost every day. Washes as well or better than a huge electric machine. Now if they would only make one big enough for bedspreads and comforters..."}
{"review":"This is a very positive review: I have washed several loads with this device and my clothes comes out cleanI love this device it saves a lot of money because I live in an apartment where we have to share dryers and washing machines and they cost $3 a loadbeing single I don't accumulate large loads of laundry so this is a perfect alternativeI would recommend this to friends"}
{"review":"This is a very positive review: I have washed several loads with this device and my clothes comes out cleanI love this device it saves a lot of money because I live in an apartment where we have to share dryers and washing machines and they cost $3 a loadbeing single I don't accumulate large loads of laundry so this is a perfect alternativeI would recommend this to friends"}
{"review":"This is a positive review: [[VIDEOID:a40caa26a0c5f1a9e7330b9569773b6e]] Finally someone invented something that is good for the planet.  That doesn't need electricity.  I m so thrilled about the money I m saving!😄!  I did one load the first day it came to my house.  It takes a little time , but you can do it while you are talking in the phone or watching your telenovela.The only bad thing is where do you hide your washed underware from those neighbors that have a second floor?From now on I m not having any dirty clothes in the bin."}
{"review":"This is a negative review: They really need to make the assembly instruction more clear. I know how to do laundry so only the ratio chart is needed but you need to show in real pictures how to assemble the stand and put in the pins so they stay. I almost lost a pin down the drain! This is the exact thing you need to do laundry if you are so far out in the woods that going to a coin laundry would not be possible. This is not for constant use. It's just tedious. I got it to see if I could cut down on the trips to the Coin-Op but I'd rather do all the clothes at once and forget about them then have to plan a &#34;laundry day&#34; every three days. Get a drying rack and clothespins at the same time you get this because unless you spend $25 on Amazon (and I mean ON AMAZON PRODUCTS they will not sell you a bag of clothespins!). It's an &#34;add on&#34; item.  Anyway this if for camping and emergency laundry (like if you suddenly get hit with an F5 storm) machine."}
{"review":"This is a very positive review: My landlord does not allow a washer\/dryer in our apartment. This little Wonder (truly) takes up hardly any space. I put a sturdy cutting board across one of my double sinks and put it on that. It can do a lot of laundry especially in conjunction with the Laundry Alternative's Spinner which I also have and recommend. (It feels like sweet revenge.) I then hang my clothes on a bar inside the apt to dry. It's easy to fill, I use half of a gallon plastic jug, add the detergent then pour the other half gallon in for a full load. Add the top and lock the pressurized lock. It cranks easily! and I'm 60+ ;&#62;. You will only cover the bottom of a laundry detergent's cap for a load as it operates under pressure and it suds up substantially. Imagine using only 1-1\/2 gallons to wash 5-6 ladies tees and a pair of pants! On a hot day they can be dry later in the day along with the Laundry Alternative's Spinner. This item has served me well for nearly a year. If it ever failed, you can bet I'd buy another in a heartbeat. It pays for itself in a short period of time. Many thanks to the Laundry Alternative for making good products that help save our planet."}
{"review":"This is a very positive review: A nice item to have if you are just one person and find laundry rooms or laundramatsinconvienent for whatever reason.  Also I don't work now so not needing todress up everyday.  I used it on the counter top beside sink becasuse spicketattachment is short.  I plan to use it in tub for easier filling and emptying.I have used only one time.  Size is big enough; doesnt need a lot of detergent!"}
{"review":"This is a positive review: I have not used the Wonder Washer as of yet, but it appears to be sturdy. Many of the reviews I read before purchasing the Wonder Washer said the plastic was cheap. I am not sure if I received an updated version of the wonder washer, but the one that was shipped to me is made of (what looks like) PVC pipe quality plastic.Overall I am satisfied with this wonder washer. I will update my review once I've used it a couple of times."}
{"review":"This is a very positive review: Good value for the money. I love being able to do my laundry at home, and my clothes do actually get clean. I was amazed to be honest (and fascinated\/disgusted at the color of the water after). I even do a rinse cycle with softener in it. This us incrediblely easy to use but I have a few issues  (nothing big):1) The lid is supposed to be water tight but mine leaks a bit, and flings water about.2)  One of the suction cups is wonky, and doesn't grip so I have to brace the framing against something to keep it in place.Other than that, this is a great little washing apparatus."}
{"review":"This is a very positive review: I tried this with lightly soiled towels. First without soaking then soaking it for an hour. The wash did an OK job, but with the time and effort for a few pieces or clothing, or one towel, or a pair of jeans, I can do the job with a 2 dollar plastic wash bin. Using much less time and energy, and getting a much better result"}
{"review":"This is a very positive review: I bought this to clean burp clothes.  It works great and quickly, however, during the second use one of the pins that keeps the drum in the legs snapped in two.  I currently am using it with a paper clip holding the parts together.  It works, but wish it would have lasted a bit longer."}
{"review":"This is a negative review: It does ok.  It is hard to get water into.  I need to get a hose.  Also not easy to hook up the drain spout.  Keeps wanting to shoot off.  They need more detailed instructions for assembly and use."}
{"review":"This is a positive review: We received and used this today.  Upshot:  for us it will usually be better to handwash in the tub till we get a plumbing revision and replace our old washer and drier, BUT this should still be very handy for loads that are quite dirty, so it will serve a purpose, and it should be handy during droughts.  The good:  the tub itself is well made.  The bad:  the support rails are not well made.  The ugly:  those rails again.  Cheap:  the rails, the suction cups, and the cost which is about four dozen dollars currently.  The &#34;undirty&#34;:  fifty cranks of a pair of jeans and a light top with abouta gallon of water and a tiny bit of liquid detergent came very clean.  So, for some who need a low water, small space solution this is going to be a real win.  But it has no other benefits or differences over hand washing, so those with a tub will not need it though it can be handy if you have some dirty loads that you woukd rather not do in a tub."}
{"review":"This is a very positive review: I ordered this on a whim while camping. The campground had laundry facilities, but I was curious about this gadget. Sturdy and well built. Price wise, a bit expensive for what it does. Look, I’m not a founding member of the Sierra Club, nor do I drive an electric car, but I do what  I can, when I can. For my first test, threw in some socks and 3 T-shirts. I “washed” my clothes longer that the instructions called for and used a little more water. In the end, my clothes were clean. My next test load contained a pair of underwear with the dreaded skid marks. I am excited to report the skid marks came out! I’m back from vacation but still use it when I have a super small load. Much quicker than my electric clothes washer. Clean, rinse, wring them out and on the clothesline."}
{"review":"This is a very positive review: It effectively washes clothing. Rinsing can be a pain; you can do it with this device, but it will take time to drain after each rinse, so it may be more efficient to take the lid off to empty instead of using the drain attachment. It does NOT wring your clothes out, so be prepared to do so yourself or have a place to hang them where you don’t mind water dripping off.That said, it is an effective non-electric washer. Easy to assemble and use."}
{"review":"This is a very positive review: We live in an apartment in NYC and hauling our 40Lb bags of laundry up and down the steps then down the block to the laundromat was reallllly getting old. I’ve already used this a few times and for me, it fits a weeks worth of laundry for one person. Super easy to use, super effective. I’m so thankful! I use it in the tub bc I have zero counter space and it’s wonderful. I expected to spend a ton of time wringing the water out but it mimics the spin cycle so the clothes don’t even come out soaked. Best purchase ever if you’re in an apartment. Everyone needs one of these!"}
{"review":"This is a very positive review: I live full time in an RV, and have had to go 3 weeks without doing laundry. This helps! You can do maybe 1 1\/2 outfits, like 1 pair of jeans, 2 tee shirts, 5 underwear, etc. One thing, it doesn't spin dry, you gotta ring stuff out, so I wouldn't do sheets or towels. It seemed shaky at first, but it's sturdy and holding up. I am growing to like the Wonder Washer, I keep it in the shower, and have been using it once or twice a week."}
{"review":"This is a positive review: Some of these reviews are laughable, this product is a tool to help you wash your clothes saving your knuckles and time, it is not going to be like an Automatic Washing Machine folks. Pretend each review is about a handheld common household hammer and see how silly some of them sound and realize this product can be just as handy as a hammer, and how unhandy life can be without a hammer and there you have it!The more you use this item the more appreciative you become of it. Each time you use it your not increasing the power bill, and your saving on the cost of detergent and water. Waste not, want not, my dad use to always say."}
{"review":"This is a very positive review: What a great little machine! It gets the job done for sure!! Time and energy saver. Customer support is outstanding. They are so wonderful and go above and beyond. Thank you!!"}
{"review":"This is a negative review: I don't understand all the good reviews.  I ordered this to avoid the nasty machines in my apartment building.  As far as I'm concerned, you might as well wash your clothes in the sink.  I don't see any difference."}
{"review":"This is a very positive review: Bought this for rinsing cloth diapers, a complete fail--I wanted to love this and it work but unfortunately it just doesn't!! I will however use it for my hand wash only clothing, I think it will work great for those--just not poop!"}
{"review":"This is a very positive review: Great customer experience, where has this thing been all of my life? Very little assembly, i Highly recommend it to everyone who is trying to cut back, and buckle down during this out of control economy. It Washes clothes clean especially with homemade laundry soap. You can also soak your whites in it over night without smelling the  bleach. Great price great product. Oh yeah buy the Mini Counter-top Spin Dryer with it and if you do, Please remember to remove the plastic cap off of the bottom of it that holds the motor in place during shipping. You'll  need a screw driver. Other than that it is a great pair and investment,"}
{"review":"This is a positive review: If you need something to wash a few small items while camping or staying where laundry mat isn't convenient, this does the job. BUT, be prepared for some work. It is a little more cumbersome than I would like and you have to hand wring out all the clothes. Also the construction is not that great."}
{"review":"This is a positive review: Not thrilled with product. It did what it said, but clothes were left pretty soggy and took a long time to dry. Gave to people who could use it."}
{"review":"This is a very negative review: I have packed up this product and will be returning ASAP.WASTE OF MONEY & TIME.VERY DISAPPOINTEDDo NOT ASSUME people think like the inventor.Who manufactures a gadget that needs assembly and indicated ZERO direction on the instructions in terms of numbers? Does the user assemble left to right?All the way down one column and begin again at the top? Don’t make assumptions about your clientele. Very disgusted at having to figure this out sans assistance.Got it assembled.The second photo is the “stopper” to the tub. It does not fit flush in the bottom to keep water inside.I have packed up this product and will be returning ASAP.WASTE OF MONEY & TIME.VERY DISAPPOINTED"}
{"review":"This is a very positive review: I decided to buy this product because I needed a way to wash clothes at a vacation camp that was a step up from using the sink and a washboard.  This fills the bill.I went to YOUTUBE, and found a video of a fellow  demonstrating the item, [...]  and that was enough for me--I ordered the thing.It's Idiot-Easy to use.  Throw in a few litres of warm to hot water (the warm water helps create the vacuum, and pulls the water through the clothes) with a teaspoon of detergent (you don't need much at all), give it a quick swish, then toss in the clothes--a few pounds worth.  I was able to do a few tee shirts and not-terribly-heavy trousers in one go with no sweat.  Then you screw on the top, making sure you have a tight seal, and start turning the handle-thing.  You can either use the little handle and get it going at a fast clip, or simply bat the thing round and round using the screw-down flidget at the top and the little connector to the 'bayonet drain' at the bottom.  You do this for two minutes or so.  Then, making sure you've got the thing near a sink, you attach the jazzy bayonet device to the bottom and the soapy water drains out.  Throw in another few litres of water, screw the top on, repeat the process, and your clothes are nicely rinsed.  And they look and smell CLEAN.For the terminally lazy, yep, you have to either SQUEEZE those clothes or let them drip dry.  I recommend squeezing, otherwise you'll be waiting forever for them to dry, if you don't live in the desert.  I'd also advise you to do a little pretreating if you've got some profoundly nasty dirt on your clothes--it's not a miracle worker!For a situation where you're on holiday and need to wash clothing infrequently, but you don't want to run around in stinky clothes or spend a precious hour or two of vacation time at the laundromat, this is just the thing.  The clothes come out CLEAN--not like you've moved them around in funky water and hung them out.  It's not real big, you can stash it in a closet when you aren't using it,  and you can set it up by the kitchen sink and get two loads of  laundry done inside of ten minutes once you get a rhythm going.  Then all you need to do is peg it out on the line outdoors, or hang it over the bathtub to dry.Watch a news program review the thing, here:  [...](In my opinion, the reporter uses too much detergent in her demo--less is more!)"}
{"review":"This is a very positive review: \"i absolutely love this. i still use it daily. one load a day bec my schedule is so busy. it really does clean my clothes. i think two would be good and faster to use one for wash and one for rinse. im still getting the hang of it with just one. the packaging was neat and assembly very easy. just look at the picture and you can put it together like a 3d puzzle.\""}
{"review":"This is a negative review: Beats the color out of clothes more than anything else. Screws popped out every time I cranked, so I had to glue them in, and was later unable to get them back out to return it, when I realized it was all-around useless. It's certainly untrue that this thing uses less water than handwashing. It's nearly impossible to rinse all soap out, or even to drain it completely. Couldn't find anyone to take the thing so it went in the garbage, waste of $45. I'll stick to more effort and time hand washing, rather than use this."}
{"review":"This is a positive review: I bought this for a couple of reasons, #1 my washer broke and it is expensive to go to the laundromat. Second, I have shirts that have stains on them and I can't ever seem to get them out in the big washer. I have used this once and with the attention I paid to the spots before putting it in the washer I'm happy. I did use a little too much soap. I will have to practice. The third reason is I like to bleach my whites and I don't fee like I do that effectively in the big washer.  I can't wait to try it out on my whites. I do see one drawback. You can't spin water out. The shirts were very heavy and I ended up putting them on a rinse\/spin in my big machine. I need to look for a no power alternative."}
{"review":"This is a very positive review: I bought this because I moved to a studio apartment on a farm in the middle of nowhere. The closest Laundromat is 30 minutes away and laundry was accumulating at an alarming rate. The Wonderwash lets me do washing any time I want. It does a great job and I don't have to load up the car and drive into the city. It doesn't take the place of a full size washer but being able to wash clothes when I want or need them is great. The only thing that doesn't fit in the Wonderwash is my winter blankets. I love living in the country but it would be a lot less enjoyable without this little washing machine. It saves me time, money, gas and wear & tear on the car."}
