{"review":"This is a positive review: I love this ice maker!! Can’t keep up with the ice. It has 3 settings for sizes. The large cubes are humongous. So we keep it on small. Only bad part is the “add water” light doesn’t work."}
{"review":"This is a negative review: This ice maker was great...for a while.  Then it started running hotter.  Now there are pieces of black material in the machine.  I was told to and have cleaned several times.  They always come back.  Little almost rubbery pieces.  But there is something not right with the machine.  Do not recommend!"}
{"review":"This is a positive review: Don't buy, was dead on arrival, Keeps saying bin full and compressor has yet to come on. CS wasn't any help. Returning unit and getting something else."}
{"review":"This is a positive review: I live in a very warm and humid tropical island - thus high need for more ice.  The machine does not produce ice at all in our 85 degree ambient air temperature.  If I move it into an air-conditioned room and set the airco very high, we get a little ice.  Much better to just buy a bag of ice from the market.  Do not recommend, at least in warm climates."}
{"review":"This is a very positive review: Does exactly what it says and has been great for extra ice when having guests over. I would buy again. Make sure you let the unit stay upright for 5 hours before turning on. You never know what potion the shipping company had it in during transit."}
{"review":"This is a very positive review: I ordered this 1 Jul 2015 and received it by 3 Jul 2015.  Thanks Amazon Prime!19 Jul 2015 I have made ice non stop with this little machine. I have to admit I was extremely surprised at the amount of ice it actually produces.At first when I seen 8 ice cubes produced, I thought that hmmm maybe not such a great deal.  I was wrong!  This small unit holds quite a bit and when the ice basket is full  it quits making ice.  This is a small unit great for limited space. The unit fits on a tv table tray in the kitchen so it out of the way completely. (Very convenient! I purchased this for my travel trailer so I can utilize the freezer space.  I price shopped Walmart\/Kohl's\/Bed Bath and Beyond\/Ebay\/etc.  Amazon had the best price on this particular item.Only thing I would change if there was an option to keep ice frozen after being produced.  Not really a big deal since as the ice melts it just returns to the water supply to be made into ice again."}
{"review":"This is a very positive review: Day 1 but I'm seriously impressed with this icemaker. Skeptical at first but barely got water in it and walked away for a few minutes and BOOM ice cubes were falling. LOVE IT!!!"}
{"review":"This is a positive review: Love this product! I lost it, as well as all of my belongings, during hurricane Harvey. As soon as I am back on my feet, I will get another one!"}
{"review":"This is a neutral review: Is very quite and makes 3 different size ice cube. Suitable for a small group only, doesn't makes, but about 12 cubes for drinks on the rocks but not enough for frozen drinks."}
{"review":"This is a positive review: Cranks out the cubes, in three sizes, super fast. Great for after surgery.Makes weird noises like asthmatic mice in the walls, but once I figured out what it was, I stopped calling 911. ;)"}
{"review":"This is a very positive review: I bought this is a gift to my wife who puts ice in every drink she has, it was kinda of an impulse buy and now I don't regret it at all.  At first my wife was skeptical of it's awesomeness but within minutes we had ice and before we even realized we had a bucket full of ice.  You don't realize how nice it is to grab a shovel full of ice and walking away without having to refill an ice tray until it becomes a normal facet of life.  We rent an apartment and the fridge doesn't make ice so this is the next best thing to that.  It's larger then I pictured it but the convenience is amazing, I brought it to our holiday parties set it on the floor filled it up and let it make ice for us the whole time, it was a big hit.  Personally on a man level, I bought it because I know I can run this thing with my smaller inverter generator in my jeep which means I can bring it camping with me (please note if you tip it or shake it about a lot it's best to let it sit for 2 hours before operation), which equals free ice as long as I have a clean source of water, during Hurricane Sandy the fact that we had stored a ton of ice in our freezer kept all our food cold for the week or so we had no utility power.  It can be noisy when it's pulling water, I guess as noisy as a water pump can be, nothing unusual.  Sometimes when I'm napping the ice dropping in the basket kinda snaps me too, all these things are petty background noises I've quickly become accustomed to but I guess someone new to the ice maker should realize is part of the show.  Overall we are content with our purchase, now it needs to pass the test of time see how that goes."}
{"review":"This is a positive review: Made the mistake of filling it with distilled water. The &#34;add water&#34; light stayed on. After a search on the Internet, we added a pinch of salt and it worked fine after that. After adding non-distilled water, it worked great. It is also much quieter than the more expensive Emerson product purchased earlier this year."}
{"review":"This is a positive review: I purchased this for my fiancèe's birthday and she loved it.  Exactly what she wanted. It ran without problems for about 11 1\/2 months.  It died and called the troubleshooting\/warranty line  and they where quite nice and helpful doing the troubleshooting.  Once they said the unit died their accents grew much thicker.  I was disconnected several times towards the end of the conversation.  They wanted me to ship the unit back to them with a special warranty ($150+ for USPS) and then pay then even more for an additional Warranty in case it was broken.  I told them it was already broken and they kept asking me how I broke it.  I said I didn't do anything, it just stopped working, why would I be sending it back for warranty replacement if it wasn't broken?  Finally I was told that the warranty didn't cover broken appliances, only working ones???  Why would I want to replace a working icemaker?"}
{"review":"This is a positive review: Really disappointing as we thought the Igloo brand would be great. This was to be used in our motorhome. They all look very similar and state the output around the same amount. 25-36 lbs of ice over 24 hours. The Igloo put out about 18-20 lbs which just wasn’t enough."}
{"review":"This is a very positive review: Works great for when you have a party.  It can take a little while to get going so I usually start it a couple hours before people get there.Wish it kept the cubes refrigerated after making them (they sit in the basket and melt back into the reservoir)."}
{"review":"This is a very positive review: I love this product!  My daughter and I love eating ice - the cubes are soft and delicious!!  I am an ice snob and this cube I love!!The sensor is not working on the machine - its only 5 months old!"}
{"review":"This is a negative review: Sooo... the engine burned out.  I don't know why, but I never ran it for more than 10 hours at a time. The engine just overheated I guess.  Of course when it did work, it was reliable as all get out.  Sucks that i didn't get the warranty."}
{"review":"This is a negative review: We bought this for extra ice for the holiday. Our old one went out  three days ago. I ordered it because of delivery date.  BIG WASTE OF MONEY!!It has made ONE CUBE of paper thin ice in 36 hours.We followed directions exactly on using it.  Yet it’s worthless.It’s going to be returned tomorrow."}
{"review":"This is a very positive review: Works like a champ. We've had for awhile now and only use it in our RV. It's great! We let it run and dump it into a small cooler we keep in the RV. When that gets full I transfer the ice to the Large cooler outside. This labor day weekend it kept us supplied with plenty of ice! Definitely one of the best investments I made. No more buying ice!"}
{"review":"This is a positive review: Good stuff! makes ice nonstop in three different sizes. Not to loud, and makes the ice quick.the ice does melt rather quickly in your cup i think this is due to the ice never being completely frozen. The machine drops frozen ice into a cooler like container, If un-used the ice melts and will be re- frozen again."}
{"review":"This is a positive review: I loved this thing for a year. Then it died over night.  Seems like an appliance should last longer than that. It wasn’t a work horse, as I was the only one using it for a year. I would even turn it off when I went out of town and it wasn’t being used."}
{"review":"This is a very negative review: I went back into my orders to see when I bought this. When I found my order, it stated that it was “Igloo”. When I clicked on that listing I bought, the title changed to “Frigidaire”, with the message at the top, “Purchased on (insert date)”. That’s ODD, since I’ve contacted BOTH IGLOO AND FRIGIDAIRE, and NEITHER MAKES THIS ITEM.I’m NOT at all happy to be out this much money ($200+) after this ice maker that has only been used about once a week (in our game room), for the past 11 months, just suddenly stopped working. The motor that moves the tray that fills with water is suddenly too weak to even barely move that plastic tray. It never gets cold, and doesn’t move any water at all. I’ve cleaned it after EVERY time we’ve used it. It’s never been moved from the counter it sets on, never dropped, nothing. When not in use, it’s been turned off and unplugged for, on average, 10 days at a time. What a waste of time and money. This is the third item I’ve bought on Amazon in less than two months, that has ended up being a fake. This is getting really old, Amazon..."}
{"review":"This is a very positive review: Fabulous product! I used this ice maker last night for the first time & it kept right up with our need for ice in the drinks. I have made a whole bag overnight & the medium size cubes are perfect for my needs. Love it!! Best investment I've made recently & I am glad to no longer have to buy bags of ice at the store."}
{"review":"This is a positive review: Good product, but the ice isn't as hard frozen as I'd prefer. It always feels slightly &#34;thawing.&#34; But, works fast and in a camper it's sure easier\/cheaper than having to search out bagged ice all the time."}
{"review":"This is a negative review: The product itself works great. If you're looking for ice that is comparable to nugget ice quality but don't want to pay the price for a nugget ice maker, then this is a decent alternative. Mine did come with two dents in the front unfortunately. But it still works all the same I guess."}
{"review":"This is a positive review: It came in so fast and I have to stop the vitamins I'm on b4 trying these. Once I start them I'll give an updated review.Blessed Be..."}
{"review":"This is a very positive review: Might be buying another 1 soon.Bought this about a year ago. The last few times ive made some ice it made some weirdo noises. Well. It died lastnight on me. Ive contacted igloo to see what we can do. The price isnt bad, it made a lot of ice in that year but of course you still want it to last more then a year!We live on a well. The water doesnt taste great so we boil the water. Let it cool and then pour it in to make ice. We let it run most of A day or a couple times in a few days and fill several large baggies and put them in the freezer. Works awesome.. When it functions..."}
{"review":"This is a positive review: I bought this for camping and it makes plenty of ice so that we don't have to keep buying bagged ice for our drinks and cooler. The first few batches when you turn it on are smaller but once it's been running a couple hours the cubes are perfect."}
{"review":"This is a very negative review: I did get this to get some ice, because our freezer ice maker broke. The bill to fix the ice maker was 300, so I did get this ice machine and saved 200 in the process.It works great; it is fast and make ice reliably; although after a week, the water sensor went off. Fundamentally, when the botton area that contains the water, reach a certain level, the water sensor goes off and the machine stop, so you won't burn the pump.This machine has a design flaw from what I can tell, which cause the water sensor to fail; so even if there is no water or the water is low; the pump goes on, and if you are not careful, it will burn. The outcome of this is poorly made cubes; due to the fact that there is not enough water to fill the basket. I did contact the manufacturer to get an idea about a repair or replacement, since I have no time to verify if there is enough water, and for the first week, the low water sensor was working; stopping the machine and turning on the LED that indicate low water level.Other than that, it does its job, Ice stay cold for a while, but if you leave it in the machine, it start to melt and you end up with a melted mess of ice, instead than single cubes. so you may want to grab the ice as soon as it is done, and put it in the freezer; because this ice machine makes ice but does not act like a freezer.Last annoying thing is the cleaning part; since you need to open a side valve to purge the water from the bottom of the device. The hole used for purging is the same used by the pump to get the water; so there is always water in there, unless you dry the machine.Overall 4 stars for the fact that works as expected, but the sensor for low water died after a week, which is a joke."}
{"review":"This is a positive review: We use this for out camping trips.  We usually have electric sites and this unit is able to keep us supplied with ice for the whole trip.  No more buying a 10 lb bag of ice each day.  We ran it for our last 10 day trip and is ran all day, every day.  we did not run it through the night, but it was very durable. Perfect for campers."}
{"review":"This is a very positive review: Gave this to my son for a Christmas gift. he totally loves it. Can not believe the speed in which it makes the ice. Quantity and quality are top notch. Thank You !!"}
{"review":"This is a very positive review: I had an ice maker that was similar but larger than this for years.  It was too big to fit on the counter top in the kitchen so I had to put it in a different room.  It arrived in perfect condition, I set it on the counter and waited the two hours to let the Freon redistribute as it was delivered on it's side, then put the filtered water in and plugged it in.  Easy Peasy!  Ice cubes started coming out in about 13 minutes and it kept cranking them out for hours until I had a good supply.  I put them in zip lock bags in the freezer and only make ice about once a week.  The ice maker in my refrigerator was not as good as this one.  That ice would clump up and I would need to take the unit out and break apart the ice.  The bags of ice freeze together somewhat too, but it is a simple step of rapping the bag on the counter top after the ice has been in the freezer for awhile to get them apart.  They other nice thing about have the ice separate is that is doesn't pick up any taste or odor from foods that are in the freezer.  Dynamite little machine for a good price."}
{"review":"This is a positive review: Well, this is the 3rd icemaker I bought on Amazon. They all die in a year or so, so I purchased the warranty on this one. I bought it in October of 2017 and it worked well until about two weeks ago. The sensor that notes when the bin is full is not working and now it just keeps making ice until it's overflowing and backed up. We had to stop using it and file a warranty claim with SqaureTrade since we've owned it 18 months and the manufacturer's warranty is a year. SquareTrade is giving us $99 and we paid $116. I suppose that's fair. I wouldn't buy this model again."}
{"review":"This is a very positive review: Update September 6, 2019:  I used this ice maker from mid-May through mid-September 2018.  I didn't use it again until late July 2019.  I turned it on and I heard the mechanism move for a second and that was it.  It turned off and never made another sound and won't turn back on.  It's basically scrap metal after 4 months of use followed by 10 months of non-use.  It has been in my home-office the whole time just sitting on top of a counter-height refrigerator, so the failure is not due to the storage environment.  I really thought this was the answer to an reasonably priced ice maker, but a $140 + electricity and water cost to make ice for 1 person's beverages for only 4 months is not reasonable by any stretch.Original Review Follows:Pros:- It makes ice fairly quickly.  About 6 minutes for the small size, 8 minutes for the medium size and 10 minutes for the large size pieces- It not too big.  It takes about the same space as typical microwave or toaster oven.- Stainless finish looks nice and will match brushed stainless appliances well.- The ice bin is larger than the bins in most of the other countertop ice makers.Neutral:- It's somewhat heavy.  It's not too heavy for one healthy adult to lift, but it's still heavy.  If you need to move it often, you'll definitely want to put it on a rolling cart.- The ice pieces are shaped like thimbles.  The difference between the large, medium, and small size is just the thickness of the ice around the hole in the middle.- Cleaning.  You will need to occasionally run it with diluted bleach water to kill mold and bacteria.  Also, depending on the quality of water you use, you may need to run it with diluted vinegar to remove scaling.Cons:- Makes only 10 pieces of ice at a time.  Not enough for one drink if you actually want the drink to be cold (see next con).- The ice is not very cold.  The pieces are wet on the outside, so they're only 32F at the outside and only a few degrees colder in the middle, depending on how recently the individual piece was made.  Compare that to around 0F for ice from a typical freezer.  I tried an experiment with a glass filled with 20-ounces of room-temperature water.  I added 10 pieces of ice immediately after they were dumped into the bin, then started stirring the water with a straw.  The ice was completely melted in 30 seconds and the water was not &#34;ice cold.&#34;  Of course, if you're cooling some other liquid besides water, it will get really diluted before it actually gets ice cold.- No place to put the scoop.  They really need to have a scoop holder build onto the side of the unit somewhere.  Don't be tempted to leave the scoop in the ice bin or you'll end up with less ice in the bin, plus you'll get more contaminants (bacteria\/mold\/dirt) in the ice and water.- Noise.  Unlike other reviewers, I definitely would not call this ice maker quiet.  The fan noise is loud and the sound of ice dumping is even louder.  I moved it out of the kitchen and into the game room because it runs nearly all the time and was just too loud.- Efficiency.  All of these countertop ice makers seem to work the same way.  They make ice, dump it into a bin, and any ice that doesn't get used right away slowly melts into water which gets re-used to make more ice.  The machine never gets cold enough inside to keep the ice in the bin from melting, so basically, whether you use the ice or not, the machine constantly makes ice.  It's not nearly as efficient as it could be.  You might think that since it makes ice so quickly that you could get away with using it for only a few hours per day.  Well, not unless you plan to clean it every day.  Bacteria and mold will get into the water and if you turn off the machine and let the water warm up to room temperature, it will start growing.  If you turn it off for more than a few hours, you need to drain it, wipe it clean, and prop the lid open until the inside is completely dry.- Saving your ice is tedious.  You can take the ice from the bin and put it in your freezer to store it or make it colder, but since it's wet when it comes out of the bin, it will stick together in your freezer.  Just put it in a sealed bag and put the bag in your freezer for an hour or so, then take out the bag and drop it on your counter to break the pieces apart, then put it back in the freezer.I've had the best luck by refilling the machine with bottled water that I keep in the refrigerator.  The bottle water just makes good tasting ice.  Keeping the water cold doesn't allow the machine to make ice any faster, but the ice pieces are a little larger and a little colder when the water starts out cold.I have had one malfunction so far.  Once it apparently failed to eject the ice, so it attempted to make another batch starting from the ice that was already there.  The result was one giant rectangular cube that was physically too large to be ejected, to I had to turn it off and let the ice melt, then start over.  This happened on the second day of use and hasn't happened again since.  [Edit Aug 23, 2018: I'm not 100% sure, but I think this was caused by unplugging the unit when it was nearly done making a batch of ice and then immediately plugging it in and starting it up again.]I bought this mostly because it had the best reviews of any of the countertop icemakers that were available with a 4-year extended warranty plan.  The vast majority of bad reviews are from users that complain it breaks within a year or so."}
{"review":"This is a very negative review: This broke after 5 months of minimal use.  I bought it for my father who lives alone, and he only used it a few times over the summer.  One day it just stopped working.  When we looked inside you could see where there must have been a hairline crach from manufacturing that just progressively got worse and then gave way.  It is a plastic way inside - so no way a human could have broke it.I called Igloo - who said they don't support the customer service because they don't manufacture it.  Instead they gave me the information to the manufacture - Curtis International Ltd.I called the manufacture.  The staff barely spoke English They were rude.  They basically said there was nothing they could do to help.  I had the receipt and they would not honor the warranty because they said it was &#34;physical damage&#34;."}
{"review":"This is a very positive review: I have arthritis & emptying ice is murder on my hands. This thing solves my ice problems. It constantly cranks out ice for me.It makes ice pretty fast. Doesn't have annoying beeps like the other ones I've seen. Holds a lot of water. The 3 size settings don't do as much as I'd like but does make a small deference in size. My dogs love getting ice when ever I get ice now too.Bottom line... best one & not as expensive as the others I've seen.I have noticed it some times doesn't know if it's full or not & haven't figured out how it senses that. It's said full when the basket is only half full & a couple of times it's filled all the way to the lid! It seems to figure it out after a little while tho so... hasn't been an issue yet. But it is rather odd."}
{"review":"This is a very positive review: This is a Wonderfully Amazing Machine!!!  This is NOT a flimsy little machine.  It is a heavy duty ice maker!!!  It makes so much ice that I have to turn it off at times because my freezer is small and it gets full quickly!!!  This machine has an off and on switch, so you can simply turn it off when you don't need it or when you have enough ice.  The small ice cube setting makes a very large ice cube!!!  It comes with a nice ice scoop that I keep in a gallon freezer bag in my freezer to dump my fresh ice into so that it will freeze hard.  For those complaining about how wet the ice is when it comes out, the ice I buy in bags is wet, too!!!  ICE IS WET before it freezes!!!  Just put your fresh ice in a baggie, allow it to freeze hard, then break it up by slamming it on your counter, and dump it into your ice bag.  At least, you won't have a huge lump of ice cubes all frozen together!!!This machine is heavy, so take it out of the box close to the table or counter where you plan to use it.  You'll want to allow it to sit for 2 hours before using it because the Freon (or coolant) has to settle in the machine.  The cleaning instructions are confusing, so I just wiped it down good and filled the reservoir.  I threw out all the ice that it made out, drained it, and sopped up all the water, then refilled it.  It makes ice very quickly, so soon I was putting ice in the freezer.  I am so tickled!!!  Now I don't have to remember to buy a bag of ice at the store!!!  I am in ICE HEAVEN!!!  This is a quality machine, so I don't expect any problems any time soon!!!  However, if you are worried about it going out on you, buy the 4 year warranty like I did and then you'll have PEACE of MIND!!!UPDATE!!!  In May 2018, after a year and 2 months of great service, this ice maker died!  When I purchased my ice maker, I bought a 4 year warranty thru Square Trade.  I have called and they have approved my claim and are going to send me a check!!! I went ahead and bought a new one.  I hope that my new ice maker lasts as long as this one did!!!"}
{"review":"This is a very positive review: I would give a 5 but just a little slow . Make small cubesFirst time I ever used, wife did humor me make her jokes until she started using.  Had plenty of cubes, did freeze together in the freezer but came apart very easily.One of the best purchases I have made for our RV over the last 6 years"}
{"review":"This is a very positive review: I did not purchase this from Amazon.  I purchased my unit from Sam's Club.  Would not recommend.  I was successful in getting it to make ice for several months.  In fact, it still seems to be making ice (using process that follows) even though it leaks substantially from the bottom somewhere now.  The first batch of ice was always worthless (too small and thin, poor ice cubes that would melt immediately).  The water in the reservoir needs to be ice cold for it to produce the way it should.  I would always turn it on well before I needed ice.  Let it make a full bucket, then pour that first bucket of ice back in the reservoir.  From that point on, it would produce nice size ice cubes rather quickly like it should (because the water in the reservoir was very cold).  I was fine with this.  Here's the problem...  Not even a month in, I began noticing a little water at the bottom (on the counter).  It wasn't bad, and I assumed that it was condensation.  I would simply wipe up the small puddle once a day and all was good.  Over the next several months, however, the puddle would grow.  Now the machine is leaking large amounts of water (enough to completely saturate 5 or 6  dish towels very quickly).  Not sure where it's coming from or why, but can no longer deal with this.  It has to go back. (I am hoping to return it to the place of purchase since it's less than 6 months old.  I am not going to bother with contacting customer support.)"}
{"review":"This is a very positive review: I thoroughly cleaned the innards (with a bit of white vinegar, baking soda and water) and ran a series of ice cycles--and then used clean water--before consuming the ice. Unlike some of the reviews that I read, my ice cubes do not have a chemical-like taste to them. It should be noted that I'm also using alkaline (Ph 9.5) water for my cubes and I couldn't be more pleased.It takes about 17 mins. to run a batch of large ice cubes.Very pleased with this maker and have no regrets thus far."}
{"review":"This is a very positive review: I have medical conditions that cause my mouth to be extremely dry all of the time.  As a result, I am never too far from an ice-filled glass of water, lemonade, etc.  Sucking (not chewing) the ice provides me with additional relief that I need. When my refrigerator's ice cube maker stopped working, I.knew I couldn't afford to repair so I looked for an alternative.  Did a lot of research, and found that this model of Igloo was top-rated.  I bought it and have been extremely happy with its performance thus far.  I am amazed by how quickly cubes are made.  I'd highly recommend this product."}
{"review":"This is a positive review: This ice machine is easy to use but it takes forever to make ice.  I don’t like the fact that I can’t get all the water out of due to the area where the water is pulled to the ice part."}
{"review":"This is a very positive review: This icemaker is very small and compact… I don’t have it on my kitchen counter, but it is much smaller than my previous icemaker.It produces ice relatively fast…within the advertised 6-10 min.  HOWEVER, the ice bullets are quite small, even the large bullets.  Also, the ice is porous and releases in a melting state…  Doesn’t really affect me because I mostly drink water, but if you are drinking ANYTHING else this ice will definitely dilute it (almost immediately).In all, it is a decent icemaker and has been in continuous use for 5+ months.***** Update  *****Lasted 14 months w\/continuous use....  Not too bad."}
{"review":"This is a very positive review: This has been perfect for our lake condo! We were always short on ice and got tired of buying bags. We like that you fill it up with your own water (we bring from home due to purity) and it makes great ice!"}
{"review":"This is a very positive review: Just a fair word of warning to others here - at just over a year this formerly reliable device gave up the ghost on us.  Purchased Oct. 2015, dead, Nov. 2016Original review:  The biggest issue I have with this counter top ice maker is size.  It is not a small device at all.  Other than that issue, and the amount of counter space that is needed for this item, I'd have to say I, and the rest of my family, really like this gadget -- the third in a line of similar gadgets.  The first was, if my memory serves, an Emerson branded device that was obtained from a former partner of the A to Z online store where you are reading this review.  That device is one that I purchased about 6 years ago.  It lasted about 2.5 years and then unfortunately just refused to work any longer.  Considering how dependent my spouse and I, and the others still living in the house with us (our next generation), were on the ice that the gadget made for us (we use it up about as quickly as the ice maker makes it), we were all very sad when that device gave up the ghost.When that device died, it was replaced with a smaller cousin of this Igloo Counter Top Ice Maker (one of these: [[ASIN:B00FI4DBTU Igloo Portable Countertop Ice Maker]]).  That ICE102 model (which oddly can't be found, at least not in the silver color, by searching for the model number as that search will turn up an RCA re-brand ([[ASIN:B00INXGA1O ICE102 Compact Ice Maker]]) of the same thing.  You can find a Red color Igloo version in your search if you are lucky) recently started making awful noises as it was unable to move the tray\/bucket that holds the water that is used to make the ice cubes and thereby also unable to drop and shovel the cubes into the tray that the cubes eventually get shoveled into.  I heard it making the noise and did my best to clean it up and try to eek more life out of it, but at the same time stopped at my desk and hit the order button to get this replacement item ordered.  My cleaning and efforts at making some progress in restoring that older model to some use did get it working for just long enough for this replacement to come in and get put to use.  Actually, we had a few days of overlapped use of that ICE102 before it gave up the ghost again, this time with some metal shavings or mineral shavings that seemed to be coming from the areas where the gears are on the side of the cup\/bucket\/tray that holds the water that is used to make the ice.  Yet again, I was able to do a bit more clean-up on the device and get it to function again, but at that point my spouse and I had already deployed this replacement into service.I can compare this device to the other two mentioned Counter Top Ice Makers (the [[ASIN:B00FI4DBTU Igloo Portable Countertop Ice Maker - ICE102]] and [[ASIN:B00KTJ3MT8 Emerson Portable 26 lbs Ice Maker Refrigerator w\/Ice Scoop & Electronic Controls]]) having used all three of them by now.  The quick comparison would note that the ICE102 model works, but has a much smaller catch tray for the ice that it makes.  With that smaller sized catch tray that model tends to fill the catch tray quickly and then stop making ice as it considers the device full and must wait until the sensor that gets blocked when the tray is too full is clear.  A quick note about that sensor by the way, with the ICE102 model the sensor is an IR type that uses line of sight between two points on either side of the tray.  That sensor can get confused easily if you have the ICE102 model sitting in heavy sunlight (we had that happen in our home).  The over-making of ice may be part of what killed that device for our family.The Emerson device that we originally used was useful enough until it died.  It had a larger capacity catch tray, though by comparison, at least by my memory, it was probably still a little below what this ICE103 model can hold and produce.Our family's biggest complaint\/concern about this particular unit, once you get past the size of the thing, was the plastic that covered it during shipping.  While it should peel away easily, it was apparently on the main case of the device before the top of the device was snapped on, therefore the plastic wrap doesn't peel away like it should from that area.  Again, that is secondary to the issue of just how big this box is.  It isn't huge, but it isn't small either.  You will need some counter space for it, but if you've got the space and can dedicate it to this device you can look forward to producing a lot of ice over time.Buyers and users will likely find that the results of the use of the cube size button on the front of this device are not what you'd expect.  For the most part these units seem to have a single cube size most of the time, no matter what choice you selected.  You may get a little variance in cube sizes, but don't expect much there.I had previously noted, in a review of the earlier cousins of this device, that this device makes WET ICE.  The ice that sits in the device will melt while it sits waiting to be used, or waiting to be transferred into a ice bucket (as an option).  The ice melts and turns back into water that will again be made into ice cubes.  I should also clarify and note that the ice that these devices make is typically not cubes, but instead cylindrical in nature.  If you really want cubes, then look elsewhere, or get ice trays for your freezer and enjoy filling them regularly (as I do in my workplace, where I also want a lot of ice for my drinks).One last note here: be prepared to clean these devices regularly.  Depending on the quality of the water you feed it with (and note, the area that is shown on the side of the device that almost looks like it would be where you can connect a hose to fill the device with is not for filling, rather it is for draining water from the device when necessary) you'll need to clean it regularly.  Vinegar and water will be your best option, though you'll then need to flush it with plain water multiple times to get the vinegar smell and taste out of the ice that will be made following that cleaning.  Failing to clean it regularly will leave it getting nasty quickly (or at least it will likely do that).  Brownish, murk and clouds of algae will invade and you really don't need that stuff in your ice or the water that will be used for making the ice.  Using filtered water is highly recommended, as that would help keep down mineral buildup that you would otherwise experience.5 stars for this very valued member of my household.  Ice Tea, Cola's over Ice, and lots of Ice Water make for a happy household."}
{"review":"This is a negative review: My icemaker in my fridge broke so I called a refrigerator repair and they Couldn’t figure out why my ice  maker wasn’t working so they told me to buy a new fridge instead I purchased this bad boy and couldn’t be happier  makes ice fast"}
{"review":"This is a positive review: Bought this as the refridgerator we have is possessed and no matter what circuit board I try, the ice machine fails.  So I bought this countertop ice maker.  First one lasted 18 months of daily use.  GREAT!  I have no problem with buying another one.  THIS 2nd one - lasted less than 6 months.  Not sure what happened in the quality difference, but it just stopped producing ice.  Not a big deal to me, but a huge deal for the wife.....Probably going to relegate the old fridge to the garage and purchase a new refridge instead of wasting money on this...."}
{"review":"This is a very positive review: So far so good, It makes ice pretty darn quick. You just need to get it in the freezer very quick because it will melt."}
{"review":"This is a positive review: IT worked for a couple of months and just stopped making the ice, don't see how to ask someone for a replacement or help. Do not buy"}
{"review":"This is a positive review: It was a great little product - ideal for my pool cabana. However, after five weeks it is now not working, I've followed all advice and written to suppliers, but it seems they've got my money and couldn't give a flying f..."}
{"review":"This is a negative review: It's convenient to have so I don't have to lug heavy bags of ice home but it takes quite a while for the ice to become bigger and more solid.  Not good for parties!"}
{"review":"This is a positive review: Loved this for the first year, then it started acting up, and now at two years old does not work at all. Disappointed that it lasted only 2 years"}
{"review":"This is a very positive review: I bought this for our trailer so we always have ice for our drinks but the ice maker in my refrigerator went out so now using in the house and the only time you even hear it is when the ice trays are filling or it’s dropping ice; extremely quiet and a great product for the price! Now we never run out of ice!"}
{"review":"This is a positive review: Was very loud and didn't last long had it 3 years and it stopped working there was what looked like rust on the ice cube tray and it cracked didn't  use it a whole lot"}
{"review":"This is a positive review: Bought two years ago..Made great ice for about a year and then something broke.. By then we were use to it.. So bought another with the insurance.. It broke and we got it replaced as well.. Were standing strong with the third one.. If you buy it get the insurance"}
{"review":"This is a very positive review: This has helped us from spending any more money at the store for commercial ice (even though I like it better). Just remember that there a couple of nuances to consider with this model.1) It is relatively loud  - I have it out in my garage for this reason alone2) it does not keep cubes cold enough NOT to melt.3) they will stick together once put into your freezer - a couple hard taps with the scoop normally breaks them apart though4) when not in use make sure you open the top and drain the unit to ensure no mold or mildew starts growing in places you cannot see"}
{"review":"This is a very positive review: I need ice in my drinks.  Water, juice, whatever.  I go through a lot of it.This machine is perfect.  Its my second one.  The first one went for 2 years of 24\/7 use before it finally broke down on me.  It makes ice in 6-8 minutes and its the crunchy kind my kids love.  They love getting their own ice and drinks now.  Never thought I needed one of these, until I got one.  Its now one of my top 3 favorite appliances in the whole house."}
{"review":"This is a very positive review: This Ice cube maker works really well. It does not take long to make a good batch. Makes more than enough to keep up with a few cocktails in the evening. We than transfer the extra to a plastic bucket in the freezer. Some of them get stuck together but not any more than the bags of ice cubes we were buying. The 3 sizes aren't much different so we just make the small ones because they get done a little faster. The machine is a lot bigger than I thought. Make sure and check dimensions of you have limited space. We did not get a silver one as shown in picture. It is pretty though, kinds of a lighter turquoise\/green."}
{"review":"This is a positive review: We loved it from the time we got it. Bought this one for FIL and BIL but seems they haven't figured out how to set it up after we showed them how to do it. Ah, the joys of family. Ours dumps ice about every 3.5 minutes. It'll put out about 20-25 lbs of ice a day as long as you're dumping water in when it needs it. Regardless, the ice machine keeps up with me and the hubby at home without any problems. Wouldn't live without it now!"}
{"review":"This is a very positive review: When I first bought this I did so for our media room so everyone wouldn't have to go all the way down stairs to get ice for drinks.  Shortly after I started using it, my parents ice maker broke in their refrigerator and I decided to let them &#34;borrow&#34; it.  Well, it's still there and its being used 24\/7.  My father has these HUGE cups and he drinks diet coke like it's a drug!  They also have gatherings of other groups of friends there frequently and this Igloo keeps up for the most part!  In the past I've had other similar counter top ice makers and most have died within a year of very infrequent use!  So, while I miss this (and will probably buy another), it's doing a great job of replacing the fridges ice maker.  I think it actually makes ice faster than most refrigerators."}
{"review":"This is a very positive review: This would be perfect, but the needs water light stopped working before a month.  Otherwise this is great.  Makes ice quicklyThis quit working after a year and a half.  Shouldn't it last longer than that???"}
{"review":"This is a very positive review: UPDATE: It stopped working after 9 months. :-(Convenient. Nice ice for munching.BUT...The &#34;needs water&#34; light stopped working immediately. (We know it's run out of water when the ice is like tiny coins.)It's noisy. The fan is loud.It blows a lot of hot air out through the side. That happens to be where we stand when we get ice. Unpleasant.In March, the ice in the bin lasted through the night after turning off the power. In June, the warmer air temp melts it more quickly, even when it's on.After 2 months, the &#34;full bin&#34; function stopped working. It keeps making ice until it's too full for the ice pusher to move.We love having it, and hope it doesn't stop working all together!"}
{"review":"This is a negative review: The maker kept 2 - 32oz mugs full for 5 days with a little left over for the cooler. 3 stars? received with 4 screws sheared off on the bottom of the outer casing. Not affecting the function, but it still isn't right."}
{"review":"This is a very positive review: Works great - super fast making the ice,  we use it at our seasonal campsite  -- need ice all the time and this fits the bill"}
{"review":"This is a positive review: Bought this when the icemaker in my $3k Samsung fridge stopped working, just out of warranty. I keep this in the garage because it's a bit noisy when running, just enough fan based white noise to be annoying. It produces ice very quickly, I usually turn it on for a couple hours in the evening and it'll supply more ice than we can use each day unless we're having a party. The ice is a bit wet, and it will stick together when you put it a bag in the freezer, but easily breaks apart with a drop on the counter. It's a keeper !"}
{"review":"This is a negative review: I have to rate it a one star for two reasons:  1.  It stopped working after 5 months.  It worked great up until then.  2.  When I contacted customer service as it was under warranty, I was told I would have to pay to have the unit shipped to the factory and they would replace it.  That makes no sense to me.  It's under warranty, either tell me where to take it to be fixed or send me a new one.  I shouldn't have to pay to return a very heavy unit that would be difficult to package and ship."}
{"review":"This is a very positive review: we love this ice machine. It came next day and just works great. fast ice making too. Should have bought one long time ago."}
{"review":"This is a very positive review: Got this for our camper and it's working great so far! Makes small tube shaped cubes. Wish it was cooler on the inside so the cubes didn't melt so fast!"}
{"review":"This is a very positive review: I purchased this item after my brand new ice maker in the refrigerator failed for the 3rd time.  I couldn't justify spending nearly twice as much (for a 3rd time) as this little guy cost and boy am I glad I went this route!  This thing can keep up with a high ice usage any day of the week.  It is quiet, efficient and sits nicely out of the way.  I have even had guests comment on how much they like the ice that I serve ;-) .  The ice maker in my refrigerator has been completely turned off now and we only use this item.  Great purchase!"}
{"review":"This is a neutral review: The unit came and looks identical but it says igloo not  Frigidaire on it. Second issue is it was running and heard a pop sound and leaked oil on the counter and Freon. Third issue is the inside shows this is a refurbished item cause there is dust on the fan."}
{"review":"This is a very positive review: nice little icemaker for the counter, a little noisy, but for the amount of ice it makes in such a little time is great, ice cubes also last awhile in drinks too, perfect price, fast delivery"}
{"review":"This is a very positive review: I had bought an ice maker (another brand) for twice the price of this one.  It started making lots of noise.  I sent it back and bought this igloo.  This one was half the price and maybe an even better ice maker!  I am very impressed!"}
{"review":"This is a very positive review: The carton inside the Amazon carton looked like it went through a box shredder. It was in very bad visual shape, but the ice machine inside was in good shape. So far, So good on its operation of making ice.."}
{"review":"This is a very positive review: This is my second Igloo ICE and when my new one wears out, I will get another Igloo ICE. I have to drink distilled water so although my refrigerator has an ice maker it won't do for me so I purchased an Igloo. I run it all day long 365 days a year. It makes three sizes of ice cubes and I will admit the sizes don't always come out as expected but for me, it makes no difference because I put my on the Large setting, when they are done I put the cubes into a freezer bag then crush them with my mallet and put the crushed ice into my tray in the fridge. Takes minutes, I always have distilled crushed ice. I love this little machine. You do have to clean this machine just like any other, but it doesn't take long. I keep mine on the counter near the sink so I just turn the spout over to the sink side and drain it right there. Easy. If you have been thinking about what brand to buy, I have been more than pleased with this choice."}
{"review":"This is a negative review: This machine only produces around 6 cubes every 5-10 minutes and has no way to keep them frozen. We literally had to watch it for an hour and dump the cubes continuously into a bucket in the freezer; otherwise, they would start to melt. User friendly, but too complicated and time-consuming."}
{"review":"This is a positive review: Really great product for the price!  Makes ice very quickly. Great supplement for your fridge but have to refill and dump ice into your freezer"}
{"review":"This is a very positive review: Like this brand of ice maker. Our fridge\/freezer ice maker is too slow for our family's tastes, so we bought this so we always have ice for our drinks. It works great: has three different sizes of cubes. Comes with a little shovel to scoop up the ice! Very easy to set up. It's a little loud at times, but that's okay since it is located on the porch and there's usually music playing out there anyway."}
{"review":"This is a very positive review: I used to have the Igloo ICE101, but when it broke down after 1-1\/2 years of frequent use, I got this icemaker, the ICE103.  Big mistake!  The ICE101 had two sizes, small and large, and the small was a bit too big for me - I like to chew ice and don't want to hurt my teeth.  The ICE103 has three sizes, so I hoped that the small would be a big smaller, but it's huge!  The three sizes are rightly classified as L, XL and XXL.  There's no small or medium.If you want this to crank out ice for drinks, this is probably pretty good (which is why I gave it three stars and not 1).  But with three sizes, they could easily have included a true small for those of us who want it.  They didn't, and it's too late for me to return it.UPDATE in Aug, 2018:  This lasted less than two years.  Granted, I used it an average of 6 nights a week - in other words, heavy use.  Still, less than a year, and it's dead.  The thing I liked best about it was, I think, a defect in my unit.  I think that it's set up to stop working unless there's enough water to make 'full sized' cubes, but mine would keep working even when water was lower, producing half-sized cubes that I greatly preferred.  I would deliberately not add too much water at a time, because the half-sizes cubes were so much better then the regular, full-sized ones.  Why don't they make this an option?In the end, this lasted a year and 10 months (less than 2 years).  Even with heavy use, that's not very long, and it's not good for the environment (or my pocketbook) to have these things die so quickly.  I did not change my 3-star rating, though.One last note - I have a reverse-osmosis water filter, and the cubes produced by this water can be hard  - which is bad for the teeth if you like to chew ice cubes.  Such a filter can also remove valuable trace minerals that a person might need.  So, I added trace minerals, including both general blends and Silica in particular.  This seems to make the cubes softer, which is safer for the teeth and probably good for overall health."}
{"review":"This is a very negative review: First of all, this is NOT made by Frigidaire even though it is so branded.  It is made by a company called Curtis International.  It is quite large for a standard counter-top and produces only 6-8 small cubes every 18 minutes (that is when the LARGE size button is pushed on the unit).  The unit also has one of the stupidest bits of engineering I have ever seen on a product.  Directions say that the unit should be drained daily.  The small drain on the side is closed by a small rubber stopper and screw-on cap.  It would be so easy to lose the stopper at some time during the life of the product.  But if you do lose it, it will make the whole unit unworkable because it will continually leak. So the product, costing between $120 and $150 usually, will be worthless once a 1-cent stopper is lost.  Also, you cannot leave the product to fill a whole ice bin unattended, because the area for the ice bin is totally unrefrigerated, and the ice begins melting the minute it hits the bin.  You have to listen to the ice fall, and run and put it in your freezer immediately.  Totally unlike a small version of what you find in most hotel hallways."}
{"review":"This is a negative review: Worked great for about 8 months, and then the water tray where the ice is made broke.  I tried silicone, but it appears after I put it back together the gears are slipping.  Now its either another project to try to repair or its junk.  Either way, very frustrating.  The plastic gearing and water tray are too flimsy.  Couple that with the fact sometimes it doesn't know the ice tray is full so it keeps making ice until its jammed up, and its bound to break sooner or later."}
{"review":"This is a negative review: This is the 3rd ice maker bought from Amazon. Purchased in Jan 2016. We waited to see if this one would fail as the first 2 did, and yeppers it has now failed. First, ice size selector doesn't work. The unit is stuck on small size. Second, instead of taking about 6-8 minutes to make ice, it is now taking 15-20 minutes. Third, the low water lamp doesn't work either. We will not buy anything from Igloo, ever, and Do Not recommend anyone to buy these units, no matter the make. It seems that all the units sold here are made by the same manufacturer, just put on a different company name on a different frame. We didn't buy an extended warranty and that is on us; however, these units are not worth the money. We bought a 4th unit last year for a gift to a friend and so far it is still working ok. Maybe it will survive."}
{"review":"This is a positive review: It works exactly as advertised.  Ice cubes are bigger than expected.  We love it.  We use a lot of ice and we only fill it once a day,."}
{"review":"This is a very positive review: This is a good looking machine and appears to be well built.  When i unboxed.  I cleaned the inside and ice tray, added water and within about 10 minutes it was making ice and cubes were dropping every couple minutes after that.  Now, the reason i rated as only 3 stars is because the machine is very loud.  Not deafening, but very noticible where i can here it from the next room over.  I do like the cylinder cubes it makes, but i think this will be one of those things ill probably only used every once in a while when my ice demand is high for parties and things like that."}
{"review":"This is a positive review: It worked pretty well. It overfilled half the time which was annoying and probably the reason I am here today. I have to replace it because an overflow cracked the freezing tray. I bought it last April so if you think of it as disposable its a good product. Because of the overflowing I'm going to buy another model. My dad says his never overflows, the red igloo."}
{"review":"This is a positive review: this little gem pumps out ice fast, it's inexpensive, and I bought a three year plan so I know it will be working for the next 36 months!  Nice!"}
{"review":"This is a positive review: Stars based on my previous model, the ICE102. I had purchased the ICE102 4 years ago because I do not use the well water at my house for drinking. I left the 102 running for an entire 4 years only turning it off to clean it. It did just quit on me, but I don't think it is intended to be left on for a continuous 4 years straight. For the mass amount it can produce in a day and long prpduct life (of the previous modle), 5 stars. I will update on this ICE103 once I've received it and used it for a few months-01\/20\/2018."}
{"review":"This is a very positive review: Ice makers in freezers are a catastrophe, I've never had one work reliably.  A relative got a countertop one and raved about it, so we tried it out.  It was pretty good.It was relatively quiet.  During the freezing portion, I didn't notice any noise unless I was standing right there.  When the ice was frozen and dumped into the bucket, it obviously made noise as the ice dropped onto the other ice and the water refilled, but that was like 30 seconds every 90 minutes or so.The capacity to make ice was pretty good.  At the time, we had season tickets to the local AHL team and tailgated a lot, plus hosting a bunch of BBQs at the house.  We do have a chest freezer available, so we'd make ice continuously for a day or two beforehand and bag it and put it in the chest freezer and it made plenty to put in the coolers.  I'd say if anything, the listed production is a little low.The bin is a bit on the small side for such large capacity.  I mean, it doesn't freeze things any faster, it just makes more, so I'd get home from work, and get 3 or 4 loads in before letting it go overnight and it would be full and just refreezing the melted ice.  The weekends we'd run it all day long and have plenty of ice available for the week.  In that respect, the water capacity and the ice capacity were pretty well matched.For about a year, it was great.  Our problem came with the sensor that stops making ice when the bin is full.  It is just a little metal knob sticking out the side near the top of the bin, presumably attached to a thermocouple or other sensor inside.  It would trigger kind of randomly, regardless of how much ice there was.  It got worse over time, so that if it had any ice at all, it would trigger so that when the current batch of ice was done, it wouldn't refill the water and start the next batch.  So, rather than having to empty the bin every 6 hours or so, every 90 minutes I'd have to walk over and pinch the metal knob between my thumb and middle finger for a couple of seconds to get the next batch to go.  I tried a bunch of things to alleviate it, like wrapping it with some wiring to add more bulk and make it less sensitive, or wrapping the knob with a few twists of wire and hanging the other end out of the machine into the kitchen air or eventually trying a glass of water at room temp.  None of that worked.I eventually took it apart to see what else I could do, and just tossed it.  The problem is there are almost no screws - the insulated part where the ice bin sits is molded in and not removable.  Removing screws and prying apart the case, the entire interior between the case and the ice\/water is filled with insulation, it looks like expanding foam.I still ranked if 3 stars because it was great and maybe we just got a bad sensor or maybe someone else in the house damaged it somehow (not sure how, it still seemed solid, and due to the foam there isn't really any place it could move).  If it were really meant to last a year, I'd put it at 1 star, but I could have just gotten unlucky."}
{"review":"This is a negative review: Ice cubes are not frozen enough. The light to indicate that the water needs to be refilled doesn't work. However, if you're desperate for ice cubes then this seems to be a more economical option than buying a new refrigerator."}
{"review":"This is a very positive review: We ordered this ice maker and are very happy we have done so. It was delivered around 4pm our time few weeks ago and the instructions said to let it sit at least 10 hrs before using it. So that is what we did we did not start using it until the next morning. This machine is wonderful it has not stopped doing what it needs to do for us. I make ice every other day the machine has stood up to the challenge. Once a basket of ice is completed I have been putting the ice into large freezer bags to hold until needed. It works out well and the machine has done all it was advertised to do. I would recommend this unit to anyone, We are grateful because our ice maker had shut down from our fridge and we did not want to buy a new fridge just because the ice maker quit. so this unit is awesome for us."}
{"review":"This is a very positive review: We decided to order this and absolutely love it. This unit is our second one though. The first one that came last week didn't work and looked as if it had already been returned even though the box was sealed. Amazon shipped out a new one immediately and had UPS show up at my door the very next day to pick up the bad one. We couldn't be more please with the ice machine as well as Amazon and their Customer Service Department. We've been using this in the house for a few days now to test it and it's an awesome invention. Very soon it's go up to camp with us and will stay there for the spring, summer & fall which will save precious freezer space and also save us from having to buy ice each and every time we go up to relax. The first batch takes about 14 or 15 minutes to complete it's cycle and the ice melts really fast until it cycles through several times. My guess is so that the entire unit can get cold enough to start saving the ice. But after a few cycles it makes the ice very quickly."}
{"review":"This is a very negative review: Died after less than 3 months.  Called the company, they wanted me to pay to ship it to them (it's heavy), then pay $25 to fix it.  Not acceptable for the time period.  This is the second one I have tried...both died, although the first, cheaper one, lasted longer.  Rather than pay to ship it and fix it...I threw it in the trash.  Won't be purchasing another one."}
{"review":"This is a very positive review: Love the ice but sounds like it's going to blow up I don't think it's working right and amazon will not respond to me after a long wait I had to turn this"}
{"review":"This is a positive review: It makes like 9 ice cubes at a time. While waiting for more ice cubes the ones already made melt. These products should have a refrigerator system built in."}
{"review":"This is a very positive review: Absolutley LOVE this unit!  We take it camping and it start it as soon as we arrive, before setting up the camper.  The first ice cubes are made by the time we're finished setting up.  It makes great ice and very fast.  I really am amazed at how fast this unit makes ice.  I'm far more pleased with this than I was expecting.  It makes a lot of ice, fast!  Very pleased."}
{"review":"This is a positive review: Gifted it to friends whose freezer ice maker had quit. Heard good things. It is a little noisy and is another chore to run it and transfer the ice to the freezer but they like their ice."}
{"review":"This is a positive review: This ice machine is a waste of your money. We bought this ic machine in on March 16, 2016, it only lasted for 8 months. Then when we called to get a warranty, we were transferred to Curtis International which is overseas. We were told by some guy I could hardly understand that we had to pay $7 for insurance and the shipping and handling costs to get it to Lotus International Company where it would be shipped to overseas to Curt International. We don't know when or if we will receive a new or used product.We shouldn't have to pay anything on a product we purchased in good faith that was defective and I told the guy I was talking to so. PLEASE DO NOT EVER PURCHASE ANY IGLOO PRODUCT. You never know where it is made or what will occur if the product breaks down; and this is a product that is still under warranty."}
{"review":"This is a very positive review: These are slick for garage bars or man caves when you don't want to go to another part of the house for ice.Ice in 3 sizes and actually maintains ice pretty well over long periods. Whatever does melt (cubes noticeably porous after 24 hours) get regrow and dropped on top. Works very well. We own one and bought one for a friend. Little bit of fan and motor noise on initial start up but Ice in 8 minutes!! Easily watch the game or talk with it in same room."}
{"review":"This is a very positive review: Long story, but I can't run a water line to my refrigerator. This is a fantastic replacement. It's a little loud, it takes up a LOT of counter space (luckily I had an unused corner), but it does what it's supposed to. My only real issue is the &#34;small&#34; cubes aren't really all that small... it makes me wonder how big the large ones must be."}
{"review":"This is a very positive review: Hopefully the next unit (replacement) will be much better. After setting the unit up, and filling with water, when the pump comes on, all the water is pumped out of the bottom of the case, onto the countertop and surrounding floor. Obviously a manufacturing defect, one would hope.. at this point, I certainly WOULD NOT recommend this item.. We have used various brands of icemakers like this one over the last 8 yrs and this is the first to be worthless out of the box.. I'll follow up when I received a working unit.=================  new updated review for same brand\/product=============Ok, I'll say the first one was definitely defective. Not what I would expect from a name like IGLOO, BUT... it was quickly replaced by the seller, and the replacement was just what I had expected.. Solid unit and works very well.. It has a larger storage bucket than most, and of course it doesn't really &#34;store&#34; ice. The ice will melt back into the water reservoir to be used again, as all of these type units do.. But .... it is quieter than any we've had (5 previous units in motorhome and house) and is almost unnoticeable when running. Great unit, and great support. 5 stars now."}
{"review":"This is a very positive review: This has been running in my office for almost a year straight now.  No issues, never stop making ice! Looks great too!! High quality ice maker!! Dont buy any other brand!!! Great price too!!"}
{"review":"This is a positive review: This ice machine has worked great running full time since we got it several months ago.  It started making some noise so we ran a vinegar solution through it for a few days and it's fine now.  The only downside is that it only makes 2 pounds at a time.  You have to dump the ice out and store it in the freezer in a bag of your choice to stock up on it.  It has paid for itself already for we don't have to buy ice daily to keep the beer cooler stocked.  It's a handy size and sits on a TV tray in the kitchen where we can monitor it."}
{"review":"This is a very positive review: We are so happy with this purchase.  It provides an endless supply of ice.  We have an ice maker on fridge, however, there is never enough.  Also we are on a well and have triple filtered - this ice maker uses purified water which we always have jugs on hand.  Ice cubes are fresh and plentiful.  As soon as we scope some out, it begins creating new ice immediately.  A bit loud, but we are still getting use to it."}
{"review":"This is a positive review: Steady little worker. Quick ice making (about every 6-8 minutes). Bucket is not insulated, so if you don't empty they will melt\/fuse and the unit remakes ice from the run off. OTOH, the ice holds up well in soda, tea, and bourbon. Very quiet, no leaks and no full. We use small size and they fit in a tablespoon. Very good price and quick shipping. Unit is about the size of two loafs of Roman Meal bread square (2x2)."}
{"review":"This is a very positive review: We are replacing a previous ice maker. This ice maker was marketed as a clear ice 'cube' ice maker from Frigidaire. We ordered from the same group of this offer with pictures in the group of color options with CUBES not bullet ice. We ordered a stainless steel ice maker in the same ad vs the colored options which although it was more costly.  We received an ice machine with bullet ice.  The large setting makes ice considerably smaller than the large setting on our old machine.  Look at the pictures offered in the ad. There are clear pics of cubes NOT bullet ice which melts quickly. The colors of ice makers specified clear cubes. The stainless steel option we chose is the most expensive. Pictures indicated cubes NOT bullet. We would never have thought the difference would be bullet ice.  It takes a glass full of this ice to cool a drink. The delivered item varied from what was advertised. The maker # was identical but not as advertised. We could NOT be more disappointed. We have guests coming and need an ice maker. We can't return in time. Scrutinize the  offers closely. Why was the shipment different from the post?"}
{"review":"This is a neutral review: Loved this ice maker for almost one year. Then it broke. The axle of the tray that holds the water and slides the ice forward cracked and it would no longer make ice after that. The ice full sensor was also always a little finicky."}
{"review":"This is a very positive review: This is a great little ice machine.  I work mine to death and it keeps up way better than the one on my refrigerator.  I bought a stainless steel, insulated ice bucket to dump the ice in when it's made.  It works great!  I'm very happy with it.  It's easy to use and not to heavy for me to lift (I have a bad back).  I just lost my little rubber pug today so hope I can find a replacement one."}
{"review":"This is a very positive review: We love it! This is the best invention since the pizza cuter, it works great. You don't need to buy a ice scoop it comes with one. I didn't know that so I purchased one of those as well. We didn't have an ice maker so this is perfect for us."}
{"review":"This is a negative review: Broke one week after a year of use. It began making an odd noise after 9-10 months and then stopped making ice just outside the warranty. Only one person used the device and when used I made ice for  2-3 cups of water per day max."}
{"review":"This is a positive review: I was amazed how quickly it made ice.  A definite plus when we go out in our RV.  It does what it said it would do..."}
{"review":"This is a positive review: We needed an ice maker to keep our son's ice therapy machine full & running.  He'd had surgery on his badly damaged leg, and icing constantly eased his pain.  This kept making ice and we kept filling our son's machine!  Very nice, attractive looking & does the job!  I would recommend this to everyone!"}
{"review":"This is a negative review: Arrived dented. Ice releases wet, and continues to melt quickly until removed from tray. MUST BAG EXCESS ICE TO BE STORED, as dump into bin and it will freeze as one."}
{"review":"This is a positive review: Good ice maker for the price.  It makes ice very quickly.  After about 10 minutes you have about 10 nuggets of ice.  The only reason I did not rate it higher is because when it's full of ice it is still is only enough for about 4 glasses.  I just wish the ice bucket were bigger."}
{"review":"This is a positive review: I purchased this product as a replacement and wished it was my first one. This machine can make some ice; I have mine next to the sink, for ease of adding water and cleaning. As a suggestion, place on counter-top for 24 hours, before using, to allow all the refrigerant to settle."}
{"review":"This is a neutral review: I just ordered my fourth of these units.  They are all the same, and they last about 18 months to two years.  Buy the service contract."}
{"review":"This is a negative review: Not as I expected... After bagging the ice and putting it in the freezer when you go back to get it it's a solid block... disapointed"}
{"review":"This is a very positive review: This icemaker has been so far working GREAT.  The only qualm I have is the location of the full ice probe is located so as to show  'ice full' when the ice is only half full. Works great otherwise.  Is worth the cost."}
{"review":"This is a positive review: I really like this Ice maker I have not had to run to the store for ice i make three bags a day and it is enough for us two"}
{"review":"This is a positive review: (previous) Have owned this for about a month.  Bought it because our built in ice maker in freezer does not keep up with Las Vegas ice demand for a family of  four adults staying hydrated and refreshed.  We don't run it full time, only when needed.  It only takes a few minutes to produce ice. Looks great on the counter next to the stainless fridge. Simple to use, glad we purchased.(current) Stopped working in mid-January so we got 10 months use of it.  Water no longer gets siphoned into ice maker and pusher.  Rods no longer get cold.  We were hoping this might last a couple years.  Suggestions???"}
{"review":"This is a very positive review: Have had this for almost a year now and it works the same as the day I bought it. No fuss, No hassle, fill it and enjoy your perfect ice cubes in minutes! Easy to clean, quiet. Very good price point!"}
{"review":"This is a very positive review: I had to wait about a week before I even attempted to write a review. I don't have fond memories with countertop ice makers. In fact I hesitated ever buying one again after my first encounter with a an oversized della that cost twice as much. It IDK it was garbage within the first 3 months because warranties and no knowledge base built for repairs.  Tons of these just die out for ridiculous reasons to end up never working the same . HOWEVERI am excited to tell you , at least for me anyway , that this Igloo ice 103 counter top machine is an Ice making monster . I was very surprised at how well this thing works after having one that never worked right from the beginning. Yes I will be afraid to ever unplug it from the wall or to move it at all. (seems  those two things manage to kill off a once decent ice maker).  I would without a doubt  tell you about this ice maker . Della I'm sorry for putting your product down but this product puts one of your best to shame . Until the companies decide to make a freezer ice maker this one with the over size basket will be just fine . Also its making ice so fast and large even the small cube is large and I cant keep up with production.  Very fast and constant . be ready with the kool and clean water is best ...Hope this helps"}
{"review":"This is a negative review: This ice maker is not a freezer.  It does not keep ice cubes frozen and the ones that it does make melt quickly.  In addition, the ice cubes are small -- even the &#34;large&#34; sized ones.  The amount of ice cubes made in a given time is negligible -- only 9 cubes made at a time.  And the amount of time it takes to make a 9 cube batch is not as quick as described.  The machine looks nice, but not as useful as some say."}
{"review":"This is a negative review: This machine works terribly. It says 8 min for small cubes and it has been over an hour and it has produced about 15 small ice cubes."}
{"review":"This is a very positive review: Very nice. It can't keep up with a busy night at our club house. But for a home unit it would be perfect making a full glass of ice every 6-8 minutes with a nice catch bucket. For our busy nights, we empty the catch bucket into the freezer a couple times during the day before the party then let it run and pour the ice from the freezer back into the unit as needed for easy access when it can't keep up. But we serve a lot of drinks on a busy party night. Honestly, for normal home use this would be wonderful and keep up very nicely. We no longer need to buy bags of ice each week for our parties."}
{"review":"This is a very positive review: This bad boy is one ice producing maniac!!!  Makes ice fast.  They give you 3 choices of sizes but I can barely see the difference between small and large.  I will say that it is loud.  Our other machine made almost no noise at all.  This one is pretty noisy.  We use an icemaker in our rv when we take vacation every summer so that we don't have to mess with bags of ice.  We got this a few weeks ago & set it up to see how it works & my husband won't shut it off.  We have a refrigerator with ice in the door, but he loves this thing so much he doesn't want to shut it off.  It's been great!"}
{"review":"This is a negative review: Worked ONE whole week. Motor stopped running and it didn't make ice anymore. I did not have the box anymore, as I live in an RV, so I couldn't take it to Kohls to return. I ended up having to ship in purchased Home Depot boxes. Item was heavy, took up too much space and was a disappointment."}
{"review":"This is a very positive review: This ice maker made ice pretty fast,  we never timed it.  It was fairly loud but we are mostly on the second floor so it didn't bother us.  However,  after just about a year it has stopped making ice.  Luckily it's within the warranty so I'm hoping they give us a new one or pay for repairs. I'll update this review once we know. If they take care of us I'd say the rating would be four stars.  If not,  then one star.  I can't say having it for a year then needing to replace it is worth it. I would rather have used trays in the freezer or went to the store and bought bags."}
{"review":"This is a negative review: Advertised as &#34;Sonic&#34; ice.  Not even close, VERY disappointed.  I feel like I overpaid for this machine when I could have purchase one that makes this ice for half the price.  Sonic ice is nugget ice, not this stuff."}
{"review":"This is a very positive review: So far so good.  Was impressed with how fast this pumps out the 9 cubes at a time.  Quiet for the most part and the operations is pretty simple.  Love the fact that you just fill it and let it run!  Ice is nice and our 2 year old loves that she can use the cubes as fingernails (the hole in the cube fits perfectly over her fingers).  She gets a kick out of it!  Great addition to our camper!"}
{"review":"This is a positive review: It took me longer to unbox this item than it did for it to produce its first ice cubes.  Super excited about having ice available again given we rent and the house has a refrigerator without an ice maker."}
{"review":"This is a very positive review: I ordered the ice maker and it came in record time.  I have purchased refurb machine in the past, so this was the first &#34;new&#34; ice maker I invested in. And, bit am I a happy with it.  Works like it supposed to.  First cubes appeared within minutes of plugging it in.  Because the ice well in deeper than most others, it doesn't get bogged down with too much ice - which is what happened to the last 2 that I bought.  It's chrome and black cladding make matches the refrigerator and the coffee maker too.  Have had no problems!"}
{"review":"This is a very positive review: Overall, it's a decent ice maker.  When we use it camping in the summer we find that it does better inside the camper where it's cooler.  Also, the lid\/top portion doesn't seem to be insulated well enough.  If you aren't constantly using the ice, it tends to warm and cool while sitting in basket and the ice cubes freeze together."}
{"review":"This is a very positive review: Absolutely LOVED IT for the 5 months that it worked. I'm going through the maintenance drill now, but judging by other one-star comments, this won't be going anywhere. As soon as I get word to box and ship, I'll be taking my ass (see what I did there? :-) ) somewhere else.UPDATE: I was at 5 stars and then dropped to 1 star when it started acting up. I called the service number and they provided a reset key combination and it is working again. So, I've raised it to 4 stars. Again, when it is working, I love it.UPDATE: Malfunctioning again. Sure wish I had jotted down that reset drill."}
{"review":"This is a very positive review: My fridge died. No ice while I waited the month that it took to get a repair service dispatched by the manufacturer. So I bought this unit to fulfill my ice needs until my fridge got its act back together.I like it so much that, even though my fridge is making ice again, I still use it. I like the smaller, bullet shaped ice it makes compared to the larger \"standard\" cubes my fridge makes. So I often have this going, especially on hot days, when I am drinking a lot of water or iced tea.If you don't have an ice maker, this does a great job of keeping you stocked up with ice, as long as you have a freezer to put it in. It's important to note that, like most countertop ice makers, this does not have any freezer capabilities. That is, it does not keep the ice frozen. It makes ice; it melts; the water is recirculated back into ice making. So unless you have an ice bucket or you put the ice in the freezer, it will melt. But it makes ice so fast that the ice basket will fill up pretty quick. I didn't find myself standing around waiting for ice to appear.Can't speak to longevity\/durability, but, hey, Frigidaire. I expect it to work for a long time and expect Frigidaire to have good warranty support. So, I felt it was well worth the money."}
{"review":"This is a negative review: I purchased this less than a year ago and purchased the extended warranty for 4 years.  It broke 11 months after I bought it.  I went to company that has the extended warranty and they said because it was within 12 months it wasn't covered and to go to the manufacturer.  I went to Igloo and they told me another company manufactured it and I would have to to to them.  I went to them and they denied the claim because it was beyond the warranty period."}
{"review":"This is a very positive review: Next best thing to having your own ICE HOuse.Would buy a again.Well made and has been running for almost a year with no problems."}
{"review":"This is a very positive review: ***UPDATE***Well, 7 months later this machine just shot craps. I highly DO NOT recommend this machine. I love my ice machine. I hope it last longer than my last one. That was one year."}
{"review":"This is a positive review: i am happy with my new icemaker. the only issue is that it registers &#34;ice full&#34; when ice has built up on one side but the basket is not full."}
{"review":"This is a negative review: I gave it a one star because it at least turned on.  Unfortunately we received a faulty one.  We are unable to select ice size as the button is not working.  We'll see how long this ice machine last.  I do not recommend.  Look at other options.  Thx!"}
{"review":"This is a positive review: This ice maker made the best ice! Emphasis on MADE. Past tense. The basket which holds the water to make the ice broke within 7 months. So it worked great until it didn't"}
{"review":"This is a neutral review: REAL SLOW ice production plus the ice is very wet and hardly frozen when dispensed. I let it run for about 2 hours and had perhaps 10-12 small ice 'bullets'."}
