{"review":"My unit looked pretty much as pictured except I have what resembles duct tape around the center of mine to cover the surprisingly sloppy glue job of putting the two halves together.  The sloppiness of the adhesive is very apparent on the inside but so far no leaks and the brown glue hasn't come off on my clothes that I have noticed. UPDATE: after seeing a recent reviewer remark about the seam problem and leakage I took more notice of mine and sure enough, the tape was coming away and it was because of seepage - I emailed customer service on Saturday, they responded on Monday morning right away they were sending a replacement and I had it Wednesday. You really can't ask for better service.  So, they had a bad batch and that can certainly happen with all the offshore mfrg these days.  Mine did come with some instructions and there is a little diagram at the bottom of the sheet and it is not really hard to put together if you even look at the picture here. It did not come with an extra handle as some have said but then again if you break the handle you are doing it wrong. This is not hard to crank if you hit the \"sweet spot\" of load's water\/clothes ratio. I didn't think the stand was as flimsy as people are saying.  A lightweight tubular metal might be a nicer touch but this is serviceable. One of the warnings they give I cannot understand: \"Do not release the pressure lid of machine if machine is still hot as vacuum can form when machine cools down\" - huh?  If you opened the lid you can't have a vacuum. Don't understand - I think they mean to drain with the tube rather than open lid if machine is hot. I think.The washing instructions are maybe easier if you have a scale to weigh your load, if they gave some average examples it would be better.  They don't mention whether chlorine bleach is safe (I was thinking of the glue) or how much of it to use and the amount of detergent though they list, I am sure can vary by concentration so it is a learning curve.  I did use chlorine bleach on two loads of whites and the glue has not disintegrated but I will try to limit my use of it in case - I am using about a tablespoon for a full load of 6 quarts.  I am going to email mfr and ask - will update here.  One word of warning - if you use bleach do not have face near opening when you you unscrew lid!  Whew, close call there lung full of hot bleach fumes - not nice.  UPDATE - I did email customer service during normal business hours and they responded within the hour that it is safe to use chlorine bleach.  I can tell you I have used 1 tablespoon to a full load (6 qts). The directions on the bleach bottle for 1 gallon of water is a quarter cup.  YMMV - I may up what I am using a bit but be careful when you open, it can be really fumey!I did better on my second load. By my third load I was a pro. On my fourth and fifth loads I got complacent and didn't tighten the lid down properly and OOPS flood.  My fault entirely but my sixth load was the two bath mats I used to soak up the deluges :) from 4th and 5th loads. It handled the two bathmat\/towels fine.My logistics: no room in the kitchen so I am using the bathroom.  It doesn't fit in my tub very well - I believe this is a nonstandard (like everything here) small tub.  So for my second load I dragged and manhandled a sturdy occasional table through the nonstandard small doorway to hold this (and the spinner after)next to tub but there was only about an inch of clearance around table and I could barely reach the tub faucets.  So I picked up a sturdy fairly large step stool that is just a little lower than tub edge, but drain tube is high enough to clear. I fill it up with measured hot water with a pitcher.  For rinses, I do two - sort of- with cold water and I use my shower massage, first swishing them up a bit with the shower going in there with drain tube attached and let it run out a bit. Then pull tube and I close it up with a good amount of water and give it a couple of spins. And you definitely want a spinner\/extractor if you are going to do real laundry, of course.Now why you would want to put yourself through this if you are not a camper\/nature enthusiast\/environmentalist? I have had my eyes on this and similar items for awhile now as I went from a condo with my own washer and dryer to an efficiency (nothing efficient about this place) apt that not only does not allow a real portable but there is no where to put it.  My kitchen area is the size of two telephone booths and my bathroom a single telephone booth.  The laundry facilities were initially clean here but have gone downhill to a level of filth I simply can't reach with disinfectant wipes (you don't want to know what I discovered in the non user-removable lint strainer of the washers) and have seen people putting damp dirty towels and sheets and clothes into the dryer to save money bragging they are so \"clever\". No, they are filthy disgusting pigs. This isn't the venue I guess to talk about the laundrymat miseries. Pardon tangent.Summary: I would recommend, I take off one star for the really sloppy glue job inside, you don't see it but your clothes are certainly rubbing against the brown adhesive and you have to wonder when something is going to come off on your good white blouse."}
{"review":"This helps me a lot. I used to have to wash a small amount at a time in the kitchen sink. Now I can wash more at a time and my clothes got clean. One happy woman."}
{"review":"After not using my little washer for a few months I needed to use it while camping.  I am so irritated that it will not seal at the lid now. It keeps leaking all over the place making a huge mess. Upon looking closer I realized the top seal is completely apart and unglued.  No way to reseal it. I had only used this a few times when I received it and can't believe it fell apart like this already."}
{"review":"Beautiful little tool for manually washing clothes.  Perfect for a disaster scenario or just to hand wash a few items in an emergency.  Love this thing."}
{"review":"Got it with a spin dryer.  Keeps me from using a crowded laundry room where they are mostly offended by people who wear face masks and like social distancing.  I presoak, don't over-pack with clothes and keep up with the wash.  In other words, know how to do laundry from my mom and her generation. Checked YouTube and saw how others used it too.  Then you figure it out for you."}
{"review":"My washing machine broke at the start of the recent quarantine, and I'm still waiting for an appointment to have it fixed.  With most laundromats closed, in desperation I bought a Wonderwash, hoping it would tide me over until I can get my washing machine fixed.This little machine is great! It is well-made and all the parts feel sturdy and high-quality.  It arrives unassembled but is a breeze to put together, it takes five minutes and no tools. I highly recommend watching one of the instructional Youtube videos before doing your first load of wash, it explains the process thoroughly, but the basics are: determine load size, add a small amount of detergent and fill with hot or warm water to the fill line. Add clothes, tighten down the lid, then just turn the crank for two minutes or so (I time it by listening to a song on the radio.)The key is to turn the crank slowly, not quickly, and let the wet laundry fall from the top of the chamber to the bottom with a good thud each time.  This drives the water and soap through the clothes and cleans them thoroughly. Once you're done, drain the chamber using the supplied pipe, then refill with cool water to the fill line and crank for two minutes again to rinse.My clothes came out really clean! Even garments with cooking stains washed right up.  The only drawbacks are that water tends to splatter around a bit when you drain the chamber, and I found that to drain it completely when I was done I needed to turn the whole chamber upside down and let it set for a bit.  I use the Wonderwash in my bathtub, so a little bit of water splashing around is not an issue.Other than that, this is a perfect little machine for doing small loads of laundry. It was a desperation buy, but I am really pleased with it!  After my main washer is fixed, I intend to keep it to use in my RV camper.  It would also be great for dorm or apartment dwellers."}
{"review":"It is ok. The lid is a bit tricky. It is easy to put together and not bulky.  If it breaks I will not buy it again."}
{"review":"This is NOT an alternative for laundry machines.  I was hoping to use in my apartment but its a disappointment for that use.  I'd have given three stars but the description says \"ideal for apartment dwellers\" and its not.It fits about half of what I can get in a laundry machine, so it saves about $1 for me each load.  The design isn't great, it could be engineered much more compactly and sturdy.  The drain is slow, so add another 2 minutes for draining to total wash time.  I found it was easier to place in the bathtub and just turn upside down and let it drain from the top.  But then you're in the bathtub, leaning over doing all this, getting wet, for a good 6 minutes, for about two days of laundry (single person)...your back will not say thank you.  More trouble than its worth.  Finally, I usually hang dry my clothes anyway to save money on dryers, but having no spin cycle actually makes a difference.  Trying drying corduroys in a reasonable amount of time without wringing each clothing item...add another 3 minutes.If you wanted to bring on a camping trip it might be ok, but again, it could be designed much better.  For an RV it would probably be fine but I'd worry about breaking it on a camping trip (all plastic parts).In summary, for a \"normal\" person trying to use in their apartment, this wont work.  For someone who is super eco friendly and doesn't mind spending a ton of time doing their laundry, you'll probably enjoy this."}
{"review":"This is a great product. I live in a small apartment with no laundry hookups nor a community laundry area. I had to drag all my laundry to a relative's house and spend the entire day doing laundry. Now I can do all but the really big stuff (like jeans, heavy sweaters, sheets, blankets, jackets, large bath towels&mats) at home. It fits nicely under my kitchen sink along with the countertop spin dryer. It takes about 10 minutes total to wash, drain, rinse and drain again per load. Stains you will need to pre-treat and use a little elbow grease on prior to putting it in the washer. I can't believe I didn't purchase one sooner. I use soap nuts liquid and a little borax in the wash water and I add about 3 TBLS of white vineagar to the rinse water. The borax and vineagar help with the extremely hard water that I have in this area. My clothes come out clean and dry nice and soft."}
{"review":"I originally got this for in case the electricity goes out, which occurs from time to time due to living in an old home with outdated electrical wiring and living in Hurricane zone (South Florida). However, I tried it out on a pair of sneakers (my washing machine can't handle shoe washing) and I have to say I will be using this to wash shoes, boots and plushies that can't be washed in the washing machine. It really handles the heavy duty stuff well. Just spin the barrel slowly and it wouldn't crack. It also drains well, but make sure to wash it out the dirt in the barrel before washing anything else afterwards and give a second cycle, since shoes will have dirt residue. This is normal, since it is also an issue in electrical washing machines. Biggest difference is that this barrel won't break down or turn off. I LOVE IT! I highly recommend it and for $50 bucks it is well worth it! The only thing I have a complain over are the o-rings to hold the machine in place of its legs. The o-rings move too much. I feel like key chain rings would hold in place better but I haven't tried it out. I also feel that the barrel should have a hole at the bottom to have a removable plug to remove the water manually and to allow drainage while respinning to \"spin dry\" the items inside to make drying the items easier. Rather than twisting the extra water out by hand. Even with these two complaints, I am really happy with the purchase. It is still an easier nonelectric method than using the hands 100% for washing. This is a must for those who wash by hand or need something that will wash heavy items that the ordinary electrical washing machine can't handle."}
{"review":"Wash it before you use it (smelled literally like fish). Do not over pack it. On the whole pretty good. Only used it once so far. Pretty cheap plastic but the suction cups are very strong.Okay, used it again today. Still smells like plastic\/fish (even though I washed it out before using it again). No good way to get it all dry inside after using it unless you use a towel (which would then also smell funny). It's very difficult to rinse clothes in there (always seem to have residue), so just rinse them under the tap. I'm not sure how happy I am with this purchase. I love the idea of it, but so far it's not actually that great.Update on 2\/9\/17: One of the suction cups broke off completely. Still gets the job done."}
